{
  "filename": "Agricultural Pollution Field Burning.pdf",
  "processing_timestamp": "2025-07-06T18:27:11.441016",
  "text_extraction": {
    "success": true,
    "character_count": 20117,
    "output_file": "2_processed_data/text_extracts/Agricultural Pollution Field Burning.md"
  },
  "table_extraction": {
    "success": true,
    "table_count": 2,
    "output_file": "2_processed_data/table_data/Agricultural Pollution Field Burning_tables.json",
    "tables_summary": [
      {
        "id": "Agricultural Pollution Field Burning_table_0",
        "shape": [
          7,
          29
        ],
        "accuracy": 86.04363534112265
      },
      {
        "id": "Agricultural Pollution Field Burning_table_1",
        "shape": [
          5,
          21
        ],
        "accuracy": 78.29700684720025
      }
    ]
  },
  "quality_metrics": {
    "text_success": true,
    "table_success": true,
    "character_count": 20117,
    "table_count": 2,
    "error_count": 0,
    "processing_completeness": 1.0
  },
  "errors": [],
  "full_text": "# Agricultural Pollution **Field Burnin** **g**\n\n\n### **Why Care about Agricultural Burning?**\n\nThe practice of burning unwanted vegetation to prepare land for sowing crops or other farming activities\nis a worldwide and long-standing practice. Its tenacity,\ndespite its harmful consequences for air quality, soil\nhealth, and the climate is a testament to its convenience\nand acceptance among farmers across a wide range of\nfarming systems and agroclimatic zones. Burning is so\nbroadly perceived as being natural that even its immediate toxicity is generally overlooked. Overall, there is\nno greater source of primary fine carbonaceous particles\nthan biomass burning, and it is the second largest source\nof trace gases in the atmosphere. Yet while the polluting\neffects of burning are seldom a concern of agricultural\nproducers, the act of burning often defies farmers’ own\nunderstanding of the multiple benefits of biomass residues, which include nourishing and improving soils.\nThat said, the embrace in the past two decades of alternatives such as no-till farming on a fairly wide scale\nin parts of Europe, Asia, and especially the Americas,\ndemonstrates that change is possible with the right mix\nof public sector support and regulation.\n\n### **Nature and Magnitude of the Problem**\n\nAround the globe, in farming systems large and small,\nburning is one of the most commonly used methods for\nremoving crop residues after harvest. It is particularly\nprevalent following the cultivation of maize, but is also\npracticed with rice, wheat, sugar cane, and other crops\n(see figure 2). Burning is also a common way of preparing lands for cultivation after they have been fallowed.\nIn aggregate terms, China, India, and the United\nStates are the top burners of crop residues, followed by\nBrazil, Indonesia, and the Russian Federation. In relative\nterms, however, Africa is home to some of the most intensive rates of residue burning per hectare of harvested\nland. It is also the region where burning is growing the\nfastest. Among the top 20 burners (in aggregate terms),\nMexico and Tanzania stand out as the most intensive\n\nburners, followed by Brazil, the United States, and Nigeria. And over the past decades, burning has progressed\nsignificantly in countries including Brazil, Indonesia,\nThailand, India, and China (see figure 3). [1]\n\nTo put the above in perspective, however, crop resi\n\n\n**Figure 1:** Field Burning in the U.S. Great Plains\n\n\n_**Source:**_ © NewsNetNebraska.\n\n\ndue burning represents only a small fraction of overall,\nagriculture-related open burning of biomass (see box 1\nand figures 4, 5 and 6). With regard to black carbon contributions, for instance, the burning of crop residues is\nestimated to represent only around 5 percent of overall\nopen burning emissions (Bond et al. 2013).2 This note\nfocuses primarily on crop residue burning because it is\nunambiguously related to agriculture, and represents a\nsignificant pollution abatement opportunity.\n\n### **Impacts**\n\nThe open burning of biomass releases a range of air\npollutants that are known to contribute to the deterioration of air quality. This has especially harmful effects\non human health and negatively affects crop growth,\nnatural ecosystems, visibility (due to haze), and physical\ninfrastructure. The key pollutant from a human health\nperspective is particulate matter (coarse particles of 2.5\nto 10 microns, and fine particles of 2.5 microns or less),\nthe impacts of which are mostly local and modulated by\nits concentration, by population density and exposure,\nand weather conditions. Other local air pollutants that\nresult from biomass burning include carbon monoxide (CO), volatile organic compounds (VOCs), nitrogen\noxides (NOx), ammonia (NH 3 ), sulfur dioxide (SO 2 ),\ncarcinogens such as polycyclic aromatic hydrocarbons\n(PAHs), and multiple other toxic compounds. Short- and\n\n\n\n**1** These rankings are based on Food and Agriculture Organization estimates of kilograms of biomass burnt, and do not take\ninto account all-important emissions factors.\n**2** Open burning is the largest source of global black carbon emissions.\n\n\n_This note was written by Emilie Cassou. Full references and acknowledgments are available online._\n\n\n## Agricultural Pollution Field Burning\n\n\n\nlong-term exposures to particulate matter and air pollutants more generally are strongly associated with a\nrange of health responses including respiratory and cardiovascular disease, lung cancer, and premature death.\nIn crops, ground level ozone (formed when NOx, CO,\nand VOCs react with sunlight) can reduce photosynthesis and prohibit plant growth. Acid rain resulting from\nthe emission of SOplants, affect soils, and corrode urban structures. 2 and NOx is also known to damage\nBiomass burning also releases several climate pollutants, including the greenhouse gases (GHGs) carbon\ndioxide (COand fine particles known as black carbon. The effects of 2 ), nitrous oxide (N 2 O), and methane (CH 4 ), [3]\nthese and other co-emitted species on climate are variable and complex. [4] Schematically, however, there are\ntwo major and unambiguous ways in which biomass\nburning contributes to climate change. One is a longterm warming effect linked primarily to CO 2 emissions,\nthough also to other GHGs, from deforestation and other forms of land conversion during which biomass is\nburnt and not fully replaced. The other is a short-term\nwarming effect attributed to the emission of black carbon from the burning of biomass in relative proximity to\nsnow- and ice-covered regions of the planet (see box 2).\nIn addition to polluting, the burning of biomass\namounts to destroying a resource that can be put to valu\n\n\nable uses that range from improving soils to controlling non-point\nsource pollution, and reducing the\nuse of substitute materials or products. Straw is a source of nutrients **5%**\n\n(nitrogen, phosphorus, and sulfur)\nand organic materials that, when Wheat **23%**\nreturned to the soil through the\nprocess of decomposition, contribute to nutrient cycling and topsoil\nformation. These, along with the use\nof straw to maintain ground cover,\ngenerally improve soil properties, **24%**\nhelping to slow runoff and erosion, Rice, paddy\nenhance nutrient availability and _**Source:**_\nplant growth, and mitigate yield _**Note:**_\nrisk. While burning returns some matter.\nnutrients to the soil and can even\n\nresult in a burst of fertility in the\nshort run, most of the organic material and nutrient content of straw is lost under high temperatures. Burning,\nmeanwhile, can perturb soil pH, moisture, and biota (for\nexample, bacteria, fungi, algae, protozoa, earthworms,\narthropods, and termites), resulting in imbalances. Beyond the farm gate, renouncing the recycling of biomass\nrepresents a lost opportunity to reduce downstream wa\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n**3** It also emits precursors to the GHG ozone (O 3 ).\n**4**\nThe burning of “renewable biomass” is generally considered carbon neutral. Even though it can influence the climate for\nyears before it is resequestered, the CO2 emitted in burning biomass is not considered a contributor to long-term climate change\nif the equivalent biomass is regrown, as in crop farming. Burning-related emissions of CH4 and N2O—GHGs that are respectively 25 and 298 times more potent than CO2—do contribute to radiative forcing even when the burnt biomass is replaced;\nhowever, biomass burning-related emissions of these gases are dwarfed by other global sources. Note that burning has also\nbeen found to increase biogenic soil emissions of CH4, N2O, and nitric oxide (NO)—that is, linked to soil microbial activity.\nThe emission of pure black carbon has a potent and immediate (“near-term”) warming effect on the climate. Depending on its\nsource, however, its warming effect can be countered by co-emitted species such as organic carbon, which can have a cooling\neffect. As a result, the net, near-term effect of burning-related emissions on climate depends on a complex set of circumstances,\nincluding where burning occurs (box 2).\n\n\n## Agricultural Pollution Field Burning\n\n**Figure 4:** Burning Plantations and Rainforests in Indonesia\n\n**Box 1.** What Is\nAgricultural Burning?\n\n\nAgricultural burning refers to any\nopen-air burning of biomass that\nis driven by agriculture and results\nfrom fires set intentionally in\npreparation for farming activities.\nAlthough this is conceptually\nstraightforward, the challenge\nof empirically establishing\nthis causal relationship makes\nagricultural burning exceedingly\ndifficult to define in practice, as\nwell as to measure. Whereas\nthe burning of agricultural\ncrop residues squarely fits the\ndefinition, other forms of open\nburning of biomass, including\nthe combustion of forests,\ngrasslands, and savannah, cannot\nall be traced to agriculture. A\nsmall minority of wildfires are\nprovoked by natural causes\nsuch as lightning, for instance,\nand planned agricultural fires\naccount for “only” 10–20 percent\nof open burning (ICCI 2014).\nThe vast majority of open\nburning is believed to result\nfrom the uncontrolled spread of\nagricultural fires.\n\n\n_**Source:**_ © EPA/STRINGER (above); © Regina Safri/Antara Foto/Reuters (below).\n\n\n\nter pollution linked to soil erosion or the additional use\nof synthetic fertilizers for instance.5 Other valuable uses\nof straw precluded by burning include its use for energy, feed, construction materials, or bioplastics. The value\nof using biomass in these and other cases comes from\ndisplacing other sources of these (such as energy or materials) and associated externalities. In other words, the\nimpact of burning is to not prevent these externalities.\n\n### **Drivers**\n\n\nBurning patterns in the Andes and Himalayas were\nfound to reflect multiple factors, and especially tradition,\nease, timing, weather and location, and the practicality\nof alternatives—the latter being partly determined by\naccess to appropriate tools or markets for biomass residues. Across regions, burning is widely seen as a quick\nand inexpensive way to manage crop residues while preventing pests and diseases. And burning crop residues\ncan indeed be a rapid way to prepare fields for a second\nor third crop—an aspect that matters in certain farming\ncontexts, where time and labor constraints factor into\n\n\n\nfarming decisions. In parts of China, for example, there\nis a short window of typically one to two weeks for the\nremoval of crop residues between harvests. Burning is\noften the preferred method of land preparation in such\ncases. In Russia, a sharp rise in residue burning has been\nlinked to the virtual collapse, since the 1990s, of the country’s livestock sector along with its appetite for stubble.\nIn general, while the cost-benefit reality of burning\nvaries significantly and depends on many factors, burning is widespread because so many farmers perceive it\nto offer multiple benefits—and presumably ones that\noutweigh its costs. At the same time, farmers’ favorable\nperception of burning is partly owed to the fact that they\ndo not factor in the environmental and health costs of\nburning that are felt off-farm—its negative externalities. Meanwhile, in contexts where bans or regulations\non burning are in place, weak enforcement means that\nthere is little disincentive for farmers to carry on with\nthe practice.\nIn parallel, a lack of awareness (that is, a partial\nawareness of the costs and benefits of burning and its\n\n\n\n**5**\nThat said, the retention of straw on fields is often associated with higher reliance on pesticides to control unwanted species\nincluding weeds, termites, and rats. This is not an issue when residues are transformed into biochar, a soil amendment.\n\n\n## Agricultural Pollution Field Burning\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n## Agricultural Pollution Field Burning\n\n\n\nthem purchase or lease the equipment or inputs that are\nrequired. Investment can be further hampered by insecure land tenure, as seen in much of Sub-Saharan Africa\nand parts of Asia. Farmers also often lack the technical\nknowledge and know-how to adopt alternatives, and in\ncertain contexts, collective action or markets are insufficiently developed to help farmers overcome some of\nthese obstacles.\n\nIn addition, culturally produced mental models, social customs, present bias, procrastination, and other sociopsychological factors can play a role in perpetuating\nlong-held practices. Burning, for example, can be held\nin place by the notion that crop residues are a form of\nwaste, rather than a resource, and the customary belief that burning is the least costly way of removing a\ncumbersome waste stream. The idea that crop residues\nare a waste stream can also minimize the feeling of loss\nassociated with burning. The central place of plowing,\nin many farmers’ concept of land-preparation can deter their adoption of residue management practices that\ndo not involve burning (box 3). A tendency to discount\nfuture gains and losses known as present bias can also\ninterfere. In other words, farmers may pursue the shortterm boost in soil fertility that burning offers, even\nwhile knowing full well that soils suffer from high temperatures, the loss of organic matter, and the excessive\namounts of fertilizer that are often applied in compensation. And like all humans, farmers can simply procrastinate, intending to change practices but never actually\nimplementing the change.\n\n### **What Can Be Done?**\n\n\nThere are multiple alternatives to burning, many of\nwhich can be directly valuable to farmers. [6] Staying focused on crop residue burning—the broader question of\nopen burning being beyond the scope of this note—major alternatives involve repurposing residues as ground\ncover, soil amendments (that is, mulch or compost), animal feed, or as feedstock for energy, [7] construction materials, paper products, bioplastics, and other artifacts. All\nof these can take on different forms, scales, and levels of\nsophistication. They can also take place on- or off-farm,\nwith the latter relying on the aggregation of residues\nfrom multiple farms to achieve economies of scale. Offfarm solutions can also involve larger upfront investments, as well as additional costs and complexities associated with moving product around. At the front end,\nresidues need to be collected from multiple farms, and\n\n\n\n**Figure 7:** A Band of Fire Across Sub-Saharan Africa\n\n\n_**Source:**_ National Aeronautics and Space Administration (NASA), January 30, 2016.\n\n\nat the back end, their byproducts distributed—processes that can involve varying degrees of commodification\nand market transacting.\nHelping any of these become a reality, rests first and\nforemost on supporting the technical feasibility and\neconomic attractiveness of alternatives to burning. Yet\nit also requires that the full range of drivers and barriers be addressed, including hidden costs of switching\npractices, farmer perceptions of crop residues and different possible uses of these, and such factors as present\nbias, action-intention divides, and even sociocultural\nconstructs (that is, mental models or schemas). Thus, a\nrange of instruments are needed to support alternatives\nto burning.\n**Laws and regulations.** Through legal action, burning can be restricted or outright banned. Several U.S.\nstates, for example, use a permitting system to limit\nburning to specific days, times, and atmospheric condi\n\n\n**6**\nBesides alternative uses of biomass, increased combustion efficiency can also reduce burning-related pollution (especially\nparticulates). Meanwhile, reducing the amount of residues that are generated in the first place, while theoretically possible,\noffers more limited options in practice. That said, reducing land clearing is a highly relevant though much larger topic that\nrequires addressing the complex drivers of deforestation.\n**7** The use of crop residues to generate useful energy (for example, biogas, or fuel used in cement production) can mitigate\nburning-related pollution to the extent that burning can occur in more controlled conditions, thus resulting in lower particulate\nand methane emissions. Beyond this, its main benefit is to displace other forms of energy production and any pollutants associated with these.\n\n\n## Agricultural Pollution Field Burning\n\n\n\ntions; and the burning of straw and stubble is outlawed\nin most of the European Union’s member states. Many\nhave been able to manage or curb burning in this way,\nbut evidently, legal action there and elsewhere has varied in effectiveness. In China and Russia, national and\nsubnational bans on burning have yielded particularly\nlimited results. The efficacy of legal measures generally\nrests on multiple nonlegal measures and circumstances,\nincluding efforts to make the law known to farmers, a\nrule-abiding culture, the capacity to detect and punish\nillicit burning, and not least, the alignment of economic incentives and other motivators with the law. Several\nU.S. states use a combination of fines, aerial photography, remote sensing, and tip hotlines for enforcement.\n**Information, knowledge, and innovation** . Various\nforms of information and knowledge are needed to curb\nopen burning. They are needed to support an understanding of, among others: the costs and benefits (both\npublic and private) of burning and its alternatives; the\nexistence and extent of these; legal and regulatory requirements pertaining to them; where, when, and why\nburning is carried out (satellite detection can help up\nto a point); and how to implement alternatives (that is,\ntechnical information). Where farmers’ beliefs about the\nbenefits of burning—or conversely, the inconveniences\n\n\n\n**Figure 8:** No-Till Agriculture in Brazil\n\n\n_**Source:**_ © Miguel Altieri.\n\n\nof not burning—are deeply rooted, and even socially\nor culturally reinforced, information alone may or may\nnot counter these where they stand to be rectified. The\nabove underscores the need for multidirectional flows of\nknowledge and information, as well as the importance of\nhow information is framed and delivered. It also points\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n## Agricultural Pollution Field Burning\n\n\n\nto the need for a multiplicity of actors, including but not\nlimited to traditional agricultural extension and advisory services, to be connected and engaged in generating\nand conveying information, knowledge, and technology\nto support alternatives to burning (see box 3). Without\nrobust information and innovation systems in place, efforts to curb open burning are likely to be in vain.\n**Sticks, carrots, and nudges** . In the Andes prior to the\narrival of the Spanish and the introduction of the plow,\nthe practice of burning fields carried a penalty of death\nbecause it damaged the soil, the lifeblood of high agricultural yields, reports a 2015 report by the International\nCryosphere Climate Initiative. Today, gentler approaches to advocacy and enforcement are more in vogue—instruments such as fines, taxes, subsidies, and behavioral\ninterventions known as nudges that ultimately let farmers decide for themselves. Whether or not they accompany legal action, these instruments can be used to correct\nexternalities (that is, to expose farmers to the full costs\n\n\n\nand benefits of burning and its alternatives), and even\nto overcome sociopsychological barriers. For example, if\nit can be detected, burning can carry a fine, and alternative uses such as no-till, composting, and biogas production can be encouraged through concessional credit\n(for example, for the production or purchase of equipment), tax incentives (for example, for compost or biogas\nproduction), and supportive public investments. The effectiveness of different instruments is highly contextual\nand can be unrelated to their cost. The convenience of a\n\nresidue pickup service, the persuasiveness of a community-based enforcement system, or even the influence of\nrole models, may be more effective at dissuading burning than a cash incentive or fine. In sum, the complexity,\npersistence, and context specificity of the burning challenge needs to be mirrored by patient forms of public\nsector support that enable technological as well as social\ninnovation—involving, serving, and motivating stakeholders at every level.\n\n\n",
  "table_data": [
    {
      "table_id": "Agricultural Pollution Field Burning_table_0",
      "page": 2,
      "accuracy": 86.04363534112265,
      "data": [
        {
          "0": "Figure 3: Geography and Evolution of Crop Residue Burning\nMillions of kg of biomass dry matter\n70\n60\n50\n40\n30\n20\n10\n \n \n+\nn\nn\ne\na\nr\nr\na\n+\na\na\na\n+\n+\ni\nc\ni\ni\np\ni\ne\n+\ni\ne\na\n*\ns\nl\nt\ns\ns\ni\ns\nt\nA\nr\ni\no\na\nf\ns\ne\ns\nr\nz\nS\nd\nA\nA\nA\nn\n \n \n \na\nn\na\ne\nA\ni\na\nu\n.\n.\n.\nn\na\nU\nr\nI\nc\nE\no\nh\nE\nE\nS\ni\nE\nc\nAmerica\nAmerica\n \nAmerica\ni\nW\n \n \nB\nr\n.\n \nd\n.\n.\nS\nr\n.\nC\nf\nf\nE\nn\nS\nC\nN\nI\nA\nA\n■ 1972   ■ 1992   ■ 2012   ■ 2030\nSource: Based on FAOSTAT data. Note: Burning of residues, as measured by kilograms of biomass dry matter from rice paddy, maize, wheat, and \nsugarcane production. *Mainland China. +Overlaps with other categories shown in chart.",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": "",
          "6": "",
          "7": "",
          "8": "",
          "9": "",
          "10": "",
          "11": "",
          "12": "",
          "13": "",
          "14": "",
          "15": "",
          "16": "",
          "17": "",
          "18": "",
          "19": "",
          "20": "",
          "21": "",
          "22": "",
          "23": "",
          "24": "",
          "25": "",
          "26": "",
          "27": "",
          "28": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": "",
          "6": "",
          "7": "",
          "8": "",
          "9": "",
          "10": "",
          "11": "",
          "12": "",
          "13": "",
          "14": "",
          "15": "",
          "16": "",
          "17": "",
          "18": "",
          "19": "",
          "20": "",
          "21": "",
          "22": "",
          "23": "",
          "24": "",
          "25": "",
          "26": "",
          "27": "",
          "28": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": "",
          "6": "",
          "7": "",
          "8": "",
          "9": "",
          "10": "",
          "11": "",
          "12": "",
          "13": "",
          "14": "",
          "15": "",
          "16": "",
          "17": "",
          "18": "",
          "19": "",
          "20": "",
          "21": "",
          "22": "",
          "23": "",
          "24": "",
          "25": "",
          "26": "",
          "27": "",
          "28": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": "",
          "6": "",
          "7": "",
          "8": "",
          "9": "",
          "10": "",
          "11": "",
          "12": "",
          "13": "",
          "14": "",
          "15": "",
          "16": "",
          "17": "",
          "18": "",
          "19": "",
          "20": "",
          "21": "",
          "22": "",
          "23": "",
          "24": "",
          "25": "",
          "26": "",
          "27": "",
          "28": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": "",
          "6": "",
          "7": "",
          "8": "",
          "9": "",
          "10": "",
          "11": "",
          "12": "",
          "13": "",
          "14": "",
          "15": "",
          "16": "",
          "17": "",
          "18": "",
          "19": "",
          "20": "",
          "21": "",
          "22": "",
          "23": "",
          "24": "",
          "25": "",
          "26": "",
          "27": "",
          "28": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": "",
          "6": "",
          "7": "",
          "8": "",
          "9": "",
          "10": "",
          "11": "",
          "12": "",
          "13": "",
          "14": "",
          "15": "",
          "16": "",
          "17": "",
          "18": "",
          "19": "",
          "20": "",
          "21": "",
          "22": "",
          "23": "",
          "24": "",
          "25": "",
          "26": "",
          "27": "",
          "28": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": "",
          "6": "",
          "7": "",
          "8": "",
          "9": "",
          "10": "",
          "11": "",
          "12": "",
          "13": "",
          "14": "",
          "15": "",
          "16": "",
          "17": "",
          "18": "",
          "19": "",
          "20": "",
          "21": "",
          "22": "",
          "23": "",
          "24": "",
          "25": "",
          "26": "",
          "27": "",
          "28": ""
        }
      ],
      "shape": [
        7,
        29
      ]
    },
    {
      "table_id": "Agricultural Pollution Field Burning_table_1",
      "page": 6,
      "accuracy": 78.29700684720025,
      "data": [
        {
          "0": "51\nBox 3. Adoption of Conservation Agriculture\nThe global spread and acceleration of \nerosion, and the failure of prior attempts to \nthat disseminated and continued adapting \nconservation agriculture over the past two \nmanage it through landscaping techniques, \nthe technologies and practices to evermore \ndecades—a largely farmer-led phenomenon \nwere preludes to change. The launch of a \nchallenging conditions (for example, as \nto date—illustrates that alternatives to burning \nnational research program on conservation \nin Brazil’s Cerrado region). The spread of \ncan become viable across a wide range \nagriculture in the 1970s, and dogged, \nconservation agriculture was also a product of \nof farming systems and geographies with \non-farm experimentation by committed \ncontinued public sector support. In the early \nappropriate forms of support. Conservation \nlead-adopters, were critical for overcoming \n2000s, for instance, the Brazilian Agricultural \nagriculture (CA) represents an exit from \nearly technical barriers to adoption in tropical \nResearch Corporation (Embrapa) set up a \nburning as two of its central tenets are to \nand crop-specific conditions. These helped \nparticipatory platform that helped to sensitize \nminimize soil disturbance (that is, by not \nto achieve and demonstrate profitability—\nand train farmers, but also to identify, from the \ntilling), and to maintain soil cover (the third \nfirst to large mechanized farms and later to \nbottom-up, persistent barriers to adoption \nis to diversify crop species). Approximately \nsmaller and less sophisticated ones—and \nranging from financial to technological ones, \n155 million hectares, or around 11 percent \nprovided fodder for the farmer organizations \nin order to address these. \nof global arable cropland, were thought to \nbe under CA in 2013 (data on CA are scarce). \nFigure 9: Evolution of Zero-tillage Conservation Agriculture Management \nThis represented an increase of 24 percent \nSystems in Brazil\nover 2010 penetration levels—and a 55-fold \nMillions of hectares\nincrease (that is, 5,400 percent) in 1974 \nacreage. Growth in conservation agriculture \n35\nhas particularly taken off in the past decade, \n30\ndriven by rising interest of small and large \nfarmers in parts of North and South America \n25\nand Australia, and most recently, large farms \n20\nin Kazakhstan and small farms in India and \nChina (Kassam et al. 2014). \n15\nConservation agriculture has enjoyed high \n0\nrates of penetration in certain geographies. In \nBrazil, for instance, at least half the area under \nannual crops (around 34 million hectares) was \n1975\n1980\n1985\n1990\n1995\n2000\n2005\n2010\nestimated to have converted to zero-tillage \nSource: Based on FEBRAPDPD 2013, in Freitas and Landers 2014. Permission required for reuse.  \nconservation agriculture as of 2012. In this \nNote: Brazilian Federation of Zero Tillage in Crop Residues (FEBRAPDP), created in 1992.\ncase, the reality of massive and severe soil",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": "",
          "6": "",
          "7": "",
          "8": "",
          "9": "",
          "10": "",
          "11": "",
          "12": "",
          "13": "",
          "14": "",
          "15": "",
          "16": "",
          "17": "",
          "18": "",
          "19": "",
          "20": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": "",
          "6": "",
          "7": "",
          "8": "",
          "9": "",
          "10": "",
          "11": "",
          "12": "",
          "13": "",
          "14": "",
          "15": "",
          "16": "",
          "17": "",
          "18": "",
          "19": "",
          "20": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": "",
          "6": "",
          "7": "",
          "8": "",
          "9": "",
          "10": "",
          "11": "",
          "12": "",
          "13": "",
          "14": "",
          "15": "",
          "16": "",
          "17": "",
          "18": "",
          "19": "",
          "20": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": "",
          "6": "",
          "7": "",
          "8": "",
          "9": "",
          "10": "",
          "11": "",
          "12": "",
          "13": "",
          "14": "",
          "15": "",
          "16": "",
          "17": "",
          "18": "",
          "19": "",
          "20": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": "",
          "6": "",
          "7": "",
          "8": "",
          "9": "",
          "10": "",
          "11": "",
          "12": "",
          "13": "",
          "14": "",
          "15": "",
          "16": "",
          "17": "",
          "18": "",
          "19": "",
          "20": ""
        }
      ],
      "shape": [
        5,
        21
      ]
    }
  ]
}