{
  "filename": "Exchangeable potassium reserve in a Brazilian savanna Oxisol after nine years under different cotton production systems.pdf",
  "processing_timestamp": "2025-07-06T18:28:07.551603",
  "text_extraction": {
    "success": true,
    "character_count": 38274,
    "output_file": "2_processed_data/text_extracts/Exchangeable potassium reserve in a Brazilian savanna Oxisol after nine years under different cotton production systems.md"
  },
  "table_extraction": {
    "success": true,
    "table_count": 4,
    "output_file": "2_processed_data/table_data/Exchangeable potassium reserve in a Brazilian savanna Oxisol after nine years under different cotton production systems_tables.json",
    "tables_summary": [
      {
        "id": "Exchangeable potassium reserve in a Brazilian savanna Oxisol after nine years under different cotton production systems_table_0",
        "shape": [
          14,
          1
        ],
        "accuracy": 0
      },
      {
        "id": "Exchangeable potassium reserve in a Brazilian savanna Oxisol after nine years under different cotton production systems_table_1",
        "shape": [
          32,
          1
        ],
        "accuracy": 0
      },
      {
        "id": "Exchangeable potassium reserve in a Brazilian savanna Oxisol after nine years under different cotton production systems_table_2",
        "shape": [
          3,
          18
        ],
        "accuracy": 0
      },
      {
        "id": "Exchangeable potassium reserve in a Brazilian savanna Oxisol after nine years under different cotton production systems_table_3",
        "shape": [
          2,
          14
        ],
        "accuracy": 0
      }
    ]
  },
  "quality_metrics": {
    "text_success": true,
    "table_success": true,
    "character_count": 38274,
    "table_count": 4,
    "error_count": 0,
    "processing_completeness": 1.0
  },
  "errors": [],
  "full_text": "DOI: http://doi.org/10.1590/1678-992X-2020-0339\n\n\nISSN 1678-992X\n\n\n**​**\n\n\n\n**​**\n\n\n\n**Research Article**\n\n\n**​**\n\n\n\n**Exchangeable potassium reserve in a Brazilian savanna Oxisol after nine years under**\n\n\n**different cotton production systems**\n\n\nAlexandre Cunha de Barcellos Ferreira [1] -, Ana Luiza Dias Coelho Borin [1], Fernando Mendes Lamas [2], Gilvan Barbosa Ferreira [1],\nÁlvaro Vilela de Resende [3]\n\n\n**​**\n\n\n\n1 Embrapa Algodão, R. Oswaldo Cruz, 1143 – 58428-095 –\n\n\nCampina Grande, PB – Brasil.\n\n\n2 Embrapa Agropecuária Oeste, Rod. BR163, km 253,6, C.P.\n\n\n449 – 79804-970 – Dourados, MS – Brasil.\n\n\n3 Embrapa Milho e Sorgo, Rod. MG424, km 45, C.P. 285 –\n\n\n35701-970 – Sete Lagoas, MG – Brasil.\n\n\n*Corresponding author <alexandre-cunha.ferreira@embrapa.br>\n\n\nEdited by: Tiago Osório Ferreira\n\n\nReceived October 28, 2020\n\n\nAccepted April 13, 2021\n\n\n**Introduction**\n\n\n**​**\n\n\n\n**ABSTRACT** : Adequate potassium (K) fertilization is essential for agricultural production in\n\n\nsoils of the Brazilian Savanna (Cerrado biome) due to the high demand by crops (especially\n\n\ncotton), likelihood of leaching losses, and the dependence on fertilizer importations. Therefore,\n\n\nsustainability requires improvements in the soil efficiency management. This study evaluated\n\n\nthe influence of soil management and crop succession or rotation combinations with cotton\n\n\non K dynamics and exchangeable reserves in the soil profile, and the partial balance of K after\n\n\nnine years of cultivation in a clayey Oxisol in the Cerrado. The soil was sampled in layers up\n\n\nto 100 cm depth in four cotton production systems treatments: 1) conventional soil tillage\n\n\n(CST) with cotton monoculture; 2) CST with annual cotton-soybean-cotton succession; 3) CST\n\n\nwith cotton/soybean/maize rotation; and 4) no-tillage system (NTS) with cotton/soybean/\n\n\nmaize rotation and _Urochloa ruziziensis_ (ruzigrass) as a cover crop in the off-season after grain\n\n\ncrops. The experiment was conducted using a randomized block design with four replications.\n\n\nCST with cotton monoculture favored the leaching of K surplus from fertilization. Crop rotation\n\n\nincluding ruzigrass in the NTS allowed better control of K dynamics, ensuring its circulation in\n\n\nthe soil-plant compartments and reducing leaching. The increased organic matter (OM) in this\n\n\nsystem enlarges the storage capacity of K in the topsoil. The adoption of no-tillage crop systems\n\n\nintegrating ruzigrass is viable to improve the efficiency of K fertilizers in cotton cultivation in\n\n\nhighly weathered tropical soils.\n\n\n**Keywords** : _Urochloa ruziziensis_, no-tillage, long-term experiment, potassium fertilization,\n\n\ntropical savanna\n\n\n**​**\n\n\n\nBrazil is one of the world’s major cotton producers with\na cultivated area of 1.66 million ha in the 2019-2020 **​**\n\nseason and 98 % of the production from the Cerrado\nbiome (CONAB, 2020), a Brazilian tropical savanna\nthat encompasses around 205 million ha. Oxisols (Soil\nSurvey Staff, 2014), predominant soil group in the\nCerrado, have good drainage, but are naturally acidic,\npresenting high Al saturation and poor natural fertility\nwith low OM content and CEC. The use of liming\nand fertilizer amendments in the last decades led\n\nsoils to become one of the most relevant agricultural\nenvironments for food production worldwide (Lopes\nand Guilherme, 2016).\nTo achieve high yield and fiber quality, cotton\ncropping in Cerrado uses large amounts of fertilizers,\nwhich increase the production cost. Cotton demands\nhigh amounts of K, since it is vital for fiber formation\nand quality (Yang et al., 2016). The production of 1 ton\nof seed cotton requires an extraction equivalent to 58\nkg ha [–1] of K 2 O from the soil, but only 30 % of that is\nexported by the harvested cottonseeds and fibers (Borin\net al., 2019).\nIn tropical soils, K supply to plants occurs\nmainly by the exchangeable form, but also by the\nnon-exchangeable form and K is also released by crop\nresidues (Rosolem et al., 2019). Depending on fertilizer\n\n\n\nmanagement, crop combination, and soil characteristics,\nK surplus from fertilization remain more susceptible to\nrunoff or leaching losses. Since these soils have a limited\n\n**​** K adsorption capacity, no-tillage system (NTS) and the\n\ninsertion of forage grasses into crop rotation can be a\nstrategy to conserve soil K fertility, because Poaceae\nplants are very efficient in cycling K (Garcia et al., 2008;\nResende et al., 2019; Rosolem et al., 2019).\nConsumption of K fertilizers in Brazil reached\n6.77 million tons of K 2 O in 2018, while worldwide use\ncorresponded to 38.85 million tons of K 2 O (FAO, 2020).\nNational mineral reserves are limited and currently\nabout 95 % of the K fertilizer is imported (Boldrin et\nal., 2019), which justifies efforts in developing technical\napproaches to increase the K use efficiency in the\nBrazilian agriculture.\nThis study evaluated the influence of soil\nmanagement and crop combinations with cotton on\nK dynamics, exchangeable reserves in the soil and\npartial balance after nine years in a clayey Oxisol in the\nBrazilian Cerrado.\n\n\n**Materials and Methods**\n\n\n**Study site**\n\n\nA long-term experiment under rainfed conditions was\nconducted between Aug 2005 and Oct 2014 in the\n\n\n|Col1|Col2|Col3|\n|---|---|---|\n|**Sci. Agric. v.79, n.4, e20200339, 2022**|**Sci. Agric. v.79, n.4, e20200339, 2022**|**Sci. Agric. v.79, n.4, e20200339, 2022**|\n|**Sci. Agric. v.79, n.4, e20200339, 2022**|**Sci. Agric. v.79, n.4, e20200339, 2022**||\n\n**Ferreira et al.** **Potassium reserve in Oxisol**\n\n\n\nmunicipality of Santa Helena de Goiás, Goiás, Brazil\n(17°50’37” S, 50°35’52” W, and altitude 557 m). The soil\nis classified as clayey dystrophic Red Latosol (Santos et\nal., 2013), Typic Haplorthox (Oxisol) (Soil Survey Staff,\n2014). The climate is Aw, according to the Köppen-Geiger\nclimate classification system (Alvares et al., 2013), with\nan average rainfall of 1,800 mm, concentrated from Oct\nto Mar.\n\nIn the three years prior to the experiment, the area\nwas cultivated with cotton, and before that, soybean\nmonoculture, with the soil prepared annually by plowing\nand harrowing. In Aug 2005, the soil was sampled at\n0-20 cm depth and underwent the chemical and particle\nsize analyses (Table 1). In early Sept 2005, the entire\nexperimental area received 2,200 kg ha [–1] of calcitic\nlimestone with 90 % calcium carbonate equivalent and\nwas subsoiled at 35 cm depth, subsequently plowed and\nharrowed.\n\n\n**Experimental design and treatments**\n\n\nThe experiment was conducted for nine years and\nconsisted of four production systems involving cotton\ncultivation: 1) conventional soil tillage (CST) with\ncotton monoculture CSTCM; 2) CST with annual cottonsoybean-cotton succession (CSTCSC); 3) CST with cotton/\nsoybean/maize rotation (CSTCSM); and 4) cotton under\na no-tillage system - NTS [soybean (spring-summer)\n+ _Urochloa ruziziensis_ (ruzigrass) (autumn-winter)/\nmaize intercropped with ruzigrass (spring-summer)/\ncotton (spring-summer-autumn)]. CST treatments were\nfallow in autumn-winter (Table 2). The experiment was\nconducted using a randomized block design with four\n\n\n\nreplications. The experimental plot for each cropping\nsystem covered an area of 576 m [2] (14.4 × 40 m). Native\nvegetation (native Cerrado) without management\ninterventions in a site adjacent to the experiment was\nused as a reference for exchangeable K and OM content\nin the soil profile.\n\n\n**Tillage systems, crop management, and harvest**\n\n\nTreatments with CST were prepared annually between\nlate Sept and early Oct, after the beginning of the rainy\nseason. The preparation consisted of a disc harrowing\nto turn the soil over up to 20 cm deep, followed by a\nleveling disc harrowing. Another leveling disc harrowing\noperation was performed two days before soybean,\nmaize, or cotton sowing.\nIn Aug 2009, 2,000 kg ha [—1] of dolomitic limestone\nwith 85 % calcium carbonate equivalent was applied.\nIn Oct 2009, before sowing the crops, 1,000 kg ha [–1] of\nphosphogypsum (PG) was added. In CST treatments,\nthese additives were incorporated up to 20 cm with\nplowing and harrowing and were broadcasted on the\nsoil surface without incorporation in the NTS treatment.\nDuring the nine years of the experiment, soybean\nwas sown in the spring, in the second half of Oct,\nafter the beginning of the rainy season. Soybean row\nspacing was 45 cm. Maize was sown between late\nOct and early Nov also at 45-cm row spacing. Cotton\nwas sown from late Nov to mid-Dec, with 80 cm row\nspacing. Plant populations per ha ranged from 350,000\nto 400,000, 55,000 to 65,000, and 80,000 to 100,000, for\nsoybean, maize, and cotton, respectively, depending on\nthe cultivar used each year. Cultivar, plant population,\n\n\n\n**Table 1** – Results of the soil analysis at 0-20 cm depth before initiating the experiment.\n\n\npH CaCl 2 P [1] K [2] Ca [3] Mg [4] H+Al [5] SB [6] CEC [7] V [8] SOM [9] Clay Silt Sand\n\n\nmg dm [–3] ----------------------------------------------------- cmolc dm [–3 ] ----------------------------------------------------- % g kg [–1] ------------------------ g kg [–1 ] -----------------------\n\n5.35 6.1 0.23 2.07 0.42 3.61 2.72 6.33 59 24.2 495 217 288\n\n\n1 Available phosphorus; 2 exchangeable potassium, extracted by Mehlich-1; 3 calcium; 4 magnesium, extracted by KCl 1 mol L –1 ; 5 potential acidity, extracted by calcium\nacetate, 0.5 mol L [–1], pH 7.0; [6] sum of exchangeable bases = Ca + Mg + K; [7] cation exchange capacity = H + Al + SB; [8] soil base saturation percentage = SB/CEC ×\n100, [9] soil organic matter by Walkley-Black method. Methodologies described in Teixeira et al. (2017).\n\n\n**Table 2** – Description of treatments of soil management, succession, and crop rotation systems over nine agricultural years.\n\n\nTreatments\n\n\n\nAgricultural year\n\n\n\nConventional soil tillage No-tillage system\n\n\nCSTCM CSTCSC CSTCSM NTS\n\n\nMonoculture Annual succession Rotation Rotation and _U. ruziziensis_ (ruzigrass)\n\n\n\n\n\n**Sci. Agric. v.79, n.4, e20200339, 2022**\n\n\n\n**2**\n\n\n**Ferreira et al.** **Potassium reserve in Oxisol**\n\n\n\nfertilization, and chemical control of pests, diseases, and\nweeds were standardized for each crop and within each\nagricultural year.\nThe mean annual fertilizations, in kg ha [–1] of N,\nP 2 O 5, and K 2 O, were 111, 126, and 130 for cotton; 6,\n54, and 46 for soybean; and 97, 119, and 137 for maize,\nrespectively, adjusted based on the recommendations\nfor these crops (Sousa and Lobato, 2004). All soybean\nfertilization was applied in the sowing furrow. Maize\nand cotton received all phosphate fertilizer and\napproximately 20 % of N and 50 % of K 2 O in the sowing\nfurrow. The remaining N and K 2 O amounts were divided\ninto two topdressing applications. The total amounts\nof fertilizers, in kg ha [–1] of N, P 2 O 5, and K 2 O, were 999,\n1,134, and 1,170 in CSTCM treatment; 579, 846 and 834\nin CSTCSC and 642, 897 and 939 in CSTCSM and NTS.\nIn the NTS treatment, after soybean harvest,\nruzigrass was mechanically sown using 6 kg ha [–1] of\nseeds with 100 % culture value. This operation occurred\ntwo days after desiccation of volunteer soybean plants\nand weeds in the plots using the paraquat herbicide\n(400 g ha [–1] of active ingredient). Maize in the NTS was\nintercropped with ruzigrass using 7 kg ha [–1] of seeds\nwith 85 % culture value mixed with the starter fertilizer\n\ndistributed in the sowing furrows. Ruzigrass remained in\nthe plots as a cover plant throughout the off-season after\nsoybean or maize and was desiccated with glyphosate\n(1,400 g ha [–1 ] of active ingredient) 30 days before sowing\nthe next maize or cotton crop.\nCotton, maize, and soybean crops were manually\nharvested in each experimental plot, at three random\npoints, each including four rows 5-m long. Yield was\nobtained by adding the data collected at the three points\nand the results were converted into kg ha [–1 ] and grain\nmoisture corrected to 13 %.\n\nThe accumulated export of K in each production\nsystem was determined by multiplying crop yields by\nthe mean removal rates, equivalent to 17, 20, and 3.7\nkg of K 2 O per ton of seed cotton, soybean, and maize\ngrains, respectively (Borin et al., 2019; Duarte et al.,\n2019; Embrapa, 2013). From exported quantities, partial\nbalances of K (Resende et al., 2019) were estimated, as\nwell as the exported/applied ratios of the K fertilizer\nused in the period.\n\n\n**Soil sampling and analysis**\n\n\nIn Oct 2014, soil samples were collected from the\nexperimental plots and in the native Cerrado of an\nadjacent area, at the 0-5, 6-10, 11-20, 21-30, 31-60, and 61100 cm layers of the profile, to analyze the exchangeable\nK and soil organic matter (SOM) contents. At each depth,\n10 soil samples were collected and homogenized to form\na composite sample for the laboratory analysis. The\nexchangeable K was extracted with Mehlich-1 solution\nand quantified in a flame photometer, while SOM was\ndetermined by the Walkley-Black method (Teixeira et\nal., 2017).\n\n\n**Sci. Agric. v.79, n.4, e20200339, 2022**\n\n\n\n**Statistical analysis**\n\n\nThe data at each sampling layer were submitted to the\nanalysis of variance using SISVAR software (Statistical\nAnalysis System, version 5.6) with means compared by\nthe Tukey test. A _p_ ≤ 0.05 was used to indicate statistical\nsignificance.\n\n\n**Results and Discussion**\n\n\n**Exchangeable potassium and organic matter**\n**contents in the soil**\n\n\nAlthough the exchangeable K contents were not\nstatistically compared between the sampling depths,\nthe highest absolute values were detected in the upper\nlayers of the soil profile, mainly at 0-5 cm, decreasing\nprogressively with depth, irrespective of the treatment\n(Figure 1). Ferreira et al. (2009) also observed this\ntendency in a Rhodic Hapludox (Oxisol). The authors\nstated that reducing K levels in the profile are associated\nwith a gradual lowering in organic carbon (OC) contents\nand soil organic matter (SOM) to retain cations in deeper\nlayers.\nThe SOM levels determined in the samples up\nto 100 cm in the profile (Figure 2) follow the same\ntendency as exchangeable K (Figure 1), indicating a\nstrong relationship between these two variables. This\nbehavior is expected for highly weathered soils, with\nlow-activity clays, like the studied Oxisol, in which SOM\naccounts for most CEC (Lopes and Guilherme, 2016)\nand, therefore, for the retention of K in the soil profile.\nThe highest K content (1.18 cmol c dm [–3] ) in NTS\nwas found in the 0-5 cm layer (Figure 1) and was 79 %\nhigher than the mean value of the three CST treatments,\nconsistent with the higher SOM content in this layer\nfor NTS (Figure 2). Considering that the SOM and CEC\nare positively correlated in the Cerrado Oxisols (Lopes\nand Guilherme, 2016; Ramos et al., 2018), it seems\nthat the increased CEC enhances the K retention and\n\naccumulation. The absence of soil tillage for nine years,\nstraw production and abundant root development of _U._\n_ruziziensis_ (ruzigrass) used as a cover plant (Sanches et\nal., 2020), along with cotton, maize, and soybean crop\nresidues in the NTS treatment, certainly had a positive\ninfluence on SOM accumulation and, consequently,\non K levels in the 0-5 cm layer. The average annual of\nstraw available in NTS for soybean sowing was 3,945\nkg ha [–1], from cotton crop residues; for corn sowing,\n9,137 kg ha [–1] of the ruzigrass straw; and for cotton\nsowing, 11,388 kg ha [–1] of the maize crop residues and\nruzigrass straw.\nThe production system and history of K\nfertilization influenced the K dynamics in soil profile.\nIn the upmost surface layer, the exchangeable K content\nwas 66 % higher in NTS compared to CSTCM. However,\nin the deeper sampling layer, the situation was reversed\nwith CSTCM presenting more than twice the K content\n\n\n**3**\n\n\n**Ferreira et al.** **Potassium reserve in Oxisol**\n\n\n**Figure 1** – Exchangeable K content in clayey Oxisol up to 100 cm depth after nine harvests in different cotton production systems. Within each\ndepth, means that are followed by the same letter do not differ significantly (Tukey test; _p_ ≤ 0.05). ns = not significant ( _p_  - 0.05) by F test.\nNative Cerrado as reference of the natural condition.\n\n\n\n(Figure 1). The comparison between the CSTCSM and\nNTS treatments, which received the same commercial\ncrops and fertilizer amounts, shows that in the latter,\nthe K content in the 0-5, 6-10, and 11-20 cm layers,\nwas 93 %, 115 %, and 117 % higher, respectively. At\ndepths 21-30, 31-60, and 61-100, the K levels were\nstatistically similar between the CSTCSC, CSTCSM, and\nNTS treatments. These results reflect the role of SOM\n\nin increasing the net negative charge of the soil that can\nretain more cations in the top layers of the NTS (Ramos\net al., 2018), as well as the active recovery of K by the\nruzigrass root system from the deep layers to topsoil\n(Tanaka et al., 2019).\nThe weighted average of the sample layers up to\n20 cm shows that the exchangeable K corresponded to\n0.53 cmol c dm [–3] in the NTS, equivalent to 829 kg ha [–1]\nof potassium chloride fertilizer (KCl), and to 0.26 cmol c\ndm [–3] in CSTCSM (407 kg ha [–1] of KCl). The conservationist\nmanagement system with crop rotation under no-tillage\nand the inclusion of ruzigrass as a cover plant in the\noff-season retained more than twice the K available for\n\n\n**Sci. Agric. v.79, n.4, e20200339, 2022**\n\n\n\nabsorption in the soil layer with greater root activity of\nthe commercial crops, equivalent to about 422 kg ha [–1]\nof additional KCl. This contrasting dynamics reinforces\nthe importance of the no-till farming to prevent nutrient\nlosses to runoff (Almeida et al., 2021), besides the strong\ninfluence of covering the soil by living plants as much\nas possible throughout the year to keep K recycling and\nits accessibility to plants in the crop system (Resende et\nal., 2019). The joint effect of no-till and ruzigrass activity\ncomposes an effective way to improve the use efficiency\nof K fertilizer in tropical soils.\nAlthough not statistically compared, the reference\nsoil from the native Cerrado area that had never been\n\nfertilized presented exchangeable K levels similar to\nthose found in some production systems with annual\ncrops at different depths (Figure 1). This shows that\nthe clayey soil with a relatively high SOM content\nin that area (Figure 2) has a natural K reserve that is\npossibly kept due to the action of native vegetation roots\ndistributed at great depths, promoting efficient recycling\nover time.\n\n\n**4**\n\n\n**Ferreira et al.** **Potassium reserve in Oxisol**\n\n\n**Figure 2** – Organic matter content in clayey Oxisol up to 100 cm depth after nine harvests in different cotton production systems. Within each\ndepth, means followed by the same letter do not differ significantly (Tukey test; _p_ ≤ 0.05). ns = not significant ( _p_  - 0.05) by F test. Native\nCerrado as reference of the natural condition.\n\n\n\n**Partial potassium balance and exchangeable**\n**potassium pool in the soil profile**\n\n\nThe highest exchangeable K levels in the deeper sampling\nlayer were observed in the CSTCM treatment (Figure 1).\nThis treatment received the greatest cumulative dose of\nthe nutrient over the nine years of the experiment (Figure\n3A), which, associated with recurrent monocrop, plowing\nand harrowing, must have led to K mobilization to the\ndeeper layers of the soil profile. Below 60 cm, the volume\nand specific surface area of cotton roots are much smaller\n(Carmi et al., 1993), restricting their capacity to absorb\nnutrients. This low absorption possibly increases K loss\nfrom the system due to leaching out of the root exploration\n\nzone.\nThe equivalent amounts of K 2 O stored up to 100\ncm deep were estimated for the treatments, assuming\na soil bulk density equal to 1.0 kg dm [–3] over the entire\nsampling profile. The native Cerrado soil condition had\n± 591 kg ha [–1] of K 2 O equivalent in exchangeable form,\nwhich reflects a stabilized state mainly because of\nbiological recycling. Therefore, the anthropic use of soils\nwith cultivation for many years before the experiment\n\n\n**Sci. Agric. v.79, n.4, e20200339, 2022**\n\n\n\nmust have changed this equilibrium. Nevertheless, the\npool of exchangeable K that built up after nine years of\nfertilization in different production systems (Figure 3A)\nindicates that the cultivated Oxisol can retain, at least\ntemporarily, a higher amount of K in the profile than the\nexisting amount in the original environment.\nSoil acidity control practices, such as liming and PG\namending, may promote an increase in CEC in soils with\npredominance of variable charges, as observed by Fageria\net al. (2014), enhancing the potential for K retention\nby negative colloidal charges. However, the effects of\ndifferent management systems on the dynamics and\nstorage of the K provided in fertilizations were evident\n(Figures 3A and 3B).\nThe CSTCM and NTS treatments had the highest\ncontent of exchangeable K in the soil after nine years\n(Figure 3A); however, its distribution in the profile\n(Figure 3B) indicates a different behavior between these\ntreatments. In CSTCM, almost half of the K detected was\nin the layer below 30 cm depth, indicating likelihood for\nleaching. In the NTS, a proportion of almost 70 % remained\nin the topsoil layer (up to 30 cm), showing that this system\nconditioned a more conservative environment for the K\n\n\n**5**\n\n\n**Ferreira et al.** **Potassium reserve in Oxisol**\n\n\n\nsupplied in fertilization. Furthermore, its retention in a\nposition in the profile with greater presence and activity of\ncommercial crops roots can improve the K use efficiency.\nAn important differential in the NTS was the\ninclusion of ruzigrass intercropped with maize and as\nsubsequent crop to soybean, acting as a cover plant and\nimproving K cycling in the system. According to Ferreira\net al. (2018), the use of Poaceae species as cover crops\n(including ruzigrass) after the soybean harvest increases\nbiomass production, providing soil protection and\nstraw for subsequent cotton cultivation under no-till in\nthe Cerrado region. Oliveira et al. (2019) reported that\nmaize intercropped with _Urochloa brizantha_ produces a\nhigh amount of plant residues, in addition to nutrient\ncycling, including K. The same authors reported that\nplant biomass of _U. brizantha_ or ruzigrass accumulated K\nsimilarly to or more than maize.\nWhen compared to annual crops in general,\n_Urochloa_ species develop a root system that penetrates\ndeeper into the soil, with a large volume of roots, enabling\nhigh K absorption (Rosolem et al., 2019), including the\nnon-exchangeable forms (Volf et al., 2018). According to\nRömheld and Kirkby (2010), K is transported mainly by\ndiffusion from the soil to the root surface and the presence\nof hairs is crucial in absorption, as it increases the surface\narea of the root cylinder and the concentration gradient\nthat triggers the K influx.\n\n\n\nAfter successive harvests along nine cropping\nseasons in different production systems, the total K\nexport expressed as K 2 O equivalent was estimated\nat 553, 587, 454, and 487 kg ha [–1] for total adding of\n1,170, 834, 939, and 939 kg ha [–1] of K 2 O via fertilization\nin the treatments CSTCM, CSTCSC, CSTCSM, and\nNTS, respectively. The partial balance between K\ninput and output in the systems indicated surpluses\nand the exported/applied nutrient ratio corresponded\nto relatively low offtake rates, ranging from 47 to\n70 % (Table 3). Thus, K additions by fertilization\nsurpassed the harvest removal in all production\nsystems, especially CSTCM, in which the combined\neffects of CST, absence of crop rotation, and higher K\nfertilization resulted in proportionally greater leaching\nto subsurface layers (Figures 1 and 3B), despite the fine\ntexture in the soil with 495 g kg [–1] of clay. The fate of the\nfertilizer K can follow different paths, besides the crop\nuptake, including adsorption in exchangeable positions\non colloids, conversion to non-exchangeable forms,\nand losses by runoff and leaching (Rosolem et al.,\n2019). As the Oxisol is typically well drained and the\nexperiment was installed in a field almost flat, greater\nimportance of leaching can be expected in the potential\nK losses. According to Moterle et al. (2019), when K\nfertilization generates a positive balance that exceeds\nthe soil buffering capacity, the presence of higher\n\n\n\n**Figure 3** – Equivalent amounts of K 2 O cumulatively supplied by fertilization and stored up to 100 cm depth in the soil profile (A) and proportions of\nexchangeable K retained in the upper and deeper layers (B) of clayey Oxisol, after nine harvests in different cotton production systems. *Stock\nin the soil under native Cerrado vegetation.\n\n\n**Table 3** – Cumulative crop production (PROD), K 2 O equivalent export (EXP) and partial balance, and offtake rate from K fertilization, after nine\nharvests in different cotton production systems.\n\n\nSeed cotton Soybean Maize\nSystems PROD EXP PROD EXP PROD EXP Total K 2 O EXP K 2 O partial balance [1] Offtake rate [2]\n\n\n----------------------------------------------------------------------------------------------------------------------- kg ha [–1 ] ----------------------------------------------------------------------------------------------------------------------- %\n\n\nCSTCM [3] 32,536 553 - - - - 553 617 47\n\n\nCSTCSC [4] 19,251 327 12,980 260 - - 587 247 70\n\n\nCSTCSM [5] 9,850 167 9,711 194 25,220 93 454 485 48\n\n\nNTS [6] 11,635 198 9,898 198 24,527 91 487 452 52\n\n\n1 Difference between the equivalent amounts of K 2 O applied in fertilization and exported in harvests; 2 Ratio between K export and fertilization; 3 Conventional soil\ntillage (CST) with cotton monoculture; [4] CST with annual cotton-soybean-cotton succession; [5] CST with cotton/soybean/maize rotation; [6] no-tillage system with cotton/\nsoybean/maize rotation and ruzigrass as a cover crop.\n\n\n\n**Sci. Agric. v.79, n.4, e20200339, 2022**\n\n\n\n**6**\n\n\n**Ferreira et al.** **Potassium reserve in Oxisol**\n\n\n\nexchangeable K levels increases leaching. Thus, once\na sufficiency level for a given soil type is established,\nfertilizer recommendations closer to the crop needs\nare desirable, in amounts equivalent to K export in\nthe harvested products, which minimizes translocation\ndown the profile and eventual K losses outside the root\nzone (Kaminski et al., 2010).\nBefore the experiment beginning, the exchangeable\nK content was 0.23 cmol c dm [–3] in the 0-20 cm layer,\nequivalent to 216 kg ha [–1] of K 2 O when assuming a soil\nbulk density of 1.0 kg dm [–3] . After nine years under\nthe NTS treatment, subtracting this initial reserve, the\nestimated stock for the same layer corresponded to\n63 % of the surplus of 452 kg ha [–1] of K 2 O calculated\nin the balance (Table 3). Among the CST treatments,\ncalculations revealed that the maximum percentage\nretained up to 20 cm was 34 % of the surplus from\nfertilization. Therefore, in addition to making the soil\nprone to lose K through erosive processes, the frequent\ntillage limits SOM accumulation, favoring a disruption\nin the K storage capacity in the topsoil. There is a weak\nK retention strength in highly weathered soils, such the\nCerrado Oxisols, as result of the low frequency of 2:1\nclay minerals to generate negative charges and adsorb\ncations, besides the competition with Ca and Mg derived\nfrom liming on adsorption to colloids (Moterle et al.,\n2019; Rosolem et al., 2019). These conditions make the\nK surplus from fertilization more susceptible to leaching.\nThe mean cotton yields were 3,615, 3,855, 3,285,\nand 3,885 kg ha [–1] in CSTCM, CSTCSC, CSTCSM, and\nNTS treatments, respectively. Therefore, the NTS\nused in the present study is recommended. The NTS\nsustainability is supported by more efficient retention\nand storage of surplus K supplied in fertilization, keeping\nit cycling and more concentrated in the profile surface\nwithin the reach of crop roots, providing higher cotton\nyield potential.\nIn the NTS treatment, the combination of\ncotton, soybean, and maize rotation and ruzigrass as\na cover plant, each with different characteristics of\nroot and shoot development, productive potential,\nand life cycles, provided better soil use and K uptake\nfrom fertilization. The inclusion of ruzigrass in this\nno-tillage system promoted deep K recovery in the\nprofile and its maintenance in circulation in the soilplant compartments, by increasing SOM (Santos et al.,\n2014), with consequent improvement in soil K buffering\ncapacity. Thus, this grass sustained K availability in the\nupper layer, where it was retained due to the CEC from\nhigher SOM, reducing losses by leaching.\nAfter absorption, K is stored in the cytoplasm\nand vacuole and does not integrate any structural\ncomponent of the plant cell. With the death of plant\ntissue and presence of enough moisture, the K contained\nin plant residues is quickly released into the soil solution\n(Lupwayi et al., 2006; Rosolem et al., 2019), contributing\nto nutrition of the subsequent crop. These aspects\nreinforce the premise that systems with the presence\n\n\n**Sci. Agric. v.79, n.4, e20200339, 2022**\n\n\n\nof live plants for a longer time throughout the year are\nmore efficient in keeping K availability and minimizing\nlosses.\n\nIn all production systems, K export was lower\nthan the amount supplied by fertilization, generating\na surplus in the nutrient balance (Table 3), which\nincreased soil K availability in the 0-20 cm layer to\nvalues above the critical level of 0.13 cmol c dm [–3] (Sousa\nand Lobato, 2004). In these situations, especially in\nmodalities similar to the NTS used in this study, there is\nan opportunity to adjust fertilization in cotton cropping\nsystems to reduce production costs and increase the use\nefficiency of K fertilizer.\n\n\n**Conclusions**\n\n\nConventional tillage in clayey Oxisol with cotton\nmonoculture favors the leaching of K surplus from\nfertilization. Conversely, no-tillage system with cotton /\nsoybean / maize rotation and the inclusion of ruzigrass\nas a cover plant allows better control of the K dynamics,\nkeeping it in circulation in the root zone and reducing\nlosses by leaching. Increased OM in this system enlarges\nthe K storage capacity in the topsoil. The adoption of\nno-tillage crop systems integrating grass species, such as\n_Urochloa_ _ruziziensis_, is a viable way to improve the use\nefficiency of K fertilizers for cotton cultivation in highly\nweathered tropical soils.\n\n\n**Acknowledgments**\n\n\nThe authors thank the Goiás Foundation (Fundação\nGoiás) for the operational support and for providing\nthe experimental area for conducting the experiment\nand thank Brazilian Agricultural Research Corporation\n(Embrapa) and the Goiás Cotton Crop Incentive Fund\n(Fialgo) for partially funding the studies.\n\n\n**Authors’ Contributions**\n\n\n**Conceptualization** : Ferreira, A.C.B.; Borin, A.L.D.C.;\nLamas, F.M. **Data acquisition** : Ferreira, A.C.B.; Borin,\nA.L.D.C. **Data analysis** : Ferreira, A.C.B.; Borin,\nA.L.D.C.; Ferreira, G.B.; Resende, A.V. **Design of**\n**methodology** : Ferreira, A.C.B.; Borin, A.L.D.C.; Lamas,\nF.M.; Resende, A.V. **Writing and editing** : Ferreira,\nA.C.B.; Borin, A.L.D.C.; Resende, A.V.\n\n\n**References**\n\n\nAlmeida, T.F.; Carvalho, J.K.; Reid, E.; Martins, A.P.; Bissani, C.A.;\nBortoluzzi, E.C.; Brunetto, G.; Anghinoni, I.; Carvalho, P.C.F.;\nTiecher, T. 2021. Forms and balance of soil potassium from\na long-term integrated crop-livestock system in a subtropical\nOxisol. Soil and Tillage Research 207: e104864.\nAlvares, C.A.; Stape, J.L.; Sentelhas, P.C.; Gonçalves, J.L.M.;\nSparovek, G. 2013. Köppen’s climate classification map for\nBrazil. Meteorologische Zeitschrift 22: 711-728.\n\n\n**7**\n\n\n**Ferreira et al.** **Potassium reserve in Oxisol**\n\n\n\nBoldrin, P.F.; Souto, H.F.; Salles, L.S.; Furtini Neto, A.E. 2019.\n\nAlternative sources of potassium for maize cultivation. Ciência e\nAgrotecnologia 43: e023619.\n\nBorin, A.L.D.C.; Ferreira, G.B.; Carvalho, M.C.S.; Ferreira, A.C.B.\n\n2019. Cotton nutrition and fertilization in the Cerrado region =\nNutrição e adubação do algodão na região do Cerrado. p. 283-323.\n\nIn: Flores, R.A.; Cunha, P.P.; Marchão, R.L.; Moraes, M.F., eds.\n\nNutrition and fertilization: of large crops in the cerrado region =\nNutrição e adubação: de grandes culturas na região do cerrado.\nGráfica UFG, Goiânia, GO, Brazil (in Portuguese).\nCarmi, A.; Plaut, Z.; Sinai, M. 1993. Cotton root growth as affected\nby changes in soil water distribution and their impact on plant\ntolerance to drought. Irrigation Science 13: 177-182.\nCompanhia Nacional de Abastecimento [CONAB]. 2020. Agricultural\ninformation - crops. Cotton: Historical series **=** Informações\nagropecuárias - safras. algodão: série histórica. CONAB, Brasília,\nDF, Brazil. Available at: https://www.conab.gov.br/info-agro/safras/\nserie-historica-das-safras [Accessed May 26, 2020] (in Portuguese)\nDuarte, A.P.; Abreu, M.F.; Francisco, E.A.B.; Gitti, D.C.; Barth,\n\nG.; Kappes, C. 2019. Reference values of grain nutrient content\n\nand removal for corn. Revista Brasileira de Ciência do Solo 43:\n\ne0180102.\n\nEmpresa Brasileira de Pesquisa Agropecuária [EMBRAPA]. 2013.\nSoybean production technologies - Central Brazil 2014 =\nTecnologias de produção de soja: Região Central do Brasil 2014.\nEmbrapa Soja, Londrina, PR, Brasil (in Portuguese).\n\nFageria, N.K.; Moreira, A.; Moraes, L.A.C.; Moraes, M.F. 2014.\nInfluence of lime and gypsum on yield and yield components of\nsoybean and changes in soil chemical properties. Communications\nin Soil Science and Plant Analysis 45: 271-283.\n\nFerreira, A.C.B.; Borin, A.L.D.C.; Bogiani, J.C.; Lamas, F.M. 2018.\nSuppressive effects on weeds and dry matter yields of cover\ncrops. Pesquisa Agropecuária Brasileira 53: 566-574.\nFerreira, E.V.O.; Anghinoni, I.; Carvalho, P.C.F.; Costa, S.E.V.G.A.;\nCao, E.G. 2009. Soil potassium content in an integrated croplivestock system under no-tillage with different grazing intensities.\nRevista Brasileira de Ciência do Solo 33: 1675-1684 (in Portuguese,\nwith abstract in English).\nFood and Agriculture Organization of the United Nations [FAO].\n2020. World Food and Agriculture - Statistical pocketbook 2020.\nFAO, Rome, Italy. Available at: http://www.fao.org/3/cb1329en/\nCB1329EN.pdf [Accessed Feb 01, 2021]\nGarcia, R.A.; Crusciol, C.A.C.; Calonego, J.C.; Rosolem, C.A. 2008.\nPotassium cycling in a corn-brachiaria cropping system. European\nJournal of Agronomy 28: 579-585.\nKaminski, J.; Moterle, D.F.; Rheinheimer, D.S.; Gatiboni, L.C.;\nBrunetto, C. 2010. Potassium availability in a Hapludalf soil under\nlong term fertilization. Revista Brasileira de Ciência do Solo 34: 783\n791.\n\nLopes, A.S.; Guilherme, L.S.G. 2016. A career perspective on\nsoil management in the cerrado region of Brazil. Advances in\n\nAgronomy 137: 1-72.\nLupwayi, N.Z.; Clayton, G.W.; O’Donovan, J.T.; Harker, K.N.;\nTurkington, T.K.; Soon, Y.K. 2006. Potassium release during\ndecomposition of crop residues under conventional and zero\ntillage. Canadian Journal of Soil Science 86: 473-481.\nMoterle, D.F.; Bortoluzzi, E.C.; Kaminsk, J.; Rheinheimer, D.S.; Caner,\nL. 2019. Does Ferralsol clay mineralogy maintain potassium long\n\n**Sci. Agric. v.79, n.4, e20200339, 2022**\n\n\n\nterm supply to plants? Revista Brasileira de Ciência do Solo 43:\n\ne0180166.\n\nOliveira, S.M.; Almeida, R.E.M.; Pierozan Junior, C.; Reis,\nA.F.B.; Souza L.F.N.; Favarin, J.L. 2019. Contribution of corn\nintercropped with Brachiaria species to nutrient cycling. Pesquisa\nAgropecuária Tropical 49: e55018.\nRamos, F.T.; Dores, E.F.G.C.; Weber, O.L.S.; Beber, D.C.; Campelo\nJunior, J.H.; Maia, J.C.S. 2018. Soil organic matter doubles the\ncation exchange capacity of tropical soil under no‐till farming in\nBrazil. Journal of the Science of Food and Agriculture 98: 3595\n3602.\n\nResende, A.V.; Borghi, E.; Gontijo Neto, M.M.; Fontoura, S.M.V.;\nBorin, A.L.D.C.; Oliveira, A.J.; Carvalho, M.C.S.; Kappes, C.\n2019. Nutrient balance and fertilization management in soil\nwith improved fertility = Balanço de nutrientes e manejo da\nadubação em solos de fertilidade construída. Tópicos em Ciência\ndo Solo 10: 342-398 (in Portuguese).\nRömheld, V.; Kirkby, E.A. 2010. Research on potassium in\nagriculture: needs and prospects. Plant and Soil 335: 155-180.\n\nRosolem, C.A.; Crusciol, C.A.C.; Volf, M.R.; Nascimento, C.A.C.;\n\nMariano, E. 2019. Potassium dynamics in the soil-plant system\n= Dinâmica do potássio no sistema solo-planta. Tópicos em\nCiência do Solo 10: 283-341 (in Portuguese).\n\nSanches, I.R.; Lazarini, E.; Pechoto, E.A.P.; Santos, F.L.; Bossolani,\n\nJ.W.; Parra, L.F.; Meneghette, H.H.A. 2020. Maize second-crop\nintercropped with forages and soil correction depths: grain\nyield and forages root distribution. Research, Society and\nDevelopment 9: e798974778.\nSantos, H.G.; Jacomine, P.K.T.; Anjos, L.H.C.; Oliveira, V.A.;\nLumbreras, J.F.; Coelho, M.R.; Almeida, J.A.; Cunha, T.J.F.;\nOliveira, J.B. 2013. Brazilian Soil Classification System =\nSistema Brasileiro de Classificação de Solos. 3ed. Embrapa,\nBrasília, DF, Brazil (in Portuguese).\nSantos, I.L.D.; Caixeta, C.F.; Sousa, A.A.T.C.D.; Figueiredo,\nC.C.D.; Ramos, M.L.G.; Carvalho, A.M.D. 2014. Cover plants\nand mineral nitrogen: effects on organic matter fractions in\nan oxisol under no-tillage in the cerrado. Revista Brasileira de\n\nCiência do Solo 38: 1874-1881.\n\nSoil Survey Staff. 2014. Keys to Soil Taxonomy. 12ed. USDA-Natural\nResources Conservation Service, Washington, DC, USA.\n\nSousa, D.M.G.; Lobato, E. 2004. Cerrado: Soil Correction and\n\nFertilization = Cerrado: Correção do Solo e Adubação. 2ed.\n\nEmbrapa Cerrados, Planaltina, DF, Brazil (in Portuguese).\n\nTanaka, K.S.; Crusciol, C.A.C.; Soratto, R.P.; Momesso, L.; Costa,\n\nC.H.M.; Franzluebbers, A.J.; Oliveira Junior, A.; Calonego,\nJ.C. 2019. Nutrients released by _Urochloa_ cover crops prior to\nsoybean. Nutrient Cycling in Agroecosystems 113: 267-281.\n\nTeixeira, P.C.; Donagemma, G.K.; Fontana, A.; Teixeira, W.G.\n2017. Manual of Soil Analysis Methods = Manual de Métodos\nde Análise de Solo. 3ed. Embrapa, Brasília, DF, Brazil (in\n\nPortuguese).\n\nVolf, M.R.; Guimarães, T.M.; Scudeletti, D.; Cruz, I.V.; Rosolem,\n\nC.A. 2018. Potassium dynamics in ruzigrass rhizosphere. Revista\n\nBrasileira de Ciência do Solo 42: e0170370.\n\nYang, J.S.; Hu, W.; ZhaO, W.; Meng, Y.; Chen, B.; Wang, Y.; Zhou,\nZ. 2016. Soil potassium deficiency reduces cotton fiber strength\nby accelerating and shortening fiber development. Scientific\n\nReports 6: 28856.\n\n\n**8**\n\n\n",
  "table_data": [
    {
      "table_id": "Exchangeable potassium reserve in a Brazilian savanna Oxisol after nine years under different cotton production systems_table_0",
      "page": 4,
      "accuracy": 0,
      "data": [
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        }
      ],
      "shape": [
        14,
        1
      ]
    },
    {
      "table_id": "Exchangeable potassium reserve in a Brazilian savanna Oxisol after nine years under different cotton production systems_table_1",
      "page": 5,
      "accuracy": 0,
      "data": [
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        },
        {
          "0": ""
        }
      ],
      "shape": [
        32,
        1
      ]
    },
    {
      "table_id": "Exchangeable potassium reserve in a Brazilian savanna Oxisol after nine years under different cotton production systems_table_2",
      "page": 6,
      "accuracy": 0,
      "data": [
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": "",
          "6": "",
          "7": "",
          "8": "",
          "9": "",
          "10": "",
          "11": "",
          "12": "",
          "13": "",
          "14": "",
          "15": "",
          "16": "",
          "17": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": "",
          "6": "",
          "7": "",
          "8": "",
          "9": "",
          "10": "",
          "11": "",
          "12": "",
          "13": "",
          "14": "",
          "15": "",
          "16": "",
          "17": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": "",
          "6": "",
          "7": "",
          "8": "",
          "9": "",
          "10": "",
          "11": "",
          "12": "",
          "13": "",
          "14": "",
          "15": "",
          "16": "",
          "17": ""
        }
      ],
      "shape": [
        3,
        18
      ]
    },
    {
      "table_id": "Exchangeable potassium reserve in a Brazilian savanna Oxisol after nine years under different cotton production systems_table_3",
      "page": 6,
      "accuracy": 0,
      "data": [
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": "",
          "6": "",
          "7": "",
          "8": "",
          "9": "",
          "10": "",
          "11": "",
          "12": "",
          "13": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": "",
          "6": "",
          "7": "",
          "8": "",
          "9": "",
          "10": "",
          "11": "",
          "12": "",
          "13": ""
        }
      ],
      "shape": [
        2,
        14
      ]
    }
  ]
}