{
  "filename": "Global Fostat Reference Database.pdf",
  "processing_timestamp": "2025-07-06T18:29:34.953140",
  "text_extraction": {
    "success": true,
    "character_count": 79313,
    "output_file": "2_processed_data/text_extracts/Global Fostat Reference Database.md"
  },
  "table_extraction": {
    "success": true,
    "table_count": 0,
    "output_file": "2_processed_data/table_data/Global Fostat Reference Database_tables.json",
    "tables_summary": []
  },
  "quality_metrics": {
    "text_success": true,
    "table_success": true,
    "character_count": 79313,
    "table_count": 0,
    "error_count": 0,
    "processing_completeness": 0.7
  },
  "errors": [],
  "full_text": "Earth Syst. Sci. Data, 16, 525–541, 2024\nhttps://doi.org/10.5194/essd-16-525-2024\n© Author(s) 2024. This work is distributed under\nthe Creative Commons Attribution 4.0 License.\n\n# **A global FAOSTAT reference database of cropland** **nutrient budgets and nutrient use efficiency (1961–2020):** **nitrogen, phosphorus and potassium**\n\n\n**Cameron I. Ludemann** [1] **, Nathan Wanner** [2] **, Pauline Chivenge** [3,a] **, Achim Dobermann** [4] **,**\n**Rasmus Einarsson** [5] **, Patricio Grassini** [6] **, Armelle Gruere** [4] **, Kevin Jackson** [7] **, Luis Lassaletta** [8,9] **,**\n**Federico Maggi** [10] **, Griffiths Obli-Laryea** [2] **, Martin K. van Ittersum** [1] **, Srishti Vishwakarma** [7,b] **,**\n**Xin Zhang** [7] **, and Francesco N. Tubiello** [2]\n\n1 Plant Production Systems Group, Wageningen University & Research, Wageningen, the Netherlands\n2 Statistics Division, Food and Agriculture Organization, Rome, Italy\n3 African Plant Nutrition Institute, Benguérir, Morocco\n4 International Fertilizer Association, Paris, France\n5 Department of Energy and Technology, Swedish University of Agricultural Sciences, Uppsala, Sweden\n6 Department of Agronomy and Horticulture, University of Nebraska–Lincoln, Lincoln, USA\n7 Appalachian Laboratory, University of Maryland Center for Environmental Science,\nFrostburg, Maryland, USA\n8 Department of Agricultural Production, ETSIAAB, Universidad Politécnica de Madrid, Madrid, Spain\n9 CEIGRAM, Universidad Politécnica de Madrid, Madrid, Spain\n10 Environmental Engineering, School of Civil Engineering, The University of Sydney, NSW 2006, Australia\na currently at: International Rice Research Institute (IRRI), Sustainable Impact Department, Dar es Salaam,\nTanzania\nb currently at: Joint Global Change Research Institute, Pacific Northwest National Laboratory, College Park,\nMaryland, USA\n\n\n**Correspondence:** Francesco N. Tubiello (francesco.tubiello@fao.org)\n\n\nReceived: 26 May 2023 – Discussion started: 17 July 2023\nRevised: 14 November 2023 – Accepted: 27 November 2023 – Published: 22 January 2024\n\n\n**Abstract.** Nutrient budgets help to identify the excess or insufficient use of fertilizers and other nutrient sources\nin agriculture. They allow for the calculation of indicators, such as the nutrient balance (surplus if positive or\ndeficit if negative) and nutrient use efficiency, that help to monitor agricultural productivity and sustainability\nacross the world. We present a global database of country-level budget estimates for nitrogen (N), phosphorus\n(P) and potassium (K) on cropland. The database, disseminated in FAOSTAT, is meant to provide a global\nreference, synthesizing and continuously updating the state of the art on this topic. The database covers 205\ncountries and territories, as well as regional and global aggregates, for the period from 1961 to 2020. Results\nhighlight the wide range in nutrient use and nutrient use efficiencies across geographic regions, nutrients, and\ntime. The average N balance on global cropland has remained fairly steady at about 50–55 kg ha [−][1] yr [−][1] during\nthe past 15 years, despite increasing N inputs. Regional trends, however, show recent average N surpluses that\nrange from a low of about 10 kg N ha [−][1] yr [−][1] in Africa to more than 90 kg N ha [−][1] yr [−][1] in Asia. Encouragingly,\naverage global cropland N use efficiency decreased from about 59 % in 1961 to a low of 43 % in 1988, but it has\nrisen since then to a level of 55 %. Phosphorus deficits are mainly found in Africa, whereas potassium deficits\noccur in Africa and the Americas. This study introduces improvements over previous work in relation to the\nkey nutrient coefficients affecting nutrient budgets and nutrient use efficiency estimates, especially with respect\nto nutrient removal in crop products, manure nutrient content, atmospheric deposition and crop biological N\nfixation rates. We conclude by discussing future research directions and highlighting the need to align statistical\n\n\nPublished by Copernicus Publications.\n\n\n526 C. I. Ludemann et al.: A global FAOSTAT reference database of cropland nutrient budgets\n\n\ndefinitions across research groups as well as to further refine plant and livestock coefficients and expand estimates\nto all agricultural land, including nutrient flows in meadows and pastures. Further information is available from\n[https://doi.org/10.5061/dryad.hx3ffbgkh (Ludemann et al., 2023b) as well as the FAOSTAT database (https://](https://doi.org/10.5061/dryad.hx3ffbgkh)\n[www.fao.org/faostat/en/#data/ESB; FAO, 2022a) and is updated annually.](https://www.fao.org/faostat/en/#data/ESB)\n\n\n\n**1** **Introduction**\n\n\nNutrient budgets quantify nutrient flows in agriculture and\nare widely used to quantify the productivity and resource\nuse efficiency of agricultural systems. The nutrient balance\n(defined as the difference between nutrient inputs and productive outputs: termed a surplus if positive and a deficit if\nnegative) is an indicator of the excess or insufficient use of\nnutrients from fertilizers and other sources in crop production. Nutrient surpluses threaten environmental quality, particularly with regard to water and air quality, climate change,\nand biodiversity loss (Zhang et al., 2021; FAO, 2022b). On\nthe other hand, nutrient deficits or nutrient surpluses close to\nzero could indicate soil nutrient mining, potentially decreasing soil health over time. Imbalanced crop nutrition endangers the productivity and sustainability of agriculture. Comparable data on soil nutrient budgets and related indicators\nof nutrient use efficiency are therefore useful tools to assess\nand monitor agricultural performance and may support the\n2030 Sustainable Development Goals indicators (Tubiello\net al., 2021; Zhang et al., 2021; FAO, 2022b; Quan et al.,\n2021). Time series data showing temporal changes are essential to monitor progress toward nutrient-related goals (Zhang\net al., 2021). Some nutrient budget time series with a global\nscope have been published; however, to the authors knowledge, they have been heavily biased toward N (Zhang et al.,\n2015; Conant et al., 2013; Lassaletta et al., 2014; Mueller et\nal., 2012; Bouwman et al., 2017; FAO, 2021; Bodirsky et al.,\n2012; Bouwman et al., 2013; Lassaletta et al., 2016; Lu and\nTian, 2017; Nishina et al., 2017; Zhang et al., 2017), few have\nbeen published for P and no time series has been published\nfor K, meaning that no studies or datasets have integrated all\nthree nutrients into a long-term nutrient budget database.\nData presented in this work focus on _partial_ nutrient budgets (referred to herein as nutrient budgets) and related nutrient use efficiencies on cropland. The term “partial” is used\nhere to indicate that what is computed herein is in fact a partial nutrient budget in which specific nutrient losses such as\ngaseous emissions, leaching or runoff are not explicitly accounted for. In other words, such losses are embedded in\nthe overall nutrient budget estimates, whereas a “complete”\nnutrient budget would explicitly include specific estimates\nof the different losses. Cropland is the sum of arable land\nand permanent crops, including areas left fallow or cultivated\nwith temporary pastures within crop rotations but excluding permanent meadows and pastures (FAO, 2022d). We see\ntwo main rationales for estimating nutrient budgets on crop\n\n\nland. First, cropland is typically where nutrient flows and related environmental impacts are the highest; therefore, cropland budgets and derived indicators such as the surplus are\nmore likely to capture potential pollution hotspots (West et\nal., 2014). Second, permanent meadows and pastures present\nsome particular methodological challenges, primarily due to\nthe lack of global data on productivity and biological N fixation (Tubiello et al., 2023; Schils et al., 2013).\nData presented here build on previous work on estimating\nnational- to global-scale nutrient budgets (or important components of nutrient budgets) over time (Bodirsky et al., 2012;\nBouwman et al., 2017, 2013; Conant et al., 2013; Einarsson\net al., 2020, 2021; FAO, 2021; Herridge et al., 2022; IFA,\n2022a; Kremer, 2013; Lassaletta et al., 2014; Lu and Tian,\n2017; Ludemann et al., 2022a; Mueller et al., 2012; Nishina\net al., 2017; Oenema et al., 2003; Peoples et al., 2021; Vishwakarma et al., 2023; Zhang et al., 2015, 2021; Zou et al.,\n2022). This study adds additional refinements – such as new\nestimates of synthetic fertilizer inputs, the fraction of fertilizer applied to cropland, manure, N deposition, biological N fixation and nutrients removed in harvested crops (see\nSect. 2). The new data are made freely available to users\nworldwide for N, P and K budgets, budget components, and\nnutrient use efficiencies, covering 205 countries and territories for the period from 1961 to 2020 (FAO, 2022a). In\nour view, the resulting dataset represents the most complete\ndataset to date on the subject matter, serving as a reference\nfor additional refinements by the scientific community.\n\n\n**2** **Methods**\n\n\nThe cropland nutrient budget (CNB) was developed for N,\nP and K data for all areas of cropland as an FAO land use\ncategory (FAO, 2022a, d) at the country level. The nutrient\nbudget inputs on cropland considered in this work included\nthe application of synthetic fertilizer (SF) (also referred to\nas “chemical fertilizer” or “mineral fertilizer”), manure from\nlivestock, N inputs through biological N fixation and the atmospheric N deposition. The nutrient budget outputs were\nthe nutrients removed via crop harvest. The nutrient budget\nbalance was calculated as the difference between inputs and\noutputs (surplus if positive or deficit if negative). Nutrient\nuse efficiency was computed as the nutrient outputs as a percentage of nutrient inputs.\nThe nutrient balance for country _i_, nutrient _j_ and year _y_\nwas computed as the sum of inputs: SF multiplied by the\nfraction of fertilizer applied to cropland (CF), manure ap\n\n\nEarth Syst. Sci. Data, 16, 525–541, 2024 https://doi.org/10.5194/essd-16-525-2024\n\n\nC. I. Ludemann et al.: A global FAOSTAT reference database of cropland nutrient budgets 527\n\n\n\nplied to cropland soils (MAS), atmospheric deposition (AD;\nonly for N), and biological N fixation (BF; only for N) minus\ncrop removal (CR), which represents the outputs in the CNB\n(Eq. 1).\n\n\nbalance _i,j,y_ = SF _i,j_ × CF _i.j.y_ + MAS _i,j,y_ + AD _i,j,y_\n\n+ BF _i,j,y_ − CR _i,j,y_ (1)\n\n\nData were computed as both total nutrients and as per area\nof cropland per year. Collection and analysis of each of these\nCNB components are described in more detail in the following sections.\n\n\n2.1 Cropland area\n\n\nCropland area defines the scope of the estimations made\nin this work. Here, cropland is defined, per the FAO land\n[use category for the collection of country data (https://www.](https://www.fao.org/statistics/data-collection/en/)\n[fao.org/statistics/data-collection/en/, last access: 5 Novem-](https://www.fao.org/statistics/data-collection/en/)\nber 2023), as follows: “land used for cultivation of temporary and permanent crops in rotation with fallow, meadows\nand pastures within cycles of up to five years”. It is important to underscore that the land use term “cropland” generally\nencompasses more area than the corresponding term used\nin remote sensing and biophysical modeling, which largely\nrefers only to land areas planted or harvested with annual\ncrops (Tubiello et al., 2023). Identifying flows on cropland\nas a land use category allows for clear operational definitions\nof what is within the scope with regards to CNB data at the\ncountry level in line with FAO reporting. At the same time, it\ngenerates significant uncertainty in the associated quantities,\nas discussed below.\n\n\n2.2 Cropland nutrient budget components\n\n\nInformation on SF inputs was sourced from data on agricultural use from both FAOSTAT (FAOSTAT, 2022) and IFASTAT (IFASTAT, 2022), taking the mean value of the two data\nsources when both were available. The individual datasets\n\nhave been shown to be rather equivalent (FAO, 2022b); therefore, in a reference database, the choice was on a consol\nidated dataset from both sources. All SF values were con\nverted to elemental quantities of nutrients based on a mass\nproportion composition conversion of 0.436 kg of elemental P per kilogram of P 2 O 5 and 0.83 kg of elemental K per\nkilogram of K 2 O. Where necessary, all other inputs and outputs were converted to quantities of elemental nutrients using\nthese conversion factors.\n\nImportantly, both FAO and IFA data refer to fertilizer use\nin agriculture generally, while actual amounts used specifically on cropland are not systematically estimated. The fraction of fertilizer applied to cropland (CF) was therefore\nneeded to determine inputs for the CNB developed in this\nwork. For the majority of countries, due to a lack of specific\ninformation, default cropland fraction estimates of 100 %\n\n\n\n**Table 1.** Percentages (%) of total nitrogen (N), phosphorus (P) and\npotassium (K) fertilizers used in agriculture and applied to cropland\nfor the listed countries for the years from 1961 to 2020. These percentages were also used to apportion nutrients from manure from\nlivestock in agriculture to cropland.\n\n\nCountry N P K\n\n\nAustralia 90 70 80\n\nAustria 90 90 90\n\nBrazil 90 100 95\n\nCanada 90 100 95\n\nChile 80 70 75\n\nFinland 70 100 85\n\nFrance 90 90 90\n\nGermany 80 90 85\nIreland 20 30 25\n\nJapan 80 100 90\nMorocco 90 100 95\n\nThe Netherlands 50 90 70\n\nNew Zealand 10 10 10\n\nPoland 80 90 85\n\nSlovenia 60 70 65\n\nSouth Africa 90 90 90\n\nSwitzerland 70 70 70\n\nUnited Kingdom 80 70 75\nUnited States 80 100 90\n\nUruguay 90 90 90\nLuxembourg 40 70 55\nOther countries 100 100 100\n\n\nwere used for N, P and K, thereby assuming that all fertilizers were applied on cropland area. At the same time, we were\nable to identify 21 countries for which reasonable evidence is\navailable to support specific values of CF for N (Table 1). CF\nfor major crops by country were first estimated for N considering estimates derived from four sources (Zhang et al., 2021;\nEinarsson et al., 2021; Ludemann et al., 2022a; FAO, 2022a).\nThe 21 countries with new CF estimates were selected based\n\non relatively stringent criteria, namely, (1) if a given country had reported CF estimates for N from IFA and/or FAO,\n(2) if selected CF estimates for N use were significantly\nlower than 100 % and (3) if CF estimates were in general\ngood agreement across these various sources. In addition, for\ntwo countries, Ireland and New Zealand, we used the CF values communicated by the country directly to FAO as its part\nof statistical data collection. Conversely, default CF values\n(of 100 %) were used for countries for which (1) there was\nlack of sufficient data, (2) reported estimates were close to\n100 % (e.g., _>_ 90 %) or (3) disagreement existed in reported\nvalues from our available sources. For countries with recom\nmended updates, CF for P was based on reported values by\nZou et al. (2022). The CF values for K were calculated as\naverages of the N and P coefficients. Further clarification of\nthe derivation and screening of CF estimates is included in\nSect. S1 in the Supplement.\n\n\n\nhttps://doi.org/10.5194/essd-16-525-2024 Earth Syst. Sci. Data, 16, 525–541, 2024\n\n\n528 C. I. Ludemann et al.: A global FAOSTAT reference database of cropland nutrient budgets\n\n\n\n**Table 2.** Phosphorus (P) and potassium (K) to N ratios in livestock\n\nmanure.\n\n\nFAO code Item P : N ratio K : N ratio\n\n\n960 Cattle, dairy 0.14 1.11\n961 Cattle, nondairy 0.19 0.95\n976 Sheep 0.16 0.96\n1016 Goats 0.17 0.88\n\n1049 Swine, market 0.25 0.55\n1051 Swine, breeding 0.28 0.45\n1052 Chickens, layers 0.27 0.37\n1053 Chickens, broilers 0.22 0.34\n\n1068 Ducks 0.18 0.32\n\n1079 Turkeys 0.23 0.33\n1096 Horses 0.18 0.80\n\n1759 Mules and asses 0.18 0.80\n\n1760 Camels and llamas 0.18 0.80\n\n946 Buffaloes 0.16 1.17\n\n\nOrganic N inputs were limited to livestock manure applied\nto cropland soils (MAS). MAS was estimated as N from\ntreated manure in manure management systems applied to\nsoil following the IPCC Guidelines for National Greenhouse\nGas Emission Inventories at Tier 1 (e.g., FAO, 2022c). The\nassociated P and K quantities were subsequently estimated\nusing published P : N and K : N conversion ratios (Statistics\nNetherlands, 2012; Sheldrick et al., 2003) (Table 2). The N,\nP and K nutrients from manure from livestock were apportioned to cropland based on the same CF values shown in\nTable 1.\n\nAtmospheric deposition (AD) refers to N inputs from the\natmosphere as dry and wet N deposition, considering both\nthe reduced and oxidized forms; this information was derived from a review of existing methods and related data\nsources for national-scale data, as described in Vishwakarma\net al. (2023). Of the four datasets for AD, the product comprising Land-Use Harmonization (LUH2; Hurtt et al., 2020),\nWang et al. (2019), Shang et al. (2019) and Wang et al. (2017)\ndata were used in the CNB. The flows of P and K through atmospheric deposition are generally negligible (Einarsson et\nal., 2020) and were, therefore, not included in the CNB.\nBiological fixation (BF) of N by grain legume crops was\nestimated using a yield-dependent and regionally specific\nmodel presented by Peoples et al. (2021) and Herridge et\nal. (2022). This model was based on statistical regressions for\neight categories of grain legumes: chickpea, common bean,\nfaba bean, groundnut, lupin, pigeon pea, soybean and other.\nFor soybean, the model further distinguishes Brazil, Europe\nand the rest of the world. The model assumes a nonlinear\n\ndependence of the BF rate on crop yield and, therefore, in\ncontrast to earlier publications, does not lead to fixed ratios\nbetween the harvest area and BF. Further details on these\n\nmodels are included in Sect. S2. Forage legumes were not accounted for due to the lack of production data (see Sect. 2.3.1\n\n\n\nbelow). For non-legume crops, BF was estimated using fixed\nglobal per-hectare coefficients of 25 kg N ha [−][1] yr [−][1] for rice\nand sugarcane (see Sect. S2 for a detailed explanation). With\nthe exception of rice and sugarcane, N fixation from freeliving N-fixing bacteria in other crops was not included in\nthe CNB. The source code (in R and Python) and detailed\noutput for the BF estimates are freely available (Einarsson,\n2023b, a).\nCrop removal (CR) rates were calculated using crop nutrient removal coefficients multiplied by crop production\nstatistics. The crop production data were taken from FAOSTAT (FAO, 2022e). Crop nutrient removal coefficients from\nSect. S3, which were derived from a meta-analysis described\nby Ludemann et al. (2023a), were used to estimate total crop\nnutrient removal. Crop species that did not have specific crop\nnutrient concentration values from Ludemann et al. (2023a)\n(version date 7 March 2023) were gap-filled using weightedaverage nutrient concentrations of the crop species in the\nsame “Item Group” using the 2014 harvested-area values as\nweighting factors. The source code for standardizing and analyzing the CR data in R was published separately by Ludemann (2022) and Ludemann et al. (2023a).\nThe same aforementioned coefficients for all of the CNB\ncomponents were applied to each year across the full time\nseries.\n\n\n2.3 Data limitations and uncertainty\n\n\n2.3.1 Scope\n\n\nThe nutrient budgets presented here refer to the FAO cropland area (as defined in Sect. 2.1) but also acknowledge that\nthere is substantial uncertainty in cropland area measurement\nand a variety of definitions across various relevant land cover\nproducts (Tubiello et al., 2023). The world’s cropland area\nused in the present study was taken from FAOSTAT (FAO,\n2022e) and was 1 _._ 562 × 10 [9] ha for 2020. This compares well\nto the 1 _._ 215 × 10 [9] –2 _._ 002 × 10 [9] ha range and ∼ 25 % relative\nuncertainty in cropland area recently estimated by Tubiello\net al. (2023) (Table 3, Sect. S4). In addition, the CNB excludes crops with no production data in FAOSTAT (FAO,\n2022e); these include forage crops such as alfalfa, clover and\ngrass–clover mixtures. Exclusion of these crops likely leads\nto a substantial underestimation of cropland nutrient removal\nand, in some cases, cropland biological N fixation in countries where forage legumes are major components of cropland, such as Australia, Argentina, several European countries (Einarsson et al., 2021), New Zealand and the United\nStates of America (Lassaletta et al., 2014). Another cause of\nuncertainty in the CNB arises from how the parameters were\nestimated, as is described in the next section.\n\n\n2.3.2 Uncertainty\n\n\nNutrient budgets tend to have large uncertainties (Lesschen\net al., 2007; Zhang et al., 2020; Pathak et al., 2010). How\n\n\nEarth Syst. Sci. Data, 16, 525–541, 2024 https://doi.org/10.5194/essd-16-525-2024\n\n\nC. I. Ludemann et al.: A global FAOSTAT reference database of cropland nutrient budgets 529\n\n\n**Table 3.** Estimates of relative uncertainty (expressed as the coefficient of variation, CV, %) in key items and affected components of the\ncropland nutrient budget (CNB) using 2020 data. Details on each contributing item and component are included in Sect. S4.\n\n\nItem Components of CNB item effects [a] Relative uncertainty (%) [b]\n\n\nCropland area All 25 %\nCrop production CR, BF 7 %\nLivestock numbers MAS 10 %\n\nLivestock manure nutrient coefficients MAS 50 %\nSynthetic fertilizer (SF) use SF 25 %\nFraction of SF applied to cropland SF 10 %\nAtmospheric deposition of N AD 70 %\nBiological N fixation coefficients BF 60 %\nCrop removal coefficients CR 20 %\n\n\na Components of the cropland nutrient budget (CNB) include the following: synthetic fertilizer (SF), fraction of SF applied to cropland\n(CF), manure applied to soil (MAS), atmospheric deposition (AD), biological fixation (BF) and crop removal (CR). [b] Uncertainty was\nexpressed as the coefficient of variation to 2 significant figures.\n\n\n\never, in general, there appears to be more certainty in the\ndirection (e.g., is it a negative or positive balance) and its\nevolution in time for a given country than in the magnitude\nof nutrient balances. For example, where multiple studies estimated the N, P and K balances for Burkina Faso, there was\ngood concordance (90 % showing same direction) with respect to whether there was a deficit or surplus (Lesschen et\nal., 2007). However, the coefficient of variation in these estimates of nutrient balances in Burkina Faso made by the various researchers was 27 % for N, 167 % for P and 115 % for\nK (Lesschen et al., 2007). At a global level, estimates of the\nquantity of N surplus also have great uncertainty. This is evidenced by the more than 50 % differences in the estimated\nN surplus quantity depending on whose estimate is used, as\nanalyzed by Zhang et al. (2021).\nEach contributing item of the CNB has varying levels of\nuncertainty, with N deposition having the greatest relative\nuncertainty (CV of ∼ 70 %) and crop production having the\nleast uncertainty (CV of ∼ 7 %) (Table 3). At the same time,\nN deposition is a small contributor to the overall N budget,\nwith values across the world (as a mean) being less than\n10 kg N ha [−][1] yr [−][1], so that its contribution to overall uncertainty is also small (Sect. S4). Conversely, items expected to\ncontribute substantially to the overall CNB include SF use\nand coefficients for estimating crop nutrient removal. These\nitems had similar (∼ 20 %–25 %) uncertainty (Sect. S4). The\npreceding estimates of uncertainty used data that best represented the nutrient component (e.g., CV % values for maize,\nrice, soybeans and wheat were used to represent uncertainty\nin crop nutrient removal, as these crops make up the majority\nof total grain production worldwide) following IPCC (2006).\nIt is important to note that there could be greater uncertainties associated with items that were not included in this as\nsessment due to a lack of data and/or because items were\n\ndeemed to make a minor contribution to the overall CNB.\n\nWhile cropland area has a reasonable 25 % estimate of\nuncertainty, this value does not elucidate the challenges in\n\n\nvolved with quantifying the nutrient inputs and outputs from\nthis category of land. Three main issues arise in the current CNB: (1) it is assumed that the same CF values for SF\nare used to apportion nutrients from manure from livestock\nto cropland, (2) no nutrient outputs from the herbage removed from some of the categories of cropland (e.g., temporary meadows and pasture or silage maize) are accounted for\nand (3) the exchange of manure between countries is not accounted for. The Netherlands is an example of a country extremely affected by the limitations of the current methodology. Much of the manure from the dairy sector in the Netherlands is applied on-farm to areas of land growing maize for\nsilage or temporary or permanent meadows and pastures.\nHowever, the proportion of manure applied to cropland may\nnot correspond to the CF values estimated for SF. There is\nuncertainty in these estimates. In addition, none of the nutrients removed as herbage from the maize for silage or grazed\nor mown temporary meadows or pastures are included in the\ntotal estimate of nutrient outputs. Further, the Netherlands\nexports 10 % of its manure from livestock to other countries.\nBetter accounting for N outputs from herbage removed in\nthe Dutch “maize for silage” scenario, “temporary meadows\nand pastures” scenario or both scenarios combined was estimated to increase the nitrogen use efficiency (NUE) from\nthe original 30 % in the CNB to 58 %, 50 % and 77 %, respectively (Sect. S5). Conversely, accounting for exports of\nmanure from the Netherlands to neighboring countries was\nshown to increase the NUE from 30 % to 32 % (Sect. S5).\nWhile the Netherlands is an extreme case, other countries\n\nwith a substantial number of livestock and substantial ar\neas of meadows and pastures or fodder crops like maize for\nsilage (e.g., Ireland, Denmark and New Zealand) could also\nbe affected, albeit to a lesser degree (Sect. S5). It must also\nbe noted that the aforementioned scenarios do not account\n\nfor the confounding effect of manure applied to permanent\nmeadows and pastures, and this could also substantially effect estimates of nutrient surplus and the NUE.\n\n\n\nhttps://doi.org/10.5194/essd-16-525-2024 Earth Syst. Sci. Data, 16, 525–541, 2024\n\n\n530 C. I. Ludemann et al.: A global FAOSTAT reference database of cropland nutrient budgets\n\n\n\n2.3.3 Possible future improvements\n\n\nApart from improving the accuracy and granularity of components that already exist in the CNB, there are several options for future developments of this database.\nAs highlighted in Sects. 2.3.2 and S5, the area of fodder\nand forage crops in a country can have a substantial effect on\nnutrient budgets and estimates of nutrient use efficiency. Including estimates of nutrients removed as fodder and forage\ncrops will therefore allow for a fairer comparison between\ncountries for indicators included in the CNB.\n\nAn important future development of the CNB is to more\nexplicitly account for changes in soil nutrient stocks, which\nare currently “hidden” in the estimated surpluses or deficits.\nHowever, this will be difficult given the dynamic and stochastic characteristics of soil system processes (Cobo et al.,\n2010).\nIncluding results at a sub-country and crop-specific level\nis a further area of development. Issues with apportioning\nfertilizer and manure to different land use classes or crops\nwill need to be overcome to succeed in spatially disaggregating nutrient budgets and also to accurately estimate separate\nnutrient budgets for cropland and permanent meadows and\npastures. While data on SF use by crops are available at a\nglobal scale (Ludemann et al., 2022a), estimation of quantities of manure applied to each crop requires suitable survey\ndata that do not yet exist globally. Management of manure\nduring housing and storage before it is applied to cropland\nalso varies spatially and temporally. This can have a substantial effect on the concentrations of nutrients in manure\n\n(Statistics Netherlands, 2012), leading to uncertainty in the\nquantities of nutrients applied as manure. In addition, use\nof the same value for the fraction of N fertilizer applied to\ncropland as that used for the fraction of livestock manure applied to cropland introduces uncertainty in the overall CNB\nestimates. As described in Sect. S5, this assumption may not\nhold for every country. Introduction of country-specific fractions representing the proportion of manure from livestock\nthat is applied to cropland will be an important improvement\nin future iterations of the CNB.\n\nThe current database does not include estimates of nutri\nents removed as crop residues, nor are the nutrient concentrations of crop products used in the current database countryspecific (see Sect. S3). Progress is being made toward improved predictions of a crop harvest index that can be used to\ndetermine the quantities of crop residues based on the quantities of crop products (Ludemann et al., 2022b). However, no\nstudies with a global scale are available to indicate the proportion of crop residues removed from the land at harvest.\nThis will require the extensive collection of survey information to get more relevant crop- and country-specific values.\nFor improved estimates of nutrients removed as crop prod[ucts, open databases (http://www.cropnutrientdata.net, last](http://www.cropnutrientdata.net)\naccess: 2 October 2023; Ludemann et al., 2023a) and prediction models are being developed to support country- and sub\n\n\ncountry-specific nutrient concentrations of these crop components. As country- and crop-specific coefficients (Tier 2 or\nTier 3 level) are developed, these can be included in future\niterations of the CNB.\n\nSome nutrient inputs currently excluded from the CNB\n(e.g., nutrients in irrigation water and nutrients in composted\ncrop residues or human manure) could be included in the future, especially in countries where these constitute a significant contribution to overall inputs (Serra et al., 2023).\nFinally, with new capabilities becoming available from\nthe spatialization of aggregated data to georeferenced grids,\nthe current version and future updates of the database distributed here can provide local-scale information on specific\ngeographic regions – information that is generally associated\nwith lower uncertainty, specifically in countries with a large\nsurface area where only small portions are used for agricul\nture.\n\n\n**3** **Results and discussion**\n\n\n3.1 Global and regional estimates\n\n\nGlobal CNB surpluses (i.e., greater nutrient inputs than outputs) were recorded for all three plant nutrients in 2020, with\nnutrient loading of N, P and K progressively increasing over\nthe 1961–2020 period, except for K across all cropland since\n1961 (which decreased by 20 %) (Table 4; Fig. 1a, b). On a\nper-hectare basis N, P and K nutrient surpluses changed by\n320 %, 110 % and −27 %, respectively, from 1961 to 2020\n(Table 5).\nThe greatest contributor to nutrient inputs in 2020 was SF,\nfollowed by biological N fixation for N and manure applied\nto the soil for P and K (Table 4). The greatest change in any\ninput or output of nutrients (between 1961 and 2020) was\nthe increase in use of SF, with changes of 1000 %, 370 %\nand 380 % estimated for N, P and K, respectively. In 1961,\nthe main nutrient inputs were from livestock manures for all\nthree plant nutrients. With the increase in SF use came a decrease in the relative importance of manure as a source of\ntotal N inputs. N inputs from manure went from contributing ∼ 38 % of the total N inputs in 1961 to ∼ 14 % in 2020\n(Table 4). Over the same period, SF went from contributing\n22 % of total N inputs to 58 % (Table 4).\nThe greatest absolute increases in global N balances were\nestimated between 1961 and 1988 (Fig. 1a, b), followed by a\nshort-term decrease and then by a less marked increase over\nthe last 3 decades until 2020. At the same time, there was\na decreasing trend in N use efficiency from an overall value\nof 59 % in 1961 to 55 % in 2020 (Fig. 1c). In contrast, the\nP and K use efficiencies increased over the same period, in\nparticular since the 1980s, from 64 % to 75 % for P and from\n46 % to 80 % for K (Fig. 1c). Note that the nutrient use efficiency tends to become higher than 100 % when nutrient\ninputs are very low; this requires careful interpretation. It\nmay either point to undesirable soil nutrient mining, e.g., in\n\n\n\nEarth Syst. Sci. Data, 16, 525–541, 2024 https://doi.org/10.5194/essd-16-525-2024\n\n\nC. I. Ludemann et al.: A global FAOSTAT reference database of cropland nutrient budgets 531\n\n\n**Figure 1.** The annual cropland nutrient balances (surpluses if positive or deficits if negative) in millions of tonnes (Mt) of nutrient per FAO\narea **(a)**, in kilograms of nutrient per hectare **(b)** and with respect to the overall nutrient use efficiency percentage **(c)** for different FAO areas\nof the world for nitrogen (N), elemental phosphorus (P) and elemental potassium (K) from 1961 to 2020.\n\n\n\nAfrica where inputs have been historically low (Vitousek et\nal., 2009), or to some targeted (desired) soil depletion, e.g., in\nparts of northwestern Europe where excessive historical inputs of P have led to environmental problems (Einarsson et\nal., 2020).\nThe absolute values for the nutrient surplus of N (on a total\nand per-hectare basis) were consistently greater than values\nof P and K surpluses across the 1961–2020 period (Fig. 1a,\nb). K surpluses were consistently greater than P surpluses\nacross the same period (Fig. 1a).\n\n\n3.2 Country estimates\n\n\nThere was large heterogeneity in CNB values by country in\n2020 (Fig. 2). Countries with N, P or K deficits or surpluses\ngreater than the upper (80th) quantile are highlighted using\nred in Fig. 2, those with values between the 60th and 80th\nquantile are highlighted using orange, those with values be\n\n\ntween the 40th and 60th quantile are highlighted using yellow, those between the 20th and 40th quantile are highlighted\nusing dark green, and those below the 20th quantile are highlighted using light green. Countries in Africa had cropland\nN surpluses of less than 40 kg ha [−][1] yr [−][1] (with the exception of Egypt with 200 kg ha [−][1] yr [−][1] ). Most European countries had N surpluses of between 40 and 80 kg N ha [−][1] yr [−][1],\nwhereas some of the largest values were found in Asia. For\ninstance, China and India had average N surpluses of 140 kg\nand 120 kg N ha [−][1] yr [−][1], respectively (Fig. 2). The total number of countries with negative N, P and K surpluses (nutrient\ndeficits) was 14, 64 and 59 in 2020, respectively. It is important to note that extreme values for some countries may represent errors in the data collected for those countries (such as\nthe SF use quantities), rather than (or in addition to) actual\ndifferences in agronomic performance. Maps of the total N,\nP and K inputs and outputs are available in Sect. S6.\n\n\n\nhttps://doi.org/10.5194/essd-16-525-2024 Earth Syst. Sci. Data, 16, 525–541, 2024\n\n\n532 C. I. Ludemann et al.: A global FAOSTAT reference database of cropland nutrient budgets\n\n\n**Table 4.** Global cropland nutrient balances and use efficiencies for nitrogen (N), phosphorus (P) and potassium (K), by component, for the\nyears 1961 and 2020 (million tonnes). Values are rounded to 2 significant figures. Soil nutrient balance is defined as nutrient inputs minus\nnutrient outputs, while nutrient use efficiency is defined as nutrient outputs as a percentage of nutrient inputs.\n\n\nItem N P K\n\n\n1961 2020 % change [∗] 1961 2020 % change [∗] 1961 2020 % change [∗]\n\n\nInputs 45 190 320 8.7 27 210 28 58 110\nSynthetic fertilizers 10 110 1000 4.5 21 370 6.6 32 380\nManure 17 26 53 4.3 6.6 53 21 25 19\n\nBiological fixation 11 39 250 0 0 NA 0 0 NA\nAtmospheric deposition 7.1 16 130 0 0 NA 0 0 NA\n\n\nOutputs 27 100 270 5.6 21 280 13 46 250\nCrop removal 27 100 270 5.6 21 280 13 46 250\n\n\n**Soil nutrient balance** **18** **90** **400** **3.1** **6** **94** **15** **12** **−** **20**\n\n\n**Nutrient use efficiency (%)** **60 %** **52 %** **−** **13** % **64 %** **78 %** **22 %** **46 %** **79 %** **72 %**\n\n\n∗ Percentage difference between the 2020 and the 1961 values over the 1961 value. NA: not available.\n\n\n**Table 5.** Global cropland nutrient balances of nitrogen (N), phosphorus (P) and potassium (K), total and by component, for 1961 and 2020\n(kg ha [−][1] ). Values are rounded to 2 significant figures. Soil nutrient balance is defined as nutrient inputs minus nutrient outputs.\n\n\nItem N P K\n\n\n1961 2020 % change [∗] 1961 2020 % change [∗] 1961 2020 % change [∗]\n\n\n**Inputs** **33** **120** **260** **6.5** **18** **180** **20** **37** **85**\nSynthetic fertilizers 7.7 69 800 3.3 13 290 4.9 21 330\nManure applied to soils 13 17 31 3.2 4.2 31 16 16 0\nBiological fixation 7.8 25 220 0 0 NA 0 0 NA\nAtmospheric deposition 5.3 10 89 0 0 NA 0 0 NA\n\n\n**Outputs** **20** **66** **230** **4.1** **13** **220** **9.3** **29** **210**\nCrop removal 20 66 230 4.1 13 220 9.3 29 210\n\n\n**Soil nutrient balance** **13** **54** **320** **2.4** **5.0** **110** **11** **8** **−** **27**\n\n\n∗ Percentage difference between the 2020 and the 1961 values over the 1961 value. NA: not available.\n\n\n\nIn terms of nutrient use efficiency for 2020, the total number of countries with a nutrient use efficiency greater than\n100 % was 14, 64 and 59 for N, P and K, respectively (Fig. 3).\nThe total number of countries with a nutrient use efficiency\nof less than 50 % was 80, 44, and 59 for N, P and K, respectively. Combining information from Figs. 2 and 3, some\ncountries show differences between their status for the nutri\nent balance and nutrient use efficiency. N in Kazakhstan, for\nexample, is ranked lower in terms of the N balance (a deficit\nof 3 kg ha [−][1] yr [−][1] ), whereas it is ranked highly in terms of\nN use efficiency (a NUE of 120 %), indicating a risk of soil\nmining. Note, however, that orange colors in Fig. 3 (efficiencies exceeding 90 %) may be desirable in regions that have\nhistorically received large P or K applications that are causing environmental problems. Therefore, it is important to account for this context when evaluating the NUE of a specific\ncountry in the CNB.\n\n\n\nOf the “top 10 countries” ranked based on the quantity of\nsynthetic N fertilizer used per country in 2020, four were in\nAsia (China, India, Pakistan and Indonesia) (Fig. 4). Of these\ntop 10 countries, France had the greatest N, P and K surpluses per hectare between 1961 and 1986 (with a surplus of\n∼ 110 kg N ha [−][1] yr [−][1] in 1986) (Fig. 4a). After this point, the\nper-hectare N surpluses in China became greater than those\nin France. By 1995 and 2014, China started to have a greater\nP and K surplus than France: surpluses of 21 kg P ha [−][1] yr [−][1]\n\nand 35 kg K ha [−][1] yr [−][1] in China, respectively (Fig. 4a). There\nwere generally negative trends in the N use efficiency for the\ntop 10 countries over the 1961 to 2000 period, after which\nthere was an overall stabilization of annual values (Fig. 4b).\nExceptions to this negative trend for N were for Brazil and\nUkraine, potentially caused by greater harvested areas of Nfixing soybeans. There was a greater range in P and K use efficiency over time compared with N use efficiency (Fig. 4b),\nwith countries such as Indonesia having a greater than 200 %\n\n\n\nEarth Syst. Sci. Data, 16, 525–541, 2024 https://doi.org/10.5194/essd-16-525-2024\n\n\nC. I. Ludemann et al.: A global FAOSTAT reference database of cropland nutrient budgets 533\n\n\n**Figure 2.** Cropland nutrient balances (in kilograms of nutrient per hectare per year) for different areas of the world for **(a)** nitrogen (N), **(b)**\nelemental phosphorus (P) and **(c)** elemental potassium (K) for 2020. Colors are based on quantiles estimated to 2 significant figures. There\nis considerable uncertainty associated with these data; please refer to Sect. 2.3.2 for more details. The boundaries and names shown and\nthe designations used on these maps do not imply the expression of any opinion whatsoever on the part of FAO concerning the legal status\nof any country, territory, city or area; its authorities; nor the delimitation of its frontiers and boundaries. Dashed lines on maps represent\napproximate border lines for which there may not yet be full agreement. The final boundary between Sudan and South Sudan has not yet\nbeen determined. The dotted line represents the approximate location of the Line of Control in Jammu and Kashmir agreed upon by India\nand Pakistan. The final status of Jammu and Kashmir has not yet been agreed upon by the parties.\n\n\n\nP use efficiency and greater than 100 % K use efficiency in\nsome years between 1961 and 1980.\n\n\n3.3 Major trends\n\n\nGlobally, the major trends seen in this analysis include the\ngeneral increase in nutrient inputs and outputs of N, P and K\nduring the period from 1961 to 2020, reflecting the increased\nscale and intensity of food production in most countries over\n\n\n\nthe same period. The relative larger increase in the growth\nof inputs vs. outputs has concurrently resulted in greater nutrient surpluses for N and P, whereas K surpluses have decreased. This indicates that more emphasis has been placed\nglobally on inputs of N and P compared with K, relative to\nremoved nutrients. Many soils still have substantial native K\nresources, and the returns on investment for the application\nof K on cropland are often less than those obtained from applying N and P. Insufficient understanding of how deficient\n\n\n\nhttps://doi.org/10.5194/essd-16-525-2024 Earth Syst. Sci. Data, 16, 525–541, 2024\n\n\n534 C. I. Ludemann et al.: A global FAOSTAT reference database of cropland nutrient budgets\n\n\nsoils are in available K relative to other nutrients may also\nplay a role.\nWithin the 1961 to 2020 time period, the fastest increase\nin annual N, P and K surpluses occurred between 1961 and\n1988. This was followed by a fall in surpluses that was followed by relatively stable (for N) or declining trends in (P\nand K) balances on a total and per-hectare basis. The decline\nin fertilizer consumption the late 1980s/early 1990s was most\nlikely caused by the breakup of the former Soviet Union and\npolitical changes in much of eastern Europe (FAO, 2022b).\nAt the same time, there was also growing awareness of the\nenvironmental effects of unsustainable agricultural management practices in other parts of the world (Cassou, 2018).\nFor example, in the late 1980s, the European Union (EU)\nstarted implementing policies that reduced direct payments,\nwhile there was an increase in payments linked to environmental objectives (Cassou, 2018). As a result, the EU N, P\nand K surpluses have decreased over the last 3 decades. For\ninstance, the EU was estimated to have had respective decreases of about 40 %, 80 % and 60 % for N, P and K surpluses on a per-hectare basis. These tendencies initially impacted global trends, although they have been progressively\ncounterbalanced by increasing surpluses in major countries\nsuch as China, India, Pakistan and Brazil, largely due to substantial increases in SF use in recent decades. For instance,\nthe application rates in China, India, Pakistan and Brazil increased by 230 % (as a mean across countries and across N,\nP and K) between 1990 and 2020, and N, P and K surpluses\nincreased by nearly 300 % (as a mean across those countries)\nover the same period.\n\n\n3.4 Comparisons with previous studies\n\n\n\n**Figure 3.** Cropland nutrient use efficiency (in percent) for different\nareas of the world for **(a)** nitrogen (N), **(b)** elemental phosphorus\n(P) and **(c)** elemental potassium (K) for 2020. There is considerable\nuncertainty associated with these data; please refer to Sect. 2.3.2\nfor more details. The boundaries and names shown and the designations used on these maps do not imply the expression of any opinion whatsoever on the part of FAO concerning the legal status of\nany country, territory, city or area; its authorities; nor the delimitation of its frontiers and boundaries. Dashed lines on maps represent\napproximate border lines for which there may not yet be full agreement. The final boundary between Sudan and South Sudan has not\nyet been determined. The dotted line represents the approximate location of the Line of Control in Jammu and Kashmir agreed upon by\nIndia and Pakistan. The final status of Jammu and Kashmir has not\nyet been agreed upon by the parties. Nutrient use efficiency ranges\nwere based on values suggested by the EU Nitrogen Expert Panel\n(2016).\n\n\n\nThe general trends in N inputs, outputs, balances and use efficiencies over time in the present study were broadly consistent with estimates from previous studies (Fig. 5a, b, c and d,\nrespectively), with some exceptions. Over the 1961 to 2020\nperiod, estimates of N inputs from the current study were\n“mid-range” compared with the other studies (Fig. 5a), but\nN outputs were generally greater than those estimated from\nother studies (Fig. 5b). This resulted in estimates of N balances over time that were mid-range compared with other\nstudies (Fig. 5c) as well as N use efficiencies that were generally greater than estimates from other studies (Fig. 5d).\nMultiple factors could have contributed to the inter-study\nvariation in indicators shown in Fig. 5. Firstly, FAOSTAT\ncrop production and fertilizer data have been updated since\nthe previous studies were published. Any changes in historic\ncrop production and fertilizer input data will contribute to\ndifferences in estimates of total N outputs and N inputs, respectively. To put this into context, Zhang et al. (2021) indicated that the FAOSTAT value for China’s N fertilizer use\nwas 10 × 10 [6] tyr [−][1] lower based on the 2017 version of the\ndata compared with the 2000 version. In addition, variation\nin estimates of the N concentration of the crop product for\n\n\n\nEarth Syst. Sci. Data, 16, 525–541, 2024 https://doi.org/10.5194/essd-16-525-2024\n\n\nC. I. Ludemann et al.: A global FAOSTAT reference database of cropland nutrient budgets 535\n\n\n**Figure 4.** The annual **(a)** cropland nutrient balances (surplus if positive and deficit if negative) in kilograms of nutrient per hectare and **(b)**\noverall nutrient use efficiency percentage for the top 10 countries (based on the greatest national nitrogen (N) fertilizer consumption in 2020)\nfor N, elemental phosphorus (P), and elemental potassium (K) for 2020.\n\n\n\neach crop species between studies will result in variation in\nthe estimated N outputs. A summary of existing parameters\nof N content by crop type has shown large divergence among\nstudies (Zhang et al., 2020), and some studies also do not account for the N content in the crop types that have limited\ndata. Taking advantage of existing data, the present study developed and used gap-filled crop product nutrient concentrations, but future research is needed to improve the availability\nand quality of such data.\nNotwithstanding the potential sources of difference in absolute estimates, all previous studies estimated the fastest increase in N surpluses between 1961 and around 1988, a drop\nin N surpluses for a few years, and a subsequent less steep increase until 2020 (Fig. 5c). N use efficiency decreased from\n1961 until around 1988, followed by an increase in N use\nefficiency until 2020. Similar trends over time predicted by\nthe various models in Fig. 5 may be attributed to the fact\n\n\n\nthat many of the models used similar sources of data. For\nexample, 5 of the 10 other models included in Fig. 5 used\nFAOSTAT cropland area data, 8 of the 10 used FAOSTAT\nfertilizer use data and at least 4 of the 10 used FAOSTAT\n\ncrop production data. Many of the models included in Fig. 5\nused similar sources of data; therefore, the variation in the\noverall N balance values will not fully account for the variation and uncertainty in estimates of key parameters. As described in Sect. 2.1, some of the most important parameters for estimating CNB at a country and global level did\nnot have excessively high uncertainty (e.g., cropland area\nCV % of ∼ 25 %, crop production CV % of ∼ 7 % and fertilizer use and crop removal CV % of ∼ 20 %). Parameters\nwith the most uncertainty (e.g., N deposition with a CV %\nof ∼ 70 %) contributed only a small amount to the total N\nbalance ( _<_ 10 kg N ha [−][1] yr [−][1] on average across the world).\nThis highlights the importance of focusing on refining es\n\n\nhttps://doi.org/10.5194/essd-16-525-2024 Earth Syst. Sci. Data, 16, 525–541, 2024\n\n\n536 C. I. Ludemann et al.: A global FAOSTAT reference database of cropland nutrient budgets\n\n\n**Table 6.** Comparison (of mean annual application) of manure nitrogen (N), elemental phosphorus (P) and elemental potassium (K) to\ncropland (in millions of tonnes, Mt) in China for the period from 2005 to 2014 using data from the current study and from Zhang et\nal. (2023).\n\n\n\nK in manure as\n\na % of K applied as manure\nplus SF\n\n\n\nData N manure (Mt) P manure (Mt) K manure (Mt) N in manure as\na % of N applied as manure\nplus SF\n\n\n\nP in manure as\n\na % of P applied as manure\nplus SF\n\n\n\nZhang et al. (2023) 6.9 2.1 4.7 19 % 26 % 31 %\nCurrent study 4.9 1.3 4.3 14 % 19 % 43 %\n\n\n**Figure 5.** Comparisons of global cropland nitrogen **(a)** inputs, **(b)** outputs, **(c)** surplus and **(d)** nitrogen use efficiency for 1961–2020 according to various estimates. Non-FAO data (Zhang et al., 2015; Conant et al., 2013; Lassaletta et al., 2014; Mueller et al., 2012; FAO, 2021;\nBodirsky et al., 2012; Bouwman et al., 2013; Lassaletta et al., 2016; Lu and Tian, 2017; Nishina et al., 2017) were sourced from Zhang et\nal. (2021).\n\n\nEarth Syst. Sci. Data, 16, 525–541, 2024 https://doi.org/10.5194/essd-16-525-2024\n\n\nC. I. Ludemann et al.: A global FAOSTAT reference database of cropland nutrient budgets 537\n\n\n**Figure 6.** Comparison of global cropland phosphorus **(a)** inputs, **(b)** outputs, **(c)** surplus and **(d)** phosphorus use efficiency for 1961–2020\nfrom this study and from Zou et al. (2022).\n\n\n\ntimates of the four most influential parameters used in the\nCNB, namely, cropland areas, crop production quantities,\nfertilizer use and crop nutrient coefficients.\nEstimates of the current study for total N, P and K applied\nas manure in China were generally less than those estimated\nusing farmer survey data across the same period by Zhang\net al. (2023) (Table 6). Consequently, manure N and P as\na percentage of N and P applied as manure plus SF from\nthe current study were less than those estimated by Zhang et\nal. (2023). Manure K as a percentage of K applied as ma\n\n\nnure plus SF from the current study was greater than that\nestimated by Zhang et al. (2023). The scale of the variation\nin values between the two studies shown in Table 6 is not\n\nsurprising given the known uncertainties in the estimates of\nmanure and SF application rates for China (Ludemann et al.,\n2022a). New datasets like those from Zhang et al. (2023) will\nbe evaluated regarding how well they may improve the CNB\nand, when found useful, will be incorporated into future iterations of the FAOSTAT data product.\n\n\n\nhttps://doi.org/10.5194/essd-16-525-2024 Earth Syst. Sci. Data, 16, 525–541, 2024\n\n\n538 C. I. Ludemann et al.: A global FAOSTAT reference database of cropland nutrient budgets\n\n\n\nThe general trends in P inputs, outputs, balances (surpluses\nand deficits) and use efficiencies over time in the present\nstudy were broadly consistent with estimates from Zou et\nal. (2022) (Fig. 6a, b, c and d, respectively). However, P inputs and outputs and the phosphorus use efficiency (PUE) estimated in the current study were generally greater than those\nestimated by Zou et al. (2022). Concurrently, the P surplus\nwas estimated as being less in the current study than in Zou\net al. (2022), and the difference in estimates increased after\n1990 and especially after 2008, when the Zou et al. (2022)\nestimates became substantially greater than our current esti\nmates.\n\nZou et al. (2022) used the same FAO (2022d) areas of\ncropland and fertilizer input values as those used in the current study, indicating that crop P removal is the main contributor with respect to these differences in values. Estimates of the concentration of P in crop products used in the\npresent study were generally greater than those used by Zou\net al. (2022). This explains why crop P removal (outputs) and\nPUE in the present study are greater than those estimated\nby Zou et al. (2022). For example, of the major crops in the\ncurrent study, rice, soybeans and maize had 12 %, 30 % and\n18 % greater P concentrations than those reported in Zou et\nal. (2022). Concentrations of P in wheat and barley in the\ncurrent study were estimated as being 4 % and 2 % less than\nthose used by Zou et al. (2022).\nA reason that the estimates of P inputs by Zou et al. (2022)\nare less than those in the current study is that Zou et al. (2022)\nused a different method to assign the fraction of total fertilizer used in agriculture to cropland. Zou et al. (2022) assumed that the fractions of P fertilizer used for cropland are\nthe same as the fractions of N fertilizer used for cropland,\nfollowing Zhang et al. (2015). In addition, the FAO has updated its fertilizer input data since the Zou et al. (2022) study\nwas published. This may also have contributed to these differences in P inputs.\n\n\n**4** **Code and data availability**\n\n\nThe CNB data presented in this study cover the period\nfrom 1961 to 2020 at the country level, with aggregates\nmade at the regional and global scales. These data are avail[able from https://doi.org/10.5061/dryad.hx3ffbgkh (Lude-](https://doi.org/10.5061/dryad.hx3ffbgkh)\nmann et al., 2023b) and from the FAOSTAT cropland nutrient\n[budget database (https://www.fao.org/faostat/en/#data/ESB,](https://www.fao.org/faostat/en/#data/ESB)\nFAO, 2022a). The R code used to create the tables and figures in this article can be accessed via the following Zenodo\n[repository: https://doi.org/10.5281/zenodo.10491879 (Lude-](https://doi.org/10.5281/zenodo.10491879)\nmann, 2023).\nFurther information on the derivation of cropland fraction estimates for N, including our analytical code,\ncan be accessed via the following Zenodo repository:\n[https://doi.org/10.5281/zenodo.10511851 (Jackson, 2024).](https://doi.org/10.5281/zenodo.10511851)\n\n\n\n**5** **Conclusions**\n\n\nA new reference database of cropland nutrient budgets has\nbeen detailed in this paper. The data are available in FAOSTAT for the time period from 1961 to 2020, with plans\nfor annual updates and continuous methodological improvements. Insights gained from these data include the quantification of the hotspot areas from which there may be a surplus\nor insufficiency of N, P or K nutrients. For example, all world\nregions apart from Oceania and Africa showed some, to substantial, N surpluses until 2020. This is a reflection of the\nbroader trend toward greater SF N use over that period. However, there were P and K deficits for Africa and K deficits for\nthe Americas during the same period. Over time, Europe’s\nrelative importance in terms of the overall contribution to\nN balances was surpassed by Asia (in particular China) in\nthe 1980s. Increasing trends in N surpluses have also been\nshown in other studies, albeit with considerable variation in\nthe absolute values each year due to differences in the model\nsetups and sources of data used. Our estimated trends in the\nNUE over time broadly aligned with other studies, except\nthat our NUE values were generally greater than those from\nother studies. This was a consequence of our estimated N\noutputs being greater than those of other studies. While there\nwas considerable uncertainty (∼ 72 % expressed as a CV)\nassociated with some contributing components to the CNB\ncalculation in the present study, the components with most\nuncertainty generally had the least influence on the overall\nCNB values. The most influential parameters with respect to\nthe estimates of CNB included cropland area, crop production, fertilizer use and crop removal coefficients; therefore,\nthese factors should be prioritized for improved accuracy in\nthe future. It is also important to note that limitations regarding the availability of data could have a substantial effect on\nestimates of overall nutrient balance or nutrient use efficiency\nfor cropland for some countries. This is especially important\nin relation to how nutrients (from fertilizers and manure) are\nassigned to areas of forage and fodder crops and the nutrient\nofftake from these crops as well as in relation to exports of\nmanure from livestock to other countries and manure application to permanent meadows and pastures. Therefore, further refinements will be an ongoing area of development in\nfuture iterations of the FAO CNB.\n\n\n**Supplement.** The supplement related to this article is available\n[online at: https://doi.org/10.5194/essd-16-525-2024-supplement.](https://doi.org/10.5194/essd-16-525-2024-supplement)\n\n\n**Author contributions.** CIL collated the manure and crop nutrient removal coefficients, performed the analysis of data, and wrote\nthe manuscript. NW, GOL and FNT developed the UN FAO crop[land budget (https://www.fao.org/faostat/en/#data/ESB, last access:](https://www.fao.org/faostat/en/#data/ESB)\n5 November 2022), performed the analysis of data and wrote the\nmanuscript. SV analyzed the N deposition data and wrote the N de\n\n\nEarth Syst. Sci. Data, 16, 525–541, 2024 https://doi.org/10.5194/essd-16-525-2024\n\n\nC. I. Ludemann et al.: A global FAOSTAT reference database of cropland nutrient budgets 539\n\n\n\nposition section (Sect. 2.2). RE analyzed the biological N fixation\ndata and wrote the biological N fixation in Sect. 2.2. AG analyzed\nthe fertilizer use data. KJ and XZ analyzed the fraction of N fertilizer applied to cropland data.\nAll authors were part of a UN FAO cropland nutrient budget\nsteering group that determined how the database was developed.\nThey also all edited and approved the final article for submission.\n\n\n**Competing interests.** At least one of the (co-)authors is a member of the editorial board of _Earth System Science Data_ . The peerreview process was guided by an independent editor. Achim Dobermann and Cameron I. Ludemann received financial support from\nthe International Fertilizer Association.\n\n\n**Disclaimer.** Publisher’s note: Copernicus Publications remains\nneutral with regard to jurisdictional claims made in the text, published maps, institutional affiliations, or any other geographical representation in this paper. While Copernicus Publications makes every effort to include appropriate place names, the final responsibility\nlies with the authors. Regarding the maps used in this paper, please\nnote that Figs. 2 and 3 contain disputed territories.\n\n\n**Financial support.** Achim Dobermann and Cameron I. Ludemann received financial support from the International Fertilizer\nAssociation. Luis Lassaletta received funding from the Spanish\nMinistry of Science, Innovation and Universities within the framework of the AgroSceNA-UP project (PID2019-107972RB-I00).\nKevin Jackson received financial support from the Food and Agriculture Organization. Francesco N. Tubiello and Nathan Wanner received funding from the Swiss Federal Office of Agriculture to FAO\nStatistics Division, which made this work possible.\n\n\n**Review statement.** This paper was edited by Zhen Yu and reviewed by Peiyu Cao and one anonymous referee.\n\n\n**References**\n\n\nBodirsky, B. L., Popp, A., Weindl, I., Dietrich, J. P., Rolinski,\nS., Scheiffele, L., Schmitz, C., and Lotze-Campen, H.: N 2 O\nemissions from the global agricultural nitrogen cycle – current state and future scenarios, Biogeosciences, 9, 4169–4197,\n[https://doi.org/10.5194/bg-9-4169-2012, 2012.](https://doi.org/10.5194/bg-9-4169-2012)\nBouwman, A. F., Beusen, A. H. W., Lassaletta, L., van Apeldoorn,\nD. F., van Grinsven, H. J. M., Zhang, J., and Ittersum van,\nM. K.: Lessons from temporal and spatial patterns in global\nuse of N and P fertilizer on cropland, Sci. Rep.-UK, 7, 40366,\n[https://doi.org/10.1038/srep40366, 2017.](https://doi.org/10.1038/srep40366)\nBouwman, L., Klein Goldewijk, K., van der Hoek, K. W., Beusen,\nA. H., van Vuuren, D. P., Willems, J., Rufino, M. C., and Stehfest,\nE.: Exploring global changes in nitrogen and phosphorus cycles\nin agriculture induced by livestock production over the 1900–\n2050 period, P. Natl. Acad. Sci. USA, 110, 20882–20887, 2013.\nCassou, E.: The greening of farm support programs: international experiences with agricul\n\n\ntural subsidy reform, The World Bank, 68,\n[https://documents1.worldbank.org/curated/en/827371554284501](https://documents1.worldbank.org/curated/en/827371554284501204/pdf/The-Greening-of-Farm-Support-Programs-International-Experiences-with-Agricultural-Subsidy-Reform.pdf)\n[204/pdf/The-Greening-of-Farm-Support-Programs-](https://documents1.worldbank.org/curated/en/827371554284501204/pdf/The-Greening-of-Farm-Support-Programs-International-Experiences-with-Agricultural-Subsidy-Reform.pdf)\n[International-Experiences-with-Agricultural-Subsidy-](https://documents1.worldbank.org/curated/en/827371554284501204/pdf/The-Greening-of-Farm-Support-Programs-International-Experiences-with-Agricultural-Subsidy-Reform.pdf)\n[Reform.pdf (last access: 10 October 2023), 2018.](https://documents1.worldbank.org/curated/en/827371554284501204/pdf/The-Greening-of-Farm-Support-Programs-International-Experiences-with-Agricultural-Subsidy-Reform.pdf)\nCobo, J. G., Dercon, G., and Cadisch, G.: Nutrient balances in\nAfrican land use systems across different spatial scales: A review of approaches, challenges and progress, Agricult. Ecosyst.\n[Environ., 136, 1–15, https://doi.org/10.1016/j.agee.2009.11.006,](https://doi.org/10.1016/j.agee.2009.11.006)\n2010.\n\nConant, R. T., Berdanier, A. B., and Grace, P. R.: Patterns and\ntrends in nitrogen use and nitrogen recovery efficiency in\nworld agriculture, Global Biogeochem. Cycles, 27, 558–566,\n[https://doi.org/10.1002/gbc.20053, 2013.](https://doi.org/10.1002/gbc.20053)\nEinarsson, R.: Biological nitrogen fixation in cropland (v1.3), Zen[odo [data set], https://doi.org/10.5281/zenodo.7133340, 2023a.](https://doi.org/10.5281/zenodo.7133340)\nEinarsson, R.: Source code for estimation of cropland\nbiological nitrogen fixation (v1.3), Zenodo [code],\n[https://doi.org/10.5281/zenodo.7133336, 2023b.](https://doi.org/10.5281/zenodo.7133336)\nEinarsson, R., Pitulia, D., and Cederberg, C.: Subnational nutrient budgets to monitor environmental risks in EU agriculture: calculating phosphorus budgets for 243 EU28 regions using public data, Nutrient Cycling in Agroecosystems,\n[https://doi.org/10.1007/s10705-020-10064-y, 2020.](https://doi.org/10.1007/s10705-020-10064-y)\nEinarsson, R., Sanz-Cobeña, A., Aguilera, E., Billen, G., Garnier,\nJ., van Grinsven, H., and Lassaletta, L.: Crop production and\nnitrogen use in European cropland and grassland 1961–2013,\n[Sci. Data, 8, 1–30, https://doi.org/10.1038/s41597-021-01061-z,](https://doi.org/10.1038/s41597-021-01061-z)\n2021.\n\nEU Nitrogen Expert Panel: Nitrogen Use Efficiency (NUE) – an\nindicator for the utilization of nitrogen in agriculture and food\nsystems, Wageningen University, Alterra, PO Box 47, 6700 Wageningen, the Netherlands, 2016.\nFAO: Soil Nutrient Budget. Global, regional and country trends\n1961–2018, FAOSTAT Analytical Brief Series No 20, FAO,\nRome, 13, 2021.\n[FAO: Cropland nutrient budget, https://www.fao.org/faostat/en/](https://www.fao.org/faostat/en/#data/ESB)\n[#data/ESB (last access: 5 November 2022), 2022a.](https://www.fao.org/faostat/en/#data/ESB)\nFAO: Cropland nutrient budget: Gobal, regional and country\ntrends, 1961–2020, FAOSTAT analytical brief no. 52, edited\nby: d’Ortigue, O. L., Gnetti, C., and Gordon, A., FAO, Rome,\n[14, https://www.fao.org/3/cc2904en/cc2904en.pdf (last access:](https://www.fao.org/3/cc2904en/cc2904en.pdf)\n1 December 2022), 2022b.\nFAO: FAOSTAT Domain manure Applied to Soils. Methodolog[ical note, release October 2022, FAO„ Rome, Italy, 5, https:](https://fenixservices.fao.org/faostat/static/documents/GU/GU_e.pdf)\n[//fenixservices.fao.org/faostat/static/documents/GU/GU_e.pdf](https://fenixservices.fao.org/faostat/static/documents/GU/GU_e.pdf)\n(last access: 1 November 2022), 2022c.\nFAO: Land use statistics and indicators. Global, regional and\ncountry trends- 2000–2020. Analytical brief no. 48, FAO,\n[Rome, https://www.fao.org/3/cc0963en/cc0963en.pdf (last ac-](https://www.fao.org/3/cc0963en/cc0963en.pdf)\ncess: 27 March 2023), 15, 2022d.\nFAOSTAT: [https://www.fao.org/faostat/en/#data](https://www.fao.org/faostat/en/#data) (last access:\n10 October 2022), 2022.\nHerridge, D. F., Giller, K. E., Jensen, E. S., and Peoples,\nM. B.: Quantifying country-to-global scale nitrogen fixation\nfor grain legumes II. Coefficients, templates and estimates\nfor soybean, groundnut and pulses, Plant Soil, 474, 1–15,\n[https://doi.org/10.1007/s11104-021-05166-7, 2022.](https://doi.org/10.1007/s11104-021-05166-7)\n\n\n\nhttps://doi.org/10.5194/essd-16-525-2024 Earth Syst. Sci. Data, 16, 525–541, 2024\n\n\n540 C. I. Ludemann et al.: A global FAOSTAT reference database of cropland nutrient budgets\n\n\n\nHurtt, G. C., Chini, L., Sahajpal, R., Frolking, S., Bodirsky,\nB. L., Calvin, K., Doelman, J. C., Fisk, J., Fujimori, S.,\nKlein Goldewijk, K., Hasegawa, T., Havlik, P., Heinimann,\nA., Humpenöder, F., Jungclaus, J., Kaplan, J. O., Kennedy, J.,\nKrisztin, T., Lawrence, D., Lawrence, P., Ma, L., Mertz, O., Pongratz, J., Popp, A., Poulter, B., Riahi, K., Shevliakova, E., Stehfest, E., Thornton, P., Tubiello, F. N., van Vuuren, D. P., and\nZhang, X.: Harmonization of global land use change and management for the period 850–2100 (LUH2) for CMIP6, Geosci.\n[Model Dev., 13, 5425–5464, https://doi.org/10.5194/gmd-13-](https://doi.org/10.5194/gmd-13-5425-2020)\n[5425-2020, 2020.](https://doi.org/10.5194/gmd-13-5425-2020)\nIFA: Fertilizer use by crop and country for the 2017–2018 period,\n45, [https://www.ifastat.org/consumption/fertilizer-use-by-crop](https://www.ifastat.org/consumption/fertilizer-use-by-crop)\n(last access: 1 November 2022), 2022.\nIFASTAT Fertilizer consumption: [https://www.ifastat.org/](https://www.ifastat.org/databases/plant-nutrition)\n[databases/plant-nutrition, last access: 16 February 2022.](https://www.ifastat.org/databases/plant-nutrition)\nIPCC: Chapter 3: Uncertainties, IPCC, 66, [https://www.](https://www.ipcc-nggip.iges.or.jp/public/2006gl/pdf/1_Volume1/V1_3_Ch3_Uncertainties.pdf)\n[ipcc-nggip.iges.or.jp/public/2006gl/pdf/1_Volume1/V1_3_](https://www.ipcc-nggip.iges.or.jp/public/2006gl/pdf/1_Volume1/V1_3_Ch3_Uncertainties.pdf)\n[Ch3_Uncertainties.pdf (last access: 1 September 2023), 2006.](https://www.ipcc-nggip.iges.or.jp/public/2006gl/pdf/1_Volume1/V1_3_Ch3_Uncertainties.pdf)\nJackson, K.: KEJackson-94/Fr_Crop_Estimates: Methods for\nderivation of cropland fraction estimates as used in the FAOSTAT Cropland Nutrient Budget database (v1.0), Zenodo [code],\n[https://doi.org/10.5281/zenodo.10511851, 2024.](https://doi.org/10.5281/zenodo.10511851)\nKremer, A. M.: Methodology and Handbook Eurostat/OECD:\nNutrient Budgets, EU27, Norway and Switzerland, 112,\n[https://ec.europa.eu/eurostat/documents/2393397/2518760/](https://ec.europa.eu/eurostat/documents/2393397/2518760/Nutrient_Budgets_Handbook_%28CPSA_AE_109%29_corrected3.pdf/4a3647de-da73-4d23-b94b-e2b23844dc31)\n[Nutrient_Budgets_Handbook_%28CPSA_AE_109%29_](https://ec.europa.eu/eurostat/documents/2393397/2518760/Nutrient_Budgets_Handbook_%28CPSA_AE_109%29_corrected3.pdf/4a3647de-da73-4d23-b94b-e2b23844dc31)\n[corrected3.pdf/4a3647de-da73-4d23-b94b-e2b23844dc31 (last](https://ec.europa.eu/eurostat/documents/2393397/2518760/Nutrient_Budgets_Handbook_%28CPSA_AE_109%29_corrected3.pdf/4a3647de-da73-4d23-b94b-e2b23844dc31)\naccess: 26 July 2022), 2013.\nLassaletta, L., Billen, G., Grizzetti, B., Juliette, A., and Garnier, J.: 50 year trends in nitrogen use efficiency of world\ncropping systems: The relationship between yield and nitrogen input to cropland, Environ. Res. Lett., 9, 105011,\n[https://doi.org/10.1088/1748-9326/9/10/105011, 2014.](https://doi.org/10.1088/1748-9326/9/10/105011)\nLassaletta, L., Billen, G., Garnier, J., Bouwman, L., Velazquez,\nE., Mueller, N. D., and Gerber, J. S.: Nitrogen use in the\nglobal food system: past trends and future trajectories of\nagronomic performance, pollution, trade, and dietary demand,\n[Environ. Res. Lett., 11, 095007, https://doi.org/10.1088/1748-](https://doi.org/10.1088/1748-9326/11/9/095007)\n[9326/11/9/095007, 2016.](https://doi.org/10.1088/1748-9326/11/9/095007)\nLesschen, J. P., Stoorvogel, J. J., Smaling, E. M. A., Heuvelink, G.\nB. M., and Veldkamp, A.: A spatially explicit methodology to\nquantify soil nutrient balances and their uncertainties at the national level, Nutrient Cycling in Agroecosystems, 78, 111–131,\n[https://doi.org/10.1007/s10705-006-9078-y, 2007.](https://doi.org/10.1007/s10705-006-9078-y)\nLu, C. and Tian, H.: Global nitrogen and phosphorus fertilizer use\nfor agriculture production in the past half century: shifted hot\nspots and nutrient imbalance, Earth Syst. Sci. Data, 9, 181–192,\n[https://doi.org/10.5194/essd-9-181-2017, 2017.](https://doi.org/10.5194/essd-9-181-2017)\nLudemann, C.: ludemannc/fao_cnb: FAO cropland\nnutrient budget analysis (v1.0), Zenodo [code],\n[https://doi.org/10.5281/zenodo.10491880, 2024.](https://doi.org/10.5281/zenodo.10491880)\nLudemann, C. I.: Tier 1 and 2 crop nutrient coefficients, Zenodo\n\n[[code], https://doi.org/10.5281/zenodo.10492448 [code], 2022.](https://doi.org/10.5281/zenodo.10492448)\nLudemann, C. I., Gruere, A., Heffer, P., and Dobermann, A.: Global\ndata on fertilizer use by crop and by country, Sci. Data, 9, 1–8,\n[https://doi.org/10.1038/s41597-022-01592-z 2022a.](https://doi.org/10.1038/s41597-022-01592-z)\nLudemann, C. I., Hijbeek, R., van Loon, M. P., Murrell, T. S.,\nDobermann, A., and van Ittersum, M. K.: Estimating maize\n\n\n\nharvest index and nitrogen concentrations in grain and residue\nusing globally available data, Field Crops Res., 284, 1–25,\n[https://doi.org/10.1016/j.fcr.2022.108578, 2022b.](https://doi.org/10.1016/j.fcr.2022.108578)\nLudemann, C. I., Hijbeek, R., van Loon, M., Murrell, S. T.,\nDobermann, A., and van Ittersum, M. K.: Global data on crop\nnutrient concentration and harvest indices, Dryad [data set],\n[https://doi.org/10.5061/dryad.n2z34tn0x, 2023a.](https://doi.org/10.5061/dryad.n2z34tn0x)\nLudemann, C. I., Wanner, N., Chivenge, P., Dobermann, A., Einarsson, R., Grassini, P., Gruere, A., Jackson, K., Lassaletta, L.,\nMaggi, F., Obli-Laryea, G., van Ittersum, M. K., Vishwakarma,\nS., Zhang, X., and Tubiello, F.: Data from: A global reference\ndatabase in FAOSTAT of cropland nutrient budgets and nutrient\nuse efficiency: Nitrogen, phosphorus and potassium, 1961–2020\n\n[[data set], https://doi.org/10.5061/dryad.hx3ffbgkh, 2023b.](https://doi.org/10.5061/dryad.hx3ffbgkh)\nMueller, N. D., Gerber, J. S., Johnston, M., Ray, D. K., Ramankutty, N., and Foley, J. A.: Closing yield gaps through\nnutrient and water management, Nature, 490, 254–257,\n[https://doi.org/10.1038/nature11420, 2012.](https://doi.org/10.1038/nature11420)\nNishina, K., Ito, A., Hanasaki, N., and Hayashi, S.: Reconstruction\nof spatially detailed global map of NH [+] 4 [and NO] [−] 3 [application]\nin synthetic nitrogen fertilizer, Earth Syst. Sci. Data, 9, 149–162,\n[https://doi.org/10.5194/essd-9-149-2017, 2017.](https://doi.org/10.5194/essd-9-149-2017)\nOenema, O., Kros, H., and de Vries, W.: Approaches and uncertainties in nutrient budgets: implications for nutrient management and environmental policies, Eur. J. Agron., 20, 3–16,\n[https://doi.org/10.1016/S1161-0301(03)00067-4, 2003.](https://doi.org/10.1016/S1161-0301(03)00067-4)\nPathak, H., Mohanty, S., Jain, N., and Bhatia, A.: Nitrogen, phosphorus, and potassium budgets in Indian agriculture, Nutrient Cycling in Agroecosystems, 86, 287–299,\n[https://doi.org/10.1007/s10705-009-9292-5, 2010.](https://doi.org/10.1007/s10705-009-9292-5)\nPeoples, M. B., Giller, K. E., Jensen, E. S., and Herridge,\nD. F.: Quantifying country-to-global scale nitrogen fixation for grain legumes: I. Reliance on nitrogen fixation\nof soybean, groundnut and pulses, Plant Soil, 469, 1–14,\n[https://doi.org/10.1007/s11104-021-05167-6, 2021.](https://doi.org/10.1007/s11104-021-05167-6)\nQuan, Z., Zhang, X., Fang, Y., and Davidson, E. A.: Different quantification approaches for nitrogen use efficiency lead to divergent estimates with varying advantages, Nature Food, 2, 241–\n[245, https://doi.org/10.1038/s43016-021-00263-3, 2021.](https://doi.org/10.1038/s43016-021-00263-3)\nSchils, R., Velthof, G., Mucher, S., Hazeu, G., Oenema, O., de Wit,\nA., and A., S.: Methods to estimate grassland production and bi[ological fixation, Alterra, Wageningen, Netherlands, 77, https://](https://ec.europa.eu/eurostat/documents/2393397/8259002/Grassland_2014_Task+2.pdf/42873c7f-dfdf-49ca-b2ef-7c7b5bcabfc8)\n[ec.europa.eu/eurostat/documents/2393397/8259002/Grassland_](https://ec.europa.eu/eurostat/documents/2393397/8259002/Grassland_2014_Task+2.pdf/42873c7f-dfdf-49ca-b2ef-7c7b5bcabfc8)\n[2014_Task+2.pdf/42873c7f-dfdf-49ca-b2ef-7c7b5bcabfc8 (last](https://ec.europa.eu/eurostat/documents/2393397/8259002/Grassland_2014_Task+2.pdf/42873c7f-dfdf-49ca-b2ef-7c7b5bcabfc8)\naccess: 1 September 2023), 2013.\nSerra, J., Marques-dos-Santos, C., Marinheiro, J., Aguilera, E., Lassaletta, L., Sanz-Cobeña, A., Garnier, J., Billen, G., de Vries, W.,\nDalgaard, T., Hutchings, N., and do Rosário Cameira, M.: Nitrogen inputs by irrigation is a missing link in the agricultural nitrogen cycle and related policies in Europe, Sci. Total Environ., 889,\n[164249, https://doi.org/10.1016/j.scitotenv.2023.164249, 2023.](https://doi.org/10.1016/j.scitotenv.2023.164249)\nShang, Z., Zhou, F., Smith, P., Saikawa, E., Ciais, P., Chang, J., Tian,\nH., Del Grosso, S. J., Ito, A., Chen, M., Wang, Q., Bo, Y., Cui, X.,\nCastaldi, S., Juszczak, R., Kasimir, Å., Magliulo, V., Medinets,\nS., Medinets, V., Rees, R. M., Wohlfahrt, G., and Sabbatini, S.:\nWeakened growth of cropland-N(2) O emissions in China associated with nationwide policy interventions, Glob. Chang. Biol.,\n[25, 3706–3719, https://doi.org/10.1111/gcb.14741, 2019.](https://doi.org/10.1111/gcb.14741)\n\n\n\nEarth Syst. Sci. Data, 16, 525–541, 2024 https://doi.org/10.5194/essd-16-525-2024\n\n\nC. I. Ludemann et al.: A global FAOSTAT reference database of cropland nutrient budgets 541\n\n\n\nSheldrick, W., Keith Syers, J., and Lingard, J.: Contribution of livestock excreta to nutrient balances,\nNutrient Cycling in Agroecosystems, 66, 119–131,\n[https://doi.org/10.1023/A:1023944131188, 2003.](https://doi.org/10.1023/A:1023944131188)\nStatistics Netherlands: Standardised calculation methods for animal\n\nmanure and nutrients: Standard data 1990–2008, 2012.\nTubiello, F. N., Wanner, N., Asprooth, L., Mueller, M., Ignaciuk,\nA., Khan, A. A., and Rosero Moncayo, J.: Measuring progress\ntowards sustainable agriculture. FAO Statistics Working Paper\n[21-24, FAO, Rome, 48, http://www.fao.org/documents/card/en/](http://www.fao.org/documents/card/en/c/cb4549en)\n[c/cb4549en (last access: 11 May 2021), 2021.](http://www.fao.org/documents/card/en/c/cb4549en)\nTubiello, F. N., Conchedda, G., Casse, L., Pengyu, H., Zhongxin,\nC., De Santis, G., Fritz, S., and Muchoney, D.: Measuring the world’s cropland area, Nature Food, 4, 30–32,\n[https://doi.org/10.1038/s43016-022-00667-9, 2023.](https://doi.org/10.1038/s43016-022-00667-9)\nVishwakarma, S., Zhang, X., Dobermann, A., Heffer, P., and\nZhou, F.: Global nitrogen deposition inputs to cropland at\nnational scale from 1961 to 2020, Sci. Data, 10, 488,\n[https://doi.org/10.1038/s41597-023-02385-8, 2023.](https://doi.org/10.1038/s41597-023-02385-8)\nVitousek, P. M., Naylor, R., Crews, T., David, M. B., Drinkwater, L.\nE., Holland, E., Johnes, P. J., Katzenberger, J., Martinelli, L. A.,\nMatson, P. A., Nziguheba, G., Ojima, D., Palm, C. A., Robertson,\nG. P., Sanchez, P. A., Townsend, A. R., and Zhang, F. S.: Nutrient\nImbalances in Agricultural Development, Science, 324, 1519–\n[1520, https://doi.org/10.1126/science.1170261, 2009.](https://doi.org/10.1126/science.1170261)\nWang, Q., Zhou, F., Shang, Z., Ciais, P., Winiwarter, W., Jackson,\nR. B., Tubiello, F. N., Janssens-Maenhout, G., Tian, H., Cui, X.,\nCanadell, J. G., Piao, S., and Tao, S.: Data-driven estimates of\nglobal nitrous oxide emissions from croplands, Nat. Sci. Rev., 7,\n[441–452, https://doi.org/10.1093/nsr/nwz087, 2019.](https://doi.org/10.1093/nsr/nwz087)\nWang, R., Goll, D., Balkanski, Y., Hauglustaine, D., Boucher, O.,\nCiais, P., Janssens, I., Penuelas, J., Guenet, B., Sardans, J., Bopp,\nL., Vuichard, N., Zhou, F., Li, B., Piao, S., Peng, S., Huang, Y.,\nand Tao, S.: Global forest carbon uptake due to nitrogen and\nphosphorus deposition from 1850 to 2100, Glob. Chang. Biol.,\n[23, 4854–4872, https://doi.org/10.1111/gcb.13766, 2017.](https://doi.org/10.1111/gcb.13766)\n\n\n\nWest, P. C., Gerber, J. S., Engstrom, P. M., Mueller, N. D., Brauman,\nK. A., Carlson, K. M., Cassidy, E. S., Johnston, M., MacDonald,\nG. K., Ray, D. K., and Siebert, S.: Leverage points for improving global food security and the environment, Science, 345, 325–\n[328, https://doi.org/10.1126/science.1246067, 2014.](https://doi.org/10.1126/science.1246067)\nZhang, Q., Chu, Y., Yin, Y., Ying, H., Zhang, F., and Cui, Z.: Comprehensive assessment of the utilization of manure in China’s\ncroplands based on national farmer survey data, Sci. Data, 10,\n[223, https://doi.org/10.1038/s41597-023-02154-7, 2023.](https://doi.org/10.1038/s41597-023-02154-7)\nZhang, G. L., Beusen, A. H. W., Van Apeldoorn, D. F.,\nMogollón, J. M., Yu, C., and Bouwman, A. F.: Spatiotemporal patterns of paddy rice croplands in China and India from 2000 to 2015, Sci. Total Environ., 579, 82–92,\n[https://doi.org/10.1016/j.scitotenv.2016.10.223, 2017.](https://doi.org/10.1016/j.scitotenv.2016.10.223)\nZhang, X., Davidson, E., Mauzerall, D., Searchinger, T., Dumas, P.,\nand Shen, Y.: Managing nitrogen for sustainable development,\n[Nature, 528, 51–59, https://doi.org/10.1038/nature15743, 2015.](https://doi.org/10.1038/nature15743)\nZhang, X., Davidson, E. A., Zou, T., Lassaletta, L., Quan, Z.,\nLi, T., and Zhang, W.: Quantifying Nutrient Budgets for Sustainable Nutrient Management, Glob. Biogeochem. Cycles, 34,\n[e2018GB006060, https://doi.org/10.1029/2018gb006060, 2020.](https://doi.org/10.1029/2018gb006060)\nZhang, X., Zou, T., Lassaletta, L., Mueller, N. D., Tubiello, F., Lisk,\nM. D., Lu, C., Conant, R. T., Dorich, C. D., Gerber, J., Tian,\nH., Bruulsema, T., McClellan-Maaz, T., Nishina, K., Leon, B.,\nBodirsky, L. B., Popp, A., Bouwman, L., Beusen, A., Chang, J.,\nHavlík, P., Leclère, D., Canadell, J. G., Jackson, R. B., Billen, G.,\nHeffer, P., Wanner, N., Zhang, W., and Davidson, E. A.: Quantification of global and national nitrogen budgets for crop produc[tion, Nature Food, 2, 529–540, https://doi.org/10.1038/s43016-](https://doi.org/10.1038/s43016-021-00318-5)\n[021-00318-5, 2021.](https://doi.org/10.1038/s43016-021-00318-5)\nZou, T., Zhang, X., and Davidson, E. A.: Global trends of cropland\nphosphorus use and sustainability challenges, Nature, 611, 81–\n[87, https://doi.org/10.1038/s41586-022-05220-z, 2022.](https://doi.org/10.1038/s41586-022-05220-z)\n\n\n\nhttps://doi.org/10.5194/essd-16-525-2024 Earth Syst. Sci. Data, 16, 525–541, 2024\n\n\n",
  "table_data": []
}