{
  "filename": "Impact of potassium management on soil dynamics and crop uptake in rice systems.pdf",
  "processing_timestamp": "2025-07-06T18:30:02.567142",
  "text_extraction": {
    "success": true,
    "character_count": 46431,
    "output_file": "2_processed_data/text_extracts/Impact of potassium management on soil dynamics and crop uptake in rice systems.md"
  },
  "table_extraction": {
    "success": true,
    "table_count": 3,
    "output_file": "2_processed_data/table_data/Impact of potassium management on soil dynamics and crop uptake in rice systems_tables.json",
    "tables_summary": [
      {
        "id": "Impact of potassium management on soil dynamics and crop uptake in rice systems_table_0",
        "shape": [
          12,
          3
        ],
        "accuracy": 98.53221387153422
      },
      {
        "id": "Impact of potassium management on soil dynamics and crop uptake in rice systems_table_1",
        "shape": [
          8,
          6
        ],
        "accuracy": 58.92264883424872
      },
      {
        "id": "Impact of potassium management on soil dynamics and crop uptake in rice systems_table_2",
        "shape": [
          10,
          8
        ],
        "accuracy": 99.55337041925554
      }
    ]
  },
  "quality_metrics": {
    "text_success": true,
    "table_success": true,
    "character_count": 46431,
    "table_count": 3,
    "error_count": 0,
    "processing_completeness": 1.0
  },
  "errors": [],
  "full_text": "OPEN ACCESS\n\n\nEDITED BY\n\nAmit Anil Shahane,\n\nCentral Agricultural University, India\n\n\nREVIEWED BY\n\nPatrice Autfray,\n\nInstitut National de la Recherche\n\nAgronomique (INRA), France\nYaping Ma,\nNingxia University, China\n\n\n*CORRESPONDENCE\n\nSuchismita Mohapatra\n\n[suchi4567@gmail.com](mailto:suchi4567@gmail.com)\n\nKumbha Karna Rout\n\n\n[kkrout42@yahoo.com](mailto:kkrout42@yahoo.com)\nAjay Kumar Mishra\n\n[a.k.mishra@cgiar.org](mailto:a.k.mishra@cgiar.org)\nSheetal Sharma\n\n\n[sheetal.sharma@irri.org](mailto:sheetal.sharma@irri.org)\n\n\nRECEIVED 22 June 2024\n\n\nACCEPTED 12 May 2025\n\nPUBLISHED 04 June 2025\n\n\nCITATION\n\nMohapatra S, Rout KK, Khanda C, Mishra A,\nYadav S, Padbhushan R, Mishra AK and\nSharma S (2025) Impact of potassium\nmanagement on soil dynamics and crop\nuptake in rice systems.\n_Front. Sustain. Food Syst._ 9:1453311.\n[doi: 10.3389/fsufs.2025.1453311](https://doi.org/10.3389/fsufs.2025.1453311)\n\n\nCOPYRIGHT\n\n© 2025 Mohapatra, Rout, Khanda, Mishra,\nYadav, Padbhushan, Mishra and Sharma. This\n\nis an open-access article distributed under\n\n[the terms of the Creative Commons](http://creativecommons.org/licenses/by/4.0/)\n\n[Attribution License (CC BY). The use,](http://creativecommons.org/licenses/by/4.0/)\n\ndistribution or reproduction in other forums is\npermitted, provided the original author(s) and\nthe copyright owner(s) are credited and that\nthe original publication in this journal is cited,\nin accordance with accepted academic\npractice. No use, distribution or reproduction\nis permitted which does not comply with\n\nthese terms.\n\n\n\nTYPE [Original Research](https://www.frontiersin.org/journals/sustainable-food-systems#editorial-board)\n\nPUBLISHED [04 June 2025](https://www.frontiersin.org/journals/sustainable-food-systems#editorial-board)\n\n\nDOI [10.3389/fsufs.2025.1453311](https://doi.org/10.3389/fsufs.2025.1453311)\n\n# Impact of potassium management on soil dynamics and crop uptake in rice systems\n\n\nSuchismita Mohapatra [1] *, Kumbha Karna Rout [2] *,\nChandramani Khanda [2], Amit Mishra [3], Sudhir Yadav [4,5],\nRajeev Padbhushan [6], Ajay Kumar Mishra [7] - and Sheetal Sharma [7] \n\n1 Department of Soil Science & Agricultural Chemistry, Faculty of Agricultural Sciences, Siksha ‘O’\nAnusandhan (DU), Bhubaneswar, India, [2] Orissa University of Agriculture & Technology, Bhubaneswar,\nIndia, [3] School of Natural Resource Management, College of Post Graduate Studies of Agricultural\nSciences, CAU, Imphal, India, [4] International Rice Research Institute, Los Banos, Philippines,\n\n5 Queensland Alliance for Agriculture and Food Innovation(QAAFI), University of Queensland, St Lucia,\nQLD, Australia, [6] Department of Soil Science & Agricultural Chemistry, Bihar Agricultural University,\nBhagalpur, India, [7] International Rice Research Institute, New Delhi, India\n\n\nRice, a staple crop in Asia, is critical for the region’s food security. However, intensive\nrice farming has led to substantial potassium (K) depletion in soils, undermining\nsoil fertility and crop productivity. This study assessed the impact of different K\nmanagement strategies on soil K dynamics, balance, and crop uptake in a puddled,\ntransplanted rice–rice system in Odisha, India, during dry (December–April) and\nwet (June–October) seasons. The experiment involved nine treatments, including\ncombinations of chemical fertilizers, straw application, and foliar spray, arranged\nin a randomized block design (RBD). Grain yield was significantly higher when\napplying chemical fertilizer and foliar spray (3.9 t ha [−][1] in the dry season and 5.4 t ha [−][1]\nin the wet season) compared to the control (2.7 and 4.2 t ha [−][1], respectively).\nHigher levels of exchangeable and reserve K were retained with chemical fertilizer\napplications, while reduced fertilizer doses combined with straw utilized more\nnon-exchangeable K. The dry season exhibited a greater shift in non-exchangeable\nK, indicative of larger soil K depletion. Treatments combining reduced fertilizer\ndoses with straw yielded a positive K balance, in contrast to the negative balance\nobserved with chemical fertilizers alone. Correlation analyses indicated that reserve\nand non-exchangeable K significantly contributed to maintaining available K levels\nin the soil solution, thereby supporting continuous crop K uptake. These findings\nhighlight the necessity of integrating reserve and non-exchangeable K dynamics\ninto nutrient management strategies to ensure sustainable rice production.\n\n\nKEYWORDS\n\n\npotassium management, rice yield, nutrient dynamics, foliar spray, residue\nincorporation, sustainable agriculture\n\n## 1 Introduction\n\n\nRice is an essential crop for global food security, particularly in Asia, where it is a primary\ndietary staple. As one of the leading rice-producing nations, India has approximately 35% of\nits agricultural land for rice cultivation, contributing nearly 40% to the total food grain\nproduction. Despite this significant contribution, rice productivity in India remains suboptimal\ndue to many agronomic and resource-related challenges (Sreekanth et al., 2017; Singh et al.,\n\n2021\n). This disparity necessitates a more sustainable approach to enhancing rice yield while\nensuring soil health and long-term agricultural viability.\n\nPotassium (K), an essential macronutrient, plays a pivotal role in the growth and\nproductivity of rice. It is involved in critical physiological processes such as enzyme activation,\n\n\n\n[Frontiers in Sustainable Food Systems](https://www.frontiersin.org/journals/sustainable-food-systems) 01 [frontiersin.org](https://www.frontiersin.org)\n\n\nMohapatra et al.\b [10.3389/fsufs.2025.1453311](https://doi.org/10.3389/fsufs.2025.1453311)\n\n\n\nosmoregulation, and photosynthesis, directly influencing yield and\nquality. However, intensive rice farming practices, driven by the need\nto meet the demands of a growing population, have led to substantial\ndepletion of soil K reserves, undermining soil fertility. Studies have\nshown that Indian soils are predominantly deficient in potassium, with\napproximately 50% categorized as K-deficient (Srinivasarao et al., 2011;\nSanyal et al., 2014). The reliance on imported potassic fertilizers,\ncoupled with insufficient application rates, exacerbates this issue,\nleading to a negative soil K balance (Kumar et al., 2018). The\nintroduction of high-yielding rice varieties during the Green\nRevolution further intensified nutrient depletion in soils. It is estimated\nthat rice removes approximately 15 kg of nitrogen (N), 4 kg of\nphosphorus (P 2 O 5 ), and 24 kg of K 2 O per ton of grain produced\n(Attanandana et al., 2010). Despite this, the recommended dose of\npotassic fertilizer for wetland rice in India is only 40–60 kg of K 2 O per\nhectare, which is significantly lower than the recommended nitrogen\napplication rates (Saha et al., 2009; Mohapatra et al., 2017). Persistent\nunder application of K fertilizers has led to a negative K balance,\nparticularly in soils subjected to continuous rice cultivation. This\nimbalance not only reduces soil K availability but also affects the uptake\nefficiency of other essential nutrients, thereby limiting crop productivity.\n\nAn emerging challenge in rice production is the depletion of both\nexchangeable and non-exchangeable forms of soil potassium (Das\net al., 2022). Research has indicated that while exchangeable K can\nbe replenished through fertilizer applications, non-exchangeable and\nreserve K contribute significantly to the crop’s nutrient requirements\n(Rao and Srinivas, 2017). Over time, intensive cultivation practices\nhave reduced the soil’s ability to release non-exchangeable K,\nnecessitating alternative management strategies to maintain soil\nfertility (Lalitha and Dhakshinamoorthy, 2014; Alomar and Jena,\n2023). Integrating organic and inorganic nutrient sources has been\nproposed as a sustainable approach to address these challenges. Crop\nresidue incorporation, for instance, not only enhances soil organic\nmatter but also contributes to the slow release of K, thereby improving\nsoil K dynamics. Since 90% of the world’s rice is produced in Asia,\nmanaging rice straw after harvest is crucial to the rice production cycle.\nIn Asia, rice is traditionally harvested by hand, with only a small\namount of straw left in the field, after being cut and carried to a central\nthreshing place for grain and straw separation. Since rice straw was\nregarded as a waste commodity, it was either burned or turned into\nanimal bedding or fodder. However, with the increasing use of combine\nharvesters in the region, large amounts of rice straw are now left in the\nfield. Studies have shown that _in situ_ incorporation of rice straw into\nthe soil enhances nutrient recycling, increases soil organic carbon (C),\nand improves the yields of subsequent crops (Gupta et al., 2007;\nChivenge et al., 2020). Studies have demonstrated that when combined\nwith reduced doses of chemical fertilizers, straw soil application can\nimprove the K balance and maintain soil health (Witt et al., 1999; Hou\net al., 2021). Similarly, foliar application of potassium nitrate has been\nfound to enhance nutrient use efficiency and crop productivity under\nvarious stress conditions (Brar and Brar, 2004; Adhikari et al., 2019).\n\nGiven the critical role of potassium in rice cultivation and the\npressing need for sustainable nutrient management practices, this\nstudy aims to evaluate the effects of different K management strategies\non soil K dynamics, crop uptake, and grain yield in a puddled,\ntransplanted rice–rice cropping system. The experiment, conducted\nin Odisha, India, during dry and wet seasons, included treatments\ncombining chemical fertilizers, straw application, and foliar sprays. By\nanalyzing the contributions of exchangeable, non-exchangeable, and\n\n\n\nreserve K to the overall nutrient supply, this study seeks to provide\ninsights into optimizing potassium management for enhanced\nproductivity and soil health.\n\nThis research addresses key questions relevant to sustainable\nrice farming: How do different potassium management practices\ninfluence soil K dynamics across seasons? What role do\nnon-exchangeable and reserve K play in maintaining soil fertility?\nAnd how can integrated nutrient management approaches\ncontribute to a positive K balance while sustaining high crop\nyields? The findings aim to inform nutrient management strategies\nthat are not only effective but also economically viable and\nenvironmentally sustainable for smallholder rice farmers in India\nand similar agroecological contexts.\n\n## 2 Materials and methods\n\n\n2.1 Experimental site and climate\n\n\nThe field experiment was conducted at the Central Research\nStation of Orissa University of Agriculture and Technology (OUAT),\nBhubaneswar, India (20°15′N, 81°52′E; 25.5 m above sea level), during\nthe dry (December–April) and wet (June–October) seasons. The site\nis in the Eastern and South-Eastern Coastal Plain agroclimatic zone,\ncharacterized by a hot and humid climate. The mean annual rainfall\nis 1,467 mm, approximately 70% occurring between July and\nSeptember. The mean maximum and minimum temperatures are\n33.2°C and 21.4°C, respectively. The soil at the site is sandy loam with\na pH of 5.87, medium organic carbon (0.39%), low nitrogen (alkaline\nKMnO 4 -N: 170 kg ha [−][1] ), high phosphorus (0.5-M NaHCO 3 -P:\n21 kg ha [−][1] ), and low exchangeable potassium (1 N NH 4 OAc-K:\n58 kg ha [−][1] ). Non-exchangeable and reserve potassium was measured\nat 123 and 181 kg ha [−][1], respectively, in the 0–15-cm soil depth. At\n15–30- and 30–45-cm depths, exchangeable potassium was 59 and\n53 kg ha [−][1], respectively, with corresponding increases in\nnon-exchangeable and reserve potassium. As a result of the shallow\nwater table (1 m), the land remains poorly drained during the rainy\nseason but moderately well drained during the summer.\n\n\n2.2 Treatments\n\n\nThe experiment was designed as a randomized block design\n(RBD) with three replications to evaluate nine treatments: T 1 served\nas the control with no potassium application; T 2 involved the\napplication of 40 kg K₂O ha [−][1] ; T 3 involved 60 kg K₂O ha [−][1] ; T 4 included\n80 kg K₂O ha [−][1] ; T 5 combined 20 kg K₂O ha [−][1] with straw (3 t ha [−][1] ); T 6\nused 30 kg K₂O ha [−][1] with straw; T 7 combined 40 kg K₂O ha [−][1] with\nstraw; T 8 incorporated straw alone; and T 9 involved 40 kg K₂O ha [−][1]\ncombined with a 1% KNO₃ foliar spray at the panicle initiation stage.\nThe treatments were categorized broadly into control (T 1 ), fertilizer K\n(T 2, T 3, and T 4 ), fertilizer K with straw (T 5, T 6, and T 7 ), straw only (T 8 ),\nand fertilizer K with foliar spray (T 9 ).\n\n\n2.3 Crop management\n\n\nThe medium-duration (120–125 days) rice variety “Lalat” was used\nin the rice–rice cropping system. The experimental plots measured\n\n\n\n[Frontiers in Sustainable Food Systems](https://www.frontiersin.org/journals/sustainable-food-systems) 02 [frontiersin.org](https://www.frontiersin.org)\n\n\nMohapatra et al.\b [10.3389/fsufs.2025.1453311](https://doi.org/10.3389/fsufs.2025.1453311)\n\n\n\n6 m × 5 m, with seedlings (25 days old) transplanted at a 20 cm × 10 cm\nspacing. Each plot received 30 kg N ha [−][1] (urea), 40 kg P ha [−][1]\n(diammonium phosphate), and 25 kg Zn ha [−][1] (ZnSO₄) at transplanting.\nAn additional 50 kg N ha [−][1] was applied in two splits (2:1 ratio) at 20\nand 50 days after transplanting (DAT). Potassium was applied as\nmuriate of potash (MOP) in two equal splits at basal application and\n50 DAT. Weed management included pretilachlor application\n(500 mL ha [−][1] ) at the initial stage, followed by manual weeding as\nneeded. The pest and disease management included applications of\nSAAF (2 g L [−][1] ), streptocycline (0.15 g L [−][1] ), and Furadan (10 kg acre [−][1] ).\n\n\n2.4 Straw addition and management\n\n\nFor treatments involving straw incorporation, panicles were\nremoved, leaving 5 cm of straw, and the field was allowed to dry before\nincorporation. The straw was mixed into the soil using a power tiller\nto a shallow depth, followed by a second plowing after 15 days to\nenhance decomposition. Approximately 3 t ha [−][1] of straw, contributing\n~45 kg K ha [−][1], was incorporated into designated plots.\n\n\n2.5 Soil sampling and analysis\n\n\nSoil samples were collected from three depths—0–15, 15–30, and\n30–45 cm—at the beginning of the experiment, mid-season at 30 and\n60 DAT, and after harvest. The collected samples were air-dried,\ncrushed, and sieved through a 2-mm mesh before analysis.\nExchangeable potassium was determined using the ammonium\nacetate method (Hanway and Heidel, 1952), while reserve potassium\nwas extracted with nitric acid following the method developed by\nWood and De Turk (1941). Non-exchangeable potassium was\nmeasured using the procedure described by Black (1965). Soil pH\n(Jackson, 1968), nitrogen content using the alkaline KMnO4 (Subbiah\nand Asija, 1956), and phosphorus using the sodium bicarbonate\nextraction method (Page, 1982) were also analyzed.\n\n\n2.6 Plant sampling and analysis\n\n\nPlant samples were collected at maximum tillering, panicle\ninitiation, and harvest stages. Samples were dried (70 ± 5°C), weighed,\nand ground using a Willey mill. Potassium content was analyzed at all\ngrowth stages. Grain and straw samples at harvest were digested using\nHNO 3 –HClO 4 (3:2), diluted with distilled water, and analyzed using a\nflame photometer. Phosphorus content was determined using the\nVanadomolybdate yellow color method, and nitrogen was analyzed\nusing the micro-Kjeldahl method.\n\n\n2.7 Statistical analysis\n\n\nData were analyzed using analysis of variance (ANOVA) (Gomez\nand Gomez, 1984; Panse and Sukhatme, 1961). The least significant\ndifference (LSD) at a 0.05 probability level was used to compare\ntreatment means. Correlation analysis was conducted to evaluate\nrelationships between variables, and figures were prepared using\nGRAPES 1.1.0 (Kerela Agriculture University) (Gopinath et al., 2020).\n\n\n## 3 Results\n\n3.1 Grain yield\n\n\nThe K management practices significantly influenced grain yield\nin both dry (DS) and wet (WS) seasons. In the DS, grain yield ranged\nfrom 2.69 t ha [−][1] in the control (T 1 ) to 3.84 t ha [−][1] in T 9, which\ncombined 40 kg K₂O ha [−][1] with a 1% KNO₃ foliar spray (Table 1).\nTreatments T 3, T 4, and T 6 yielded at par with T 9, while other treatments\nproduced significantly lower yields, and in the WS, grain yield varied\nbetween 4.21 t ha [−][1] in T 1 and 5.35 t ha [−][1] in T 9 . The treatment T 9 was\nat par with T 4, T 6, and T 7 and differed significantly from all\nother treatments.\n\n\n3.2 Plant K uptake\n\n\nPotassium uptake by the crop was lower in the DS than that of the\nWS at all growth stages. Maximum K uptake in the DS occurred\nbetween panicle initiation (PI) and harvest, whereas in the WS, the\nuptake was demonstrated to be higher between maximum tillering\n(MT) and PI (Figure 1). In the DS, K uptake at MT ranged from\n16.1 kg ha [−][1] (T 8 ) to 19.1 kg ha [−][1] (T 9 ), while in the WS, uptake at the\nsame stage ranged from 21.9 kg ha [−][1] (T 8 ) to 30.7 kg ha [−][1] (T 4 ). At\nharvest, total K uptake in the DS varied between 74 kg ha [−][1] (T 1 ) and\n147 kg ha [−][1] (T 4 ), while in the WS, it ranged from 87 kg ha [−][1] (T 1 and\nT 5 ) to 156 kg ha [−][1] (T 4 ).\n\n\n3.3 Exchangeable K\n\n\nExchangeable K levels were generally higher in the DS compared\nto the WS. In the DS, exchangeable K in the surface layer (0–15 cm)\nranged from 68.5 kg ha [−][1] (T 1 ) to 117.8 kg ha [−][1] (T 4 ) at MT, whereas in\nthe WS, it ranged from 42.4 kg ha [−][1] (T 1 ) to 81.7 kg ha [−][1] (T 6 ) at the\n\n\nTABLE 1 Effect of different potassium management practices on rice\ngrain yield during the cropping seasons (dry and wet) in the rice–rice\ncropping system.\n\n|Treatment|Grain yield|Col3|\n|---|---|---|\n|Treatment|Dry season|Wet season|\n|K0|2.7|4.2|\n|K40|3.2|4.3|\n|K60|3.5|4.7|\n|K80|3.4|4.9|\n|K20 + Straw|3.2|4.4|\n|K30 + Straw|3.5|5.2|\n|K40 + Straw|3.1|4.9|\n|Straw|2.8|4.6|\n|K40 + 1% KNO3 spray|3.8|5.4|\n|LSD (0.05)|0.6|0.6|\n\n\n\nT 1 :control (without K application), T 2 :40 kg K 2 O ha [−][1], T 3 :60 kg K 2 O ha [−][1], T 4 :80 kg K 2 O ha [−][1],\nT 5 :20 kg K 2 O ha [−][1] + straw (45 Kg K 2 O ha [−][1] ), T 6 :30 kg K 2 O ha [−][1] + straw, T 7 :40 kg K 2 O\nha [−][1] + straw, T 8 :straw, and T 9 :40 kg K 2 O ha [−][1] + 1% KNO 3 foliar spray at panicle initiation\n(PI) stage.\n\n\n\n[Frontiers in Sustainable Food Systems](https://www.frontiersin.org/journals/sustainable-food-systems) 03 [frontiersin.org](https://www.frontiersin.org)\n\n\nMohapatra et al.\b [10.3389/fsufs.2025.1453311](https://doi.org/10.3389/fsufs.2025.1453311)\n\n\nFIGURE 1\nPotassium uptake and partitioning of K at different growth stages in DS and WS.\n\n\n\nsame stage (Figure 2). In the subsurface layer (15–30 cm),\nexchangeable K in the DS varied from 42.1 kg ha [−][1] (T 1 ) to 78.4 kg ha [−][1]\n(T 4 ), while in the WS, it ranged from 33.1 kg ha [−][1] (T 1 ) to 55.3 kg ha [−][1]\n(T 7 ). At PI in the DS, surface exchangeable K varied from 56.2 kg ha [−][1]\n(T 1 ) to 94.7 kg ha [−][1] (T 4 ), with subsurface values ranging between\n49.9 kg ha [−][1] (T 1 ) and 72.2 kg ha [−][1] (T 4 ). At harvest, exchangeable K in\nthe DS ranged between 47.9 kg ha [−][1] (T 1 ) and 79.6 kg ha [−][1] (T 4 ) in the\nsurface and 48.8 kg ha [−][1] (T 1 ) to 62.5 kg ha [−][1] (T 4 ) in the subsurface. In\nthe WS, exchangeable K at harvest ranged from 35.6 kg ha [−][1] (T 1 ) to\n63.3 kg ha [−][1] (T 3 ) in the surface and 47.1 kg ha [−][1] (T 5 ) to 70.9 kg ha [−][1]\n(T 3 ) in the subsurface.\n\n\n3.4 Non-exchangeable K\n\n\nNon-exchangeable K (NE-K) varied significantly among treatments,\nparticularly in the DS (Figure 3). At MT in the DS, surface NE-K\n(0–15 cm) ranged from 35.5 kg ha [−][1] (T 8 ) to 97.9 kg ha [−][1] (T5), while in\nthe subsurface layer (15–30 cm), NE-K ranged from 74.5 kg ha [−][1] (T 8 ) to\n147.7 kg ha [−][1] (T 5 ). In the WS, surface NE-K ranged from 78.8 kg ha [−][1]\n(T 5 ) to 111.2 kg ha [−][1] (T 2 ), while subsurface values varied between\n68.0 kg ha [−][1] (T 1 ) and 140.5 kg ha [−][1] (T 4 ) (Figure 3). At harvest in the DS,\nsurface NE-K ranged from 83.3 kg ha [−][1] (T9) to 152.4 kg ha [−][1] (T 3 ), while\nsubsurface NE-K varied between 63.6 kg ha [−][1] (T 5 ) and 106.2 kg ha [−][1] (T 3 ).\nIn the WS, surface NE-K at harvest ranged from 164.7 kg ha [−][1] (T 1 ) to\n226.2 kg ha [−][1] (T 4 ), with subsurface values ranging from 130.6 kg ha [−][1]\n(T 8 ) to 149.5 kg ha [−][1] (T 5 ).\n\n\n\n3.5 Reserve K\n\n\nReserve K levels were consistently higher in the DS compared\nto the WS. At MT, reserve K in the DS ranged from 144 kg ha [−][1] (T 1 )\nto 215 kg ha [−][1] (T 4 ) in the surface soil (0–15 cm), while in the\nsubsurface soil (15–30 cm), it ranged from 148 kg ha [−][1] (T 1 ) to\n215 kg ha [−][1] (T 4 ). In the WS, surface reserve K varied from\n124 kg ha [−][1] (T 1 ) to 173 kg ha [−][1] (T 4 ), while in the subsurface layer, it\nranged from 101 kg ha [−][1] (T 1 ) to 186 kg ha [−][1] (T 4 ) (Figure 4). At\nharvest in the DS, reserve K in the surface soil ranged between\n132 kg ha [−][1] (T 1 ) and 232 kg ha [−][1] (T 4 ), while subsurface values\nranged from 156 kg ha [−][1] (T 1 ) to 161 kg ha [−][1] (T 4 ). In the WS, surface\nreserve K at harvest ranged from 200 kg ha [−][1] (T 1 ) to 306 kg ha [−][1]\n(T 4 ), while subsurface values varied from 193 kg ha [−][1] (T 1 ) to\n203 kg ha [−][1] (T 6 ).\n\n\n3.6 Correlation of soil K forms with K\nuptake\n\n\nCorrelation analysis showed significant relationships between\ndifferent forms of soil K and plant K uptake (Figure 5). Total K uptake\nwas significantly correlated with available K at MT (R [2] = 0.63), PI\n(R [2] = 0.49), and harvest (R [2] = 0.50) stages. Reserve K at PI and harvest\nstages also significantly correlated with total K uptake (R [2] = 0.52).\nNon-exchangeable K significantly correlated with K uptake at MT\n(R [2] = 0.43).\n\n\n\n[Frontiers in Sustainable Food Systems](https://www.frontiersin.org/journals/sustainable-food-systems) 04 [frontiersin.org](https://www.frontiersin.org)\n\n\nMohapatra et al.\b [10.3389/fsufs.2025.1453311](https://doi.org/10.3389/fsufs.2025.1453311)\n\n\nFIGURE 2\nExchangeable potassium (kg ha [−][1] ) at different growth stages of rice crop during DS and WS.\n\n\nFIGURE 3\nNon-exchangeable potassium (kg ha [−][1] ) at different growth stages of rice crop during DS and WS.\n\n\n\n3.7 K balance and partitioning of K uptake\n\n\nPotassium balance varied significantly among treatments and\nseasons (Table 2). In the DS, K balance ranged from −103 kg ha [−][1] (T 1 )\nto 53 kg ha [−][1] (T 5 ). In the WS, the K balance varied between\n\n\n\n−87 kg ha [−][1] (T 1 ) and 65 kg ha [−][1] (T 6 ). Annually, the total K balance\nranged from −140 kg ha [−][1] (T 9 ) to 89 kg ha [−][1] (T 7 ). Treatments receiving\nstraw, either alone or in combination with reduced K fertilizer doses,\n\nexhibited positive K balances, whereas treatments with higher K\nfertilizer doses alone showed negative balances.\n\n\n\n[Frontiers in Sustainable Food Systems](https://www.frontiersin.org/journals/sustainable-food-systems) 05 [frontiersin.org](https://www.frontiersin.org)\n\n\nMohapatra et al.\b [10.3389/fsufs.2025.1453311](https://doi.org/10.3389/fsufs.2025.1453311)\n\n\nFIGURE 4\nReserve (kg ha [−][1] ) at different growth stages of rice crop during DS and WS.\n\n\n\nThe partitioning of K uptake differed between seasons (Figure 1).\nIn the WS, 16–18% of total K uptake occurred by MT, 38–44%\nbetween MT and PI, and 40–44% between PI and maturity. In\ncontrast, in the DS, 12–13% of total K uptake occurred by MT, 23–27%\nbetween MT and PI, and 59–64% between PI and maturity. These\nresults highlight the greater reliance on post-PI K uptake in the DS\ncompared to the WS.\n\n## 4 Discussion\n\n\n4.1 Grain yield and K uptake\n\n\nGrain yield and K uptake were significantly influenced by applying\nK through fertilizers, straw incorporation for two seasons, and foliar\nsprays. The study observed higher grain yields in the wet season (WS)\nthan in the dry season (DS), which can be attributed to differences in\nclimatic conditions and water availability, enhancing nutrient uptake\nefficiency during the WS. Fertilizer treatments with higher K doses or\nfertilizers combined with straw generally resulted in higher yields than\ncontrol or straw-only treatments. This aligns with the findings from\nKumar et al. (2018), who emphasized the positive impact of integrated\nnutrient management on rice productivity.\n\nInterestingly, the partitioning of K uptake varied between\nseasons. In the DS, a larger proportion of K uptake occurred postpanicle initiation (PI), with 59–64% of the total K absorbed during\nthis stage, underscoring the importance of late-season K availability.\nConversely, in the WS, K uptake was more evenly distributed across\nthe growth stages, with 38–44% absorbed between maximum tillering\nand PI and 40–44% between PI and maturity. These patterns\ncorroborate earlier studies by Kumbhar and Sonar (1979) and Kalita\n\n\n\n(2020), highlighting the need for season-specific K management to\noptimize crop uptake and yield.\n\n\n4.2 Changes in soil potassium\n\n\nThe study showed that available K (measured as exchangeable K)\nwas consistently higher in the topsoil than in the subsoil across both\nseasons. However, the DS recorded higher available K levels than the\nWS. This can be attributed to greater K release from soil reserves\nduring the DS, possibly due to soil drying and reduced leaching. As\nobserved in other studies, the decline in available K from the MT to\nPI stage in the surface soil reflects active crop uptake (Lalitha and\nDhakshinamoorthy, 2014). The treatments receiving fertilizers\nmaintained higher available K levels than control or straw-only\ntreatments, demonstrating the efficacy of chemical fertilizers in\nreplenishing soil K. The integration of straw with fertilizers also\nmaintained relatively high available K levels, suggesting that straw\ncontributes to the slow release of K over time, consistent with findings\nby Saha et al. (2009). Incorporation of rice straw has also been\nobserved to improve soil pH, soil organic C, and overall nutrient\ncontent as compared to the initial conditions (Thanh et al., 2016).\n\nNon-exchangeable K played a significant role in maintaining K\navailability during crop growth. The conversion of NE-K to exchangeable\nforms was evident in the DS, where NE-K levels declined at harvest. This\nindicates active soil K release to meet crop demands, particularly under\nintensive cropping conditions due to dynamic equilibrium (Wihardjaka\net al., 2022). The higher NE-K levels recorded in the WS at harvest can\nbe attributed to reduced crop uptake and enhanced K retention due to\nhigher soil moisture levels (Venkateshwarlu et al., 2014). The study’s\nfindings underscore the need to consider NE-K dynamics in nutrient\n\n\n\n[Frontiers in Sustainable Food Systems](https://www.frontiersin.org/journals/sustainable-food-systems) 06 [frontiersin.org](https://www.frontiersin.org)\n\n\nMohapatra et al.\b [10.3389/fsufs.2025.1453311](https://doi.org/10.3389/fsufs.2025.1453311)\n\n\nFIGURE 5\n\nCorrelation between soil potassium (K) and plant K uptake.\n\n\n\nmanagement strategies, as this form serves as a critical reservoir for\nreplenishing soil K during periods of high crop demand.\n\nReserve K, the most stable form of soil K, showed seasonal\nfluctuations. In both DS and WS, reserve K declined from MT to PI,\nfollowed by an increase at harvest. This pattern suggests the\nmobilization of reserve K to meet crop needs during critical growth\nstages, followed by replenishment through root turnover and\nmicrobial activity. The higher reserve K levels in the WS than those of\nthe DS may reflect enhanced mineral weathering and nutrient cycling\nunder wet conditions. The study also highlighted that fertilizer-only\ntreatments maintained higher reserve K levels than treatments\ninvolving straw, indicating the effectiveness of chemical fertilizers in\nstabilizing this K pool. However, the combined use of fertilizers and\nstraw demonstrated a balanced approach, maintaining adequate\n\n\n\nreserve K while improving soil organic matter, a critical factor for\nlong-term soil health (Witt et al., 1999; Wang et al., 2023).\n\n\n4.3 K balance\n\n\nThe K balance analysis indicated contrasting trends among\ntreatments. Treatments involving straw incorporation, either alone or\nin combination with reduced K fertilizer doses, exhibited positive K\nbalances, indicating sustainable nutrient management. In contrast,\ntreatments relying solely on chemical fertilizers recorded negative K\nbalances (Mohapatra et al., 2023), highlighting the risk of soil K\ndepletion under intensive farming. These findings are consistent with\nearlier studies by Wihardjaka et al. (1999) and Balik et al. (2019),\n\n\n\n[Frontiers in Sustainable Food Systems](https://www.frontiersin.org/journals/sustainable-food-systems) 07 [frontiersin.org](https://www.frontiersin.org)\n\n\nMohapatra et al.\b [10.3389/fsufs.2025.1453311](https://doi.org/10.3389/fsufs.2025.1453311)\n\n\nTABLE 2 Effect of potassium (K) management practices on K balance during dry and wet seasons in the rice–rice cropping system.\n\n|Treatment|K added (kg ha−1)|Col3|Col4|K removed (kg ha−1)|Col6|Col7|Balance<br>(kg ha−1)|\n|---|---|---|---|---|---|---|---|\n|Treatment|Dry season|Wet season|Total|Dry season|Wet season|Total|Total|\n|K0|30|27|57|74|87|160|−103|\n|K40|70|66|137|100|97|197|−60|\n|K60|90|86|176|117|148|265|−87|\n|K80|110|106|216|147|156|303|−86|\n|K20 + Straw|50|47|97|21|23|44|53|\n|K30 + Straw|60|57|116|24|27|52|65|\n|K40 + Straw|70|67|137|20|28|48|89|\n|Straw|30|26|56|22|23|46|11|\n|K40 + 1% KNO3 spray|72|68|141|139|142|281|−140|\n\n\n\nT 1 :control (without K application), T 2 :40 kg K 2 O ha [−][1], T 3 :60 kg K 2 O ha [−][1], T 4 :80 kg K 2 O ha [−][1], T 5 :20 kg K 2 O ha [−][1] + straw (45 Kg K 2 O ha [−][1] ), T 6 :30 kg K 2 O ha [−][1] + straw, T 7 :40 kg K 2 O ha [−][1] + straw,\nT 8 :straw, and T 9 :40 kg K 2 O ha [−][1] + 1% KNO 3 foliar spray at panicle initiation (PI) stage.\n\n\n\nemphasizing the importance of integrating organic amendments to\noffset nutrient mining.\n\nThe annual K balance ranged from −140 kg ha [−][1] in the treatment\nwith 40 kg K₂O ha [−][1] and foliar spray to +89 kg ha [−][1] in the treatment\ncombining 40 kg K₂O ha [−][1] with straw. This stark contrast underscores\nthe critical role of straw in mitigating K losses and enhancing nutrient\nrecycling. The positive K balance observed with straw-based\ntreatments also aligns with the findings of Chivenge et al. (2020), who\nreported improved nutrient cycling and soil fertility with residue\nincorporation in rice systems. The rice straw also provides a substrate\nto promote biodiversity through the flourishing of invertebrates that\ndecompose the straw, which in turn enhances nutrient cycling in\npaddy soils (Schmidt et al., 2015).\n\n\n4.4 Implications for sustainable nutrient\nmanagement\n\n\nThe results of this study have significant implications for\ndeveloping sustainable nutrient management strategies in rice-based\ncropping systems. First, the findings highlight the need to integrate\ninorganic and organic nutrient sources to optimize soil K dynamics\nand crop productivity. While chemical fertilizers are effective in\nmaintaining high levels of exchangeable and reserve K, the inclusion\nof straw or other organic amendments enhances soil organic matter,\nimproves nutrient cycling, and ensures long-term soil fertility. This\nintegrated approach is particularly relevant for smallholder farmers,\nwho face resource constraints and rely heavily on soil fertility for\nsustained crop production (Adhikari et al., 2019).\n\nSecond, the study underscores the importance of considering\n\nNE-K and reserve K in nutrient recommendations. Current fertilizer\nrecommendations often focus on exchangeable K, overlooking the\ncontributions of these less available forms. Incorporating NE-K and\nreserve K into nutrient management strategies can help maintain soil\nK reserves and ensure a continuous supply of K to crops, particularly\nunder intensive farming conditions.\n\nThird, the seasonal variations in K dynamics observed in this study\nhighlight the need for season-specific nutrient management. In the DS,\nstrategies should focus on enhancing late-season K availability to\nsupport the high demand during the reproductive phase. In the WS, a\n\n\n\nmore balanced approach that ensures steady K availability throughout\nthe growing season may be more effective. Tailoring nutrient\nmanagement practices to seasonal requirements can improve nutrient\nuse efficiency, reduce losses, and contribute to sustainable intensification.\n\nFinally, the positive K balance achieved with straw-based\ntreatments highlights the potential of residue recycling as a costeffective and environmentally friendly alternative to chemical\nfertilizers. Farmers can reduce their dependence on external inputs by\nreturning crop residues to the soil, lowering production costs, and\nmitigating environmental impacts associated with fertilizer use.\nHowever, the study also points to the need for appropriate\nmanagement practices, such as ensuring adequate decomposition of\nstraw before planting, to maximize its benefits.\n\n\n4.5 Future research directions\n\n\nWhile this study provides valuable insights, several areas warrant\nfurther investigation. Long-term studies are needed to assess the\ncumulative effects of different K management strategies on soil health,\ncrop productivity, and environmental sustainability. In addition, research\nshould explore the potential of other organic amendments, such as green\nmanures and composts, to enhance K dynamics and support sustainable\nrice production. The interactions between K and other nutrients, such\nas nitrogen and phosphorus, also merit further study to optimize\nnutrient management in rice-based systems. Finally, there is a need for\nsocioeconomic studies to evaluate the feasibility and adoption of\nintegrated nutrient management practices among smallholder farmers.\n\n## 5 Conclusion\n\n\nThis study highlights the pivotal role of potassium (K) management\nstrategies in maintaining soil K dynamics and sustaining rice productivity\nin a rice–rice cropping system. Integrating inorganic fertilizers with\norganic amendments, such as rice straw, emerges as a viable approach to\nachieving a positive K balance while enhancing soil fertility. Chemical\nfertilizers effectively maintain higher levels of exchangeable and reserve\nK, supporting immediate crop uptake. Conversely, treatments\nincorporating straw with reduced K fertilizer doses contribute to the\n\n\n\n[Frontiers in Sustainable Food Systems](https://www.frontiersin.org/journals/sustainable-food-systems) 08 [frontiersin.org](https://www.frontiersin.org)\n\n\nMohapatra et al.\b [10.3389/fsufs.2025.1453311](https://doi.org/10.3389/fsufs.2025.1453311)\n\n\n\nmobilization of non-exchangeable K, ensuring a steady nutrient supply\nduring critical growth stages. Seasonal variations in K dynamics were\nevident, with the dry season showing greater depletion of soil K reserves,\nnecessitating targeted nutrient management to address this challenge.\nTreatments combining straw and reduced K fertilizer doses demonstrated\na sustainable balance, minimizing nutrient losses and mitigating soil\ndegradation. These findings underscore the importance of including\nnon-exchangeable and reserve K in nutrient management\nrecommendations to ensure long-term soil health and productivity.\nAdopting integrated nutrient management strategies tailored to specific\nseasonal requirements can optimize nutrient use efficiency, reduce\nexternal input dependency, and promote sustainable rice cultivation,\nparticularly for resource-constrained smallholder farmers. Future studies\nshould focus on the long-term implications of such strategies on soil and\ncrop health.\n\n## Data availability statement\n\n\nThe raw data supporting the conclusions of this article will\nbe made available by the authors, without undue reservation.\n\n## Author contributions\n\n\nSM: Formal analysis, Writing – original draft, Writing – review &\nediting, Investigation, Visualization. KR: Conceptualization, Data\ncuration, Validation, Writing – original draft, Supervision. CK: Project\nadministration, Resources, Writing – review & editing. AM:\nSupervision, Validation, Writing – review & editing. SY: Project\nadministration, Resources, Supervision, Writing – review & editing.\nRP: Data curation, Writing – review & editing. AKM: Resources,\nWriting – review & editing. SS: Conceptualization, Funding\nacquisition, Supervision, Writing – review & editing.\n\n## References\n\n\nAdhikari, B., Dhungana, S. K., and Kim, I. D. (2019). Effect of foliar application of\npotassium fertilizers on soybean plants under salinity stress. _J. Saudi Soc. Agric. Sci._ 19,\n[261–269. doi: 10.1016/j.jssas.2019.02.001](https://doi.org/10.1016/j.jssas.2019.02.001)\n\nAlomar, R., and Jena, D. (2023). Potassium and brackish water irrigation influence\nelectrical conductivity, potassium dynamic, and maize yield in coastal saline soil.\n_Commun. Soil Sci. Plant Anal._ [55, 723–734. doi: 10.1080/00103624.2023.2276270](https://doi.org/10.1080/00103624.2023.2276270)\n\n\nAttanandana, T., Kongton, S., Boonsompopphan, B., Polwatana, A., Verapatananirund, P.,\nand Yost, R. (2010). Site-specific nutrient management of irrigated rice in the central plain\nof Thailand. _J. Sustain. Agric._ [34, 258–269. doi: 10.1080/10440041003613297](https://doi.org/10.1080/10440041003613297)\n\n\nBalik, J., Cerny, J., Kulhanek, M., Sedlar, O., and Suran, P. (2019). Balance of potassium\nin two long-term field experiments with different fertilization treatments. _Plant Soil_\n_Environ._ [65, 225–232. doi: 10.17221/109/2019-PSE](https://doi.org/10.17221/109/2019-PSE)\n\n\nBlack, C. A. (1965). _Methods of Soil Analysis. Part-II_ . Madison, WI: America Society\nof Agronomy.\n\n\nBrar, M. S., and Brar, A. S. (2004). Foliar nutrition as a supplement to soil fertilizer\napplication to increase yield of upland cotton ( _Gossypium hirsutum_ ). _Indian J. Agric. Sci._\n74, 472–475.\n\nChivenge, P., Rubianes, F., Van Chin, D., Van Thach, T., Khang, V. T., Romasanta, R.,\net al. (2020). Rice straw incorporation influences nutrient cycling and soil organic\nmatter. _Sustainable rice straw management_, 131–144.\n\n\nDas, D., Sahoo, J., Raza, M. B., et al. (2022). Ongoing soil potassium depletion under\nintensive cropping in India and probable mitigation strategies. A review. _Agron. Sustain._\n_Dev._ [42:4. doi: 10.1007/s13593-021-00728-6](https://doi.org/10.1007/s13593-021-00728-6)\n\n\nGomez, K. A., and Gomez, A. A. (1984). Statistical procedures for agricultural\nresearch. New York: John Wiley and Sons Inc.\n\n\n## Funding\n\nThe author(s) declare that no financial support was received for\nthe research and/or publication of this article.\n\n## Acknowledgments\n\n\nWe acknowledge financial support from the United States Agency\nfor International Development (USAID) and the Bill & Melinda Gates\nFoundation (BMGF)-funded Cereal Systems Initiative for South Asia\n(CSISA) project through the International Rice Research Institute\n(IRRI) and the Odisha University of Agriculture and\nTechnology (OUAT).\n\n## Conflict of interest\n\n\nThe authors declare that the research was conducted in the\nabsence of any commercial or financial relationships that could\nbe construed as a potential conflict of interest.\n\nThe author(s) declared that they were an editorial board member\nof Frontiers, at the time of submission. This had no impact on the peer\nreview process and the final decision.\n\n## Publisher’s note\n\n\nAll claims expressed in this article are solely those of the\nauthors and do not necessarily represent those of their affiliated\norganizations, or those of the publisher, the editors and the\nreviewers. Any product that may be evaluated in this article, or\nclaim that may be made by its manufacturer, is not guaranteed or\nendorsed by the publisher.\n\n\nGopinath, P. P., Parsad, R, Joseph, B, and Adarsh, V. S. (2020). GRAPES: General\n[Rshiny Based Analysis Platform Empowered by Statistics. doi: 10.5281/zenodo.4923220](https://doi.org/10.5281/zenodo.4923220)\n\n\nGupta, R., Ladha, J., Singh, J., Singh, G., and Pathak, H. (2007). Yield and phosphorus\ntransformations in a rice–wheat system with crop residue and phosphorus management.\n_Soil Sci. Soc. Am. J._ [71, 1500–1507. doi: 10.2136/sssaj2006.0325](https://doi.org/10.2136/sssaj2006.0325)\n\n\nHanway, J., and Heidel, H. (1952). Soil analysis methods as used in Iowa state college\nsoil testing laboratory. _Iowa State Coll. Agric. Bull._ 57, 1–3.\n\nHou, Y., Xu, X., Kong, L., Zhang, L., and Wang, L. (2021). The combination of straw\nreturn and appropriate K fertilizer amounts enhances both soil health and rice yield in\nNortheast China. _Agron. J._ [113, 5424–5435. doi: 10.1002/agj2.20805](https://doi.org/10.1002/agj2.20805)\n\nJackson, M. L. (1968). Chemical soil analyses. Englewood Cliffs, NJ: Prentice Hall,\nInc., 64.\n\n\nKalita, R. (2020). Department of Agronomy (Doctoral dissertation, Assam\nAgricultural University Jorhat).\n\n\nKumar, S. I., Gulati, J., Yadav, S. R., Yadav, R. S., Moharana, P. C., Meena, R. L., et al.\n(2018). Impact of low potassium fertilization on potassium transformation under\ndifferent crop management systems in western plain of arid India. _J. Plant Nutr._ 41,\n[411–424. doi: 10.1080/01904167.2017.1381121](https://doi.org/10.1080/01904167.2017.1381121)\n\n\nKumbhar, D. D., and Sonar, K. R. (1979). Performance of rice varieties grown under\nupland conditions. _Jour Ind Soil Sc._ 28, 178–183.\n\n\nLalitha, M., and Dhakshinamoorthy, M. (2014). Forms of soil potassium-a review.\n_Agri. Rev._ [35, 64–68. doi: 10.5958/j.0976-0741.35.1.008](https://doi.org/10.5958/j.0976-0741.35.1.008)\n\n\nMohapatra, S., Rout, K. K., Khanda, C., Mishra, A., Yadav, S., Padbhushan, R., et al.\n(2023). Evaluation of different potassium management options under prevailing dry and\n\n\n\n[Frontiers in Sustainable Food Systems](https://www.frontiersin.org/journals/sustainable-food-systems) 09 [frontiersin.org](https://www.frontiersin.org)\n\n\nMohapatra et al.\b [10.3389/fsufs.2025.1453311](https://doi.org/10.3389/fsufs.2025.1453311)\n\n\n\nwet seasons in puddled, transplanted rice. _Sustainability_ 15:5819. doi:\n[10.3390/su15075819](https://doi.org/10.3390/su15075819)\n\n\nMohapatra, S., Rout, K. K., Khanda, C. M., Mukherjee, S. K., Mishra, A.,\nMahapatra, S. S., et al. (2017). Role of potassium on insect pests and diseases of puddled\ntransplanted rice cv. Lalat in Odisha. _ORYZA-An Int. J. Rice_ 54:314. doi:\n[10.5958/2249-5266.2017.00043.1](https://doi.org/10.5958/2249-5266.2017.00043.1)\n\n\nPage, A. I. (1982). Methods of soil analysis, part 2. Chemical and microbial properties.\nMadison WI, USA: Amer Soc Agron, 621–622.\n\n\nPanse, V. G., and Sukhatme, P. V. (1961). Statistical methods for agricultural workers.\n_2nd_ Edn. New Delhi, India: Indian Council of Agricultural Research.\n\n\nRao, C. S., and Srinivas, K. (2017). Potassium dynamics and role of non-exchangeable\npotassium in crop nutrition. _Indian J. Fertil._ 13, 80–94.\n\n\nSaha, P. K., Miah, M. A. M., Hossain, A. T. M. S., Rahman, F., and Saleque, M. A.\n(2009). Contribution of rice straw to potassium supply in rice-fallow-rice cropping\npattern. _Bangladesh J. Agril. Res._ [34, 633–643. doi: 10.3329/bjar.v34i4.5839](https://doi.org/10.3329/bjar.v34i4.5839)\n\n\nSanyal, S. K., Majumdar, K., and Singh, V. K. (2014). Nutrient management in Indian\nagriculture with special reference to nutrient mining—A relook. _J. Indian Soc. Soil Sci._\n62, 307–325.\n\n\nSchmidt, A., Auge, H., Brandl, R., Heong, K. L., Hotes, S., Settele, J., et al.\n(2015). Small-scale variability in the contribution of invertebrates to litter decomposition\nin tropical rice fields. _Basic Appl Ecol._ [16, 674–680. doi: 10.1016/j.baae.2015.01.006](https://doi.org/10.1016/j.baae.2015.01.006)\n\n\nSingh, K. M., Ahmad, N., Pandey, V. V., Kumari, T., and Singh, R. (2021). Growth\nperformance and profitability of Rice production in India: An assertive analysis. _Econ._\n_Aff._ [66, 481–486. doi: 10.46852/0424-2513.3.2021.18](https://doi.org/10.46852/0424-2513.3.2021.18)\n\n\nSreekanth, M., Hakeem, A. H., Peer, Q. J. A., and Rashid, I. (2017). Low productivity\nof Indian agriculture with special reference on cereals. _J. Pharmacogn. Phytochem._ 6,\n239–243.\n\n\n\nSrinivasarao, C., Satyanarayana, T., and Venkateswarlu, D. B. (2011). Potassium\nmining in Indian agriculture: input and output balance. _Karnataka J Agric Sci._ 24, 20–28.\n\n\nSubbiah, B. V., and Asija, G. L. (1956). A rapid procedure for the determination of\navailable nitrogen in soils. _Curr. Sci._ 25, 259–260.\n\nThanh, N. D., Hoa, H. T. T., Hung, H. C., Nhi, P. T. P., and Thuc, D. D. (2016). Effect\nof fertilizer on rice yield improvement in coastal sandy soil of Thua Thien hue province.\n_Hue Univ. J. Sci. Agric. Rural Dev._ 119.\n\n\nVenkateshwarlu, M., Ghosh, S. K., Patra, P. K., Pal, B., and Reddy, G. K. (2014). To\nstudy the effect of fertilizer and organic manure on dynamic changes of K under\ncropping sequence. _Int. J. Appl. Biol. Pharm. Technol._ 9, 2573–2582. doi:\n[10.20546/ijcmas.2020.905.294](https://doi.org/10.20546/ijcmas.2020.905.294)\n\n\nWang, Y., Liang, A., Bao, H., Chen, Q., Cao, Y., He, Y., et al. (2023). Potential of crop\nstraw incorporation for replacing chemical fertilizer and reducing nutrient loss in\nSichuan province. _China._ _Environ._ _Pollution._ 320:121034. doi:\n[10.1016/j.envpol.2023.121034](https://doi.org/10.1016/j.envpol.2023.121034)\n\nWihardjaka, A., Harsanti, E. S., and Ardiwinata, A. N. (2022). Effect of fertilizer\nmanagement on potassium dynamics and yield of rainfed lowland rice in Indonesia.\n_Chilean J. Agric. Res_ . 82, 33–34.\n\n\nWihardjaka, A., Kirk, G. J. D., Abdulrachman, S., and Mamaril, C. P. (1999). Potassium\nbalances in rainfed lowland rice on a light-textured soil. _Field Crop Res._ 64, 237–247. doi:\n[10.1016/S0378-4290(99)00045-3](https://doi.org/10.1016/S0378-4290(99)00045-3)\n\n\nWitt, C., Dobermann, A., Abdulrachman, S., Gines, H. C., Wang, G., Nagarajan, R.,\net al. (1999). Internal nutrient efficiencies of irrigated lowland rice in tropical\nand subtropical Asia. _Field_ _Crop_ _Res._ 63, 113–138. doi:\n[10.1016/S0378-4290(99)00031-3](https://doi.org/10.1016/S0378-4290(99)00031-3)\n\nWood, L. R., and De Turk, E. E. (1941). The absorption of pot in soils in nonreplaceable forms, _Soil science Society of America Proceedings_, 5, 152–161.\n\n\n\n[Frontiers in Sustainable Food Systems](https://www.frontiersin.org/journals/sustainable-food-systems) 10 [frontiersin.org](https://www.frontiersin.org)\n\n\n",
  "table_data": [
    {
      "table_id": "Impact of potassium management on soil dynamics and crop uptake in rice systems_table_0",
      "page": 3,
      "accuracy": 98.53221387153422,
      "data": [
        {
          "0": "Treatment\nGrain yield\nDry season\nWet season",
          "1": "",
          "2": ""
        },
        {
          "0": "",
          "1": "",
          "2": ""
        },
        {
          "0": "K0",
          "1": "2.7",
          "2": "4.2"
        },
        {
          "0": "K40",
          "1": "3.2",
          "2": "4.3"
        },
        {
          "0": "K60",
          "1": "3.5",
          "2": "4.7"
        },
        {
          "0": "K80",
          "1": "3.4",
          "2": "4.9"
        },
        {
          "0": "K20 + Straw",
          "1": "3.2",
          "2": "4.4"
        },
        {
          "0": "K30 + Straw",
          "1": "3.5",
          "2": "5.2"
        },
        {
          "0": "K40 + Straw",
          "1": "3.1",
          "2": "4.9"
        },
        {
          "0": "Straw",
          "1": "2.8",
          "2": "4.6"
        },
        {
          "0": "K40 + 1% KNO3 spray",
          "1": "3.8",
          "2": "5.4"
        },
        {
          "0": "LSD (0.05)",
          "1": "0.6",
          "2": "0.6"
        }
      ],
      "shape": [
        12,
        3
      ]
    },
    {
      "table_id": "Impact of potassium management on soil dynamics and crop uptake in rice systems_table_1",
      "page": 7,
      "accuracy": 58.92264883424872,
      "data": [
        {
          "0": "FIGURE 5\nCorrelation between soil potassium (K) and plant K uptake.",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": ""
        }
      ],
      "shape": [
        8,
        6
      ]
    },
    {
      "table_id": "Impact of potassium management on soil dynamics and crop uptake in rice systems_table_2",
      "page": 8,
      "accuracy": 99.55337041925554,
      "data": [
        {
          "0": "Treatment\nK added (kg ha−1)\nK removed (kg ha−1)\nBalance \n(kg ha−1)\nDry season\nWet season\nTotal\nDry season\nWet season\nTotal",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": "",
          "6": "",
          "7": ""
        },
        {
          "0": "K0",
          "1": "30",
          "2": "27",
          "3": "57",
          "4": "74",
          "5": "87",
          "6": "160",
          "7": "−103"
        },
        {
          "0": "K40",
          "1": "70",
          "2": "66",
          "3": "137",
          "4": "100",
          "5": "97",
          "6": "197",
          "7": "−60"
        },
        {
          "0": "K60",
          "1": "90",
          "2": "86",
          "3": "176",
          "4": "117",
          "5": "148",
          "6": "265",
          "7": "−87"
        },
        {
          "0": "K80",
          "1": "110",
          "2": "106",
          "3": "216",
          "4": "147",
          "5": "156",
          "6": "303",
          "7": "−86"
        },
        {
          "0": "K20 + Straw",
          "1": "50",
          "2": "47",
          "3": "97",
          "4": "21",
          "5": "23",
          "6": "44",
          "7": "53"
        },
        {
          "0": "K30 + Straw",
          "1": "60",
          "2": "57",
          "3": "116",
          "4": "24",
          "5": "27",
          "6": "52",
          "7": "65"
        },
        {
          "0": "K40 + Straw",
          "1": "70",
          "2": "67",
          "3": "137",
          "4": "20",
          "5": "28",
          "6": "48",
          "7": "89"
        },
        {
          "0": "Straw",
          "1": "30",
          "2": "26",
          "3": "56",
          "4": "22",
          "5": "23",
          "6": "46",
          "7": "11"
        },
        {
          "0": "K40 + 1% KNO3 spray",
          "1": "72",
          "2": "68",
          "3": "141",
          "4": "139",
          "5": "142",
          "6": "281",
          "7": "−140"
        }
      ],
      "shape": [
        10,
        8
      ]
    }
  ]
}