{
  "filename": "Interannual dynamics of available potassium in a long-term fertilization experiment.pdf",
  "processing_timestamp": "2025-07-06T18:30:15.553355",
  "text_extraction": {
    "success": true,
    "character_count": 36892,
    "output_file": "2_processed_data/text_extracts/Interannual dynamics of available potassium in a long-term fertilization experiment.md"
  },
  "table_extraction": {
    "success": true,
    "table_count": 1,
    "output_file": "2_processed_data/table_data/Interannual dynamics of available potassium in a long-term fertilization experiment_tables.json",
    "tables_summary": [
      {
        "id": "Interannual dynamics of available potassium in a long-term fertilization experiment_table_0",
        "shape": [
          1,
          2
        ],
        "accuracy": 0
      }
    ]
  },
  "quality_metrics": {
    "text_success": true,
    "table_success": true,
    "character_count": 36892,
    "table_count": 1,
    "error_count": 0,
    "processing_completeness": 1.0
  },
  "errors": [],
  "full_text": "# **Interannual dynamics of available potassium in a long-term** **fertilization experiment**\n\n**M. Madaras, J. Lipavský**\n\n\n_Crop Research Institute, Prague, Czech Republic_\n\n\n**Abstract**\n\n\nDynamics of the plant-available potassium (K) has been studied in polyfactorial long-term fertilization experiments\nsince 1980. The fertilization scheme includes 10 combinations of K muriate and farmyard manure application rates\n(annually 0–230 kg K/ha). At medium treatment (annually 153 kg K/ha), the K balance within an 8-year crop rotation reflected crop specific K application rates with positive annual balances in years of growing silage maize and\nsugar beet (high K input), and negative in two years of growing alfalfa. Available K clearly corresponded to the dynamics of the K balance, with statistically significant fluctuations from 88 to 149 mg K/kg within one crop rotation\ncycle. Periodic fluctuations of available K induced by crop rotation were observed also in non-fertilized treatments.\nThe variability of available K contents was influenced primarily by crop plants and experimental unexplained factors; interannual weather fluctuations and field differences were of low significance. In the paper, the importance of\ninterannual K dynamics for the construction of correct long-term time trends is shown and discussed.\n\n\n**Keywords** : long-term experiments; potassium; soil; nutrient balance; crop rotation\n\n\n\nLong-term fertilization experiments provide\nan opportunity for experimentation in which the\neffects of manipulation may be separated from\nother variables (Southwood 1994). The value\nof long-term trials, even though nowadays it is\nquestioned, is irreplaceable – the long-term trials are the basic platform for examination and\nquantification of cultivation-based changes in\nagro-ecosystems and enable the evaluation of the\neffects of long-term different intensity of fertilization on nutrient dynamics (Merbach and Deubel\n2008). In many European countries, the oldest\nlong-term experiments are still being maintained\nand provide essential information for agriculture\nand environmental science.\n\n\nIn the Czech Republic, most of the long-term\nfield experiments had been founded and maintained\nby the Crop Research Institute (CRI), Prague. The\noldest trials were established in 1955 in PragueRuzyně. The trials were maintained at twelve sites\ndiffering in soil and climatic conditions. The main\nexperimental factors investigated were crop nutrition, crop rotation, cultivation technologies and\norganic manuring (for an overview see Lipavský\net al. 2005).\n\n\n\nAn important question that can be answered with\nthe help of long-term trials is the one concerning\nthe long-term effects of contemporary K management. Fertilizer and manure application rates and\ntiming are based on the optimal nitrogen rate and\nnot on K requirements (Oborn et al. 2005). In addition, changes in the structure and financing of\nthe agronomic sector in the Czech Republic that\noccurred after 1989, accompanied with continuous\nincrease of input costs led to a dramatic drop in\nthe use of K mineral fertilizers. The actual average\nannual application rate is 8 kg/ha of mineral K\nand 17 kg K in manures (Anonymous 2007), that\nis only 15% of the application rate before 1989.\nIn this type of management, K balance becomes\nhighly negative – outputs are higher than inputs\nand K is released from internal soil sources.\n\n\nThe issue of sustainable soil K management was\npartly ignored during the last few decades while\nthe potential environmental impact of agricultural\nuse of nitrogen and phosphorus was considered a\nmore important problem (Simonsson et al. 2007).\nFrom this viewpoint, trial plots with low or zero\nK inputs are of special interest within long-term\nK fertilization trials. They can provide essential\n\n\n\nSupported by the Ministry of Agriculture of the Czech Republic, Project No. MZE 0002700604.\n\n\n**334** Plant Soil Environ., _55_, 2009 (8): 334–343\n\n\nTable 1. Independent experimental factors investigated within the polyfactorial field experiments\n\n\nFactor\n\nYears\n\n1 2 3 4 5 6\n\n\n1980–1984 N before sowing N during vegetation P FYM K stand density\n\n\n1985–1995 N lime P FYM K stand density\n\n\n1995–present N lime P FYM K Mg\n\n\nDifferent application rates of: N – nitrogen; P – phosphorus; FYM – farmyard manure; K – potassium;\nMg – magnesium; stand density – number of plants/seeds per hectare\n\n\n\ninformation about the effects of our present common agricultural practices and their possible future\nimpacts on soil quality.\n\nIn this paper we evaluate selected data from\npolyfactorial field experiments, established in 1980\nat CRI. Until now, large datasets taken within the\nexperiments were only processed partially and no\ncomprehensive works have been published. In this\narticle we evaluate K inputs/outputs and plantavailable K data as a base for analysis of long-term\ntrends. The aim of the article is to evaluate the\n\ndynamics of available K and discuss its importance\nas related to the construction of correct time trends\n\nin cases of timely non-regular soil sampling.\n\n\n**Material and methods**\n\n\nPolyfactorial field experiments were originally\nestablished at 9 sites representing different pedo\n\n\nand climasequences of the arable soils in the Czech\nRepublic. For each experiment, a central scheme\nof the second order design in incomplete blocks\nwas used, according to Cochran and Cox (1957).\nAt each site the trial consisted of four fields, each\nconsisting of 56 plots of 5 × 12 m, designed in 4\nrows. Within the scheme, the influence of 6 independent factors was tested. Some factors were\naltered during the experiment (Table 1).\n\nFive levels corresponding to each factor were\nset up in a manner that medium level reflected\nstandard agricultural cropping practice, specific\nfor each crop-plant, and the highest level was\nsupposed to limit plant growth by the excess of\nthe nutrient (or by very high stand density). Zero\nlevel means no use of the fertilizer, except in the\ncase of stand density where some low density was\nchosen. Between the medium and extreme levels,\ntwo other levels (higher, lower) were set up, of\nwhich the ‘higher’ was supposed to be optimal or\n\n\n\nTable 2. Crop rotation in experiments and application rates (factor levels) for crop-plants. For farmyard manure\n(FYM) and potassium (K), factor levels are shown in order minimum/lower/medium/higher/excess level. For\nlime, phosphorus (P), magnesium (Mg) and denstity of crop-plants, only medium levels are shown\n\n\n\nYear Crop–plant\n\n\n\nN [$] Lime* P FYM\n(10 [3] kg/ha)\n\n\n\n(kg/ha) (10 kg/ha) (kg/ha) seeds/ha\n\n\n\nK Mg Stand density\n\n\n\n1 clover + oat/alfalfa + oat 40 1750 60 – 0/60/100/140/200 40 16 kg\n\n\n2 clover/alfalfa – – – – – – –\n\n\n3 winter wheat 100 1750 40 – 0/40/70/100/140 40 4.5.10 [6]\n\n\n4 silage maize 175 1750 50 0/20/40/60/80 0/85/150/215/300 40 8.10 [4]\n\n\n5 winter wheat 125 1750 40 – 0/40/70/100/140 40 4.5.10 [6]\n\n\n6 spring barley 90 1750 40 – 0/30/50/70/100 40 4.5.10 [6]\n\n\n7 potato/sugar beet 150 1750 50 0/20/40/60/80 0/85/150/215/300 40 8.5.10 [4]\n\n\n8 spring barley 60 1750 40 – 0/30/50/70/100 40 4.5.10 [6]\n\n\n$ total for all applications; *liming each second year, after 1995 only if necessary, using amelioration dose to reach\nneutral soil reaction; – factor not used; depending on climatic conditions of the site\n\n\nPlant Soil Environ., _55_, 2009 (8): 334–343 **335**\n\n\nclose-to-optimal in order to satisfy crop demands\nand reach maximum yield. The influence of the\nfactors was investigated in 8-year crop rotation\n(Table 2), including 50% of cereals, potato/sugar\nbeet, silage maize and clover/alfalfa (depending\non the climate conditions of the site). In fields,\nrotation was phased in 2-year shifts.\n\nWithin trials at given sites each field originally\nconsisted of 47 different treatments. 10 plots had\nthe same treatment with all factors at medium level.\n\nThis set of 10 equally treated plots was used for the\ncalculation of variability parameters because all\nother treatments were not replicated within a given\nfield. 32 treatments had different combinations of\n\n‘higher’ and ‘lower’ levels, 12 treatments had all\nfactors at medium level and always had one of the\nfactors at ‘zero’ or ‘excess’ level. One treatment\n\nhad all factors at zero level (i.e. ‘not treated’) and\nthe last treatment had all factors at zero level and\nthe 6 [th] factor at the ‘excess’ level. This treatment\n\nwas changed to ‘not treated’ after 1995.\n\nThis set of treatments was the same for all four\n\nfields, which differed only in the distribution of\ntreatments within the field. It means that the ma\njority of treatments were replicated four times.\n\nN fertilizers were used in the form of ammonium\n\nnitrate or ammonium sulphate; P as super-phosphate; K as K muriate and Mg in the form of Mg\nsulphate.\n\nAfter harvest (except in the second year of alfalfa/clover), soil samples (consisting of 5–8 subsamples within the plot) of plough horizon (depth\nof 0–20 cm) were taken and analyzed for soil reaction, organic carbon content, total nitrogen and\navailable nutrients (P, K, Ca, Mg). Plant material\n\n\n\nfrom each harvest was analyzed for total content\nof N, P, K, Ca and Mg after wet combustion.\n\nThe consistency of the experiments was disturbed\nby several factors, mostly connected with financial\nissues following 1989. The main changes were: the\ntermination of 4 experimental sites, changes in\nthe crop rotation at some fields and a reduction\nof soil sampling.\n\nThe analytical method of available K determination was also changed. The formerly used method\nof ammonium acetate/oxalate extraction (according to Schachtschabel, in Hraško et al. 1962) was\nreplaced by Mehlich II/III extraction. In this case\ndata were transformed back to Schachtschabel\n\naccording to the equations below.\n\n\nK Sch = 0.8187 × K M II + 3.94;\n\n\nK = 0.712 × K + 9.96.\nSch M III\n\n\nThese equations were derived from analyses\nof a large number of soil samples (based on data\npublished by the Central Institute for Supervising\nand Testing in Agriculture, Trávník 2008). K balances were calculated as the difference between\n\nK input (in farmyard manure and mineral K) and\nK output by harvested plant material. K leaching\nand atmospherical deposition were not taken into\n\naccount.\n\n\nData presented and discussed originate from\nthe experiment at Hněvčeves. Data from Kostelec,\nHumpolec and Pernolec are shown in a lesser extent, with the aim to demonstrate the differences\namong the experiments at different sites.\n\n\n\nTable 3. Basic description of experimental sites and soils. Soil reaction (pH, in 1M KCl solution), organic carbon\ncontent (C ox ) and available nutrients (P – Egner; K – Schachschabel) before beginning experiments\n\n\n\nC\nox\n(%)\n\n\n\nAltitude\nLocation Soil Soil texture\n\n(m)\n\n\n\ntemperature precipitation KCl (%) (mg/kg)\n\n\n\nAverage annual\npH\n\nprecipitation KCl\n\n\n\nP K\navail avail\n\n\n\nprecipitation\n\n\n\n(°C)\n\n\n\n(mm)\n\n\n\nHaplic Luvisol\nHněvčeves loam 265 8.1 597 6.4 1.0 73 119\n\non loess\n\n\n\nHaplic Cambisol\nHumpolec sandy loam 525 6.6 667 6.1 1.7 27 212\n\non paragneiss\n\n\nCambisol\nPernolec sandy loam-loam 530 7.1 559 6.0 1.1 71 185\non orthogneiss\n\n\nKostelec Haplic Luvisol\n\nsandy loam 290 8.1 696 6.3 1.1 62 119\n\nn. Orlicí on loess\n\n\n**336** Plant Soil Environ., _55_, 2009 (8): 334–343\n\n\n**Results and discussion**\n\n\nK balances calculated for one crop rotation\n(Table 4) correspond well with the data derived\nfrom other fertilization experiments. Macháček\net al. (2001) reported that the annual balance in\ncommon agricultural practice ranges from minus\n75 to minus 185 kg K/ha at low or zero K inputs.\nThe correlation between K input and K balance\nis highly significant ( _R_ _[2]_ = 0.99, _n_ = 10). Zero balance was obtained at the annual input of 163 kg\nK/ha.\n\n\nThe scheme of the experiment allows 10 combinations of farmyard manure (FYM) and K muriate\napplication rates, which would theoretically give\n10 different overall K application rates (marked\nwith letters A–J in Table 4). Some combinations\nof levels give nearly the same overall K application\nrates and a similar K balance. The same application\nrate obtained by different combinations of FYM\nand K muriate levels allows a rough comparison\nof the degree of utilization of FYM and mineral K.\nAt low application rates (combinations B and C);\nthe difference between the outputs of K suggests\nbetter utilization of K from muriate than that\n\nfrom FYM. When taking into account the uptake\nfrom fertilizer (which was calculated as K uptake\nat the particular treatment minus K uptake at no\nfertilized control), crops utilized 44% of mineral\nfertilizer (combination C), and only 9% of K from\nFYM (combination B), on average.\n\n\n\nAt higher application rates the data do not indicate that one of the potassium forms has better\nutilization by crops than another. At the highest\napplication rates, the degree of utilization of both\nFYM and mineral K (combinations G, H, I) is very\nlow (22–25%). Reduced effectiveness of fertilizer\nK suggests that plant growth and yield formation\nis limited by other nutrients (e.g. N, P and Mg;\nBlake et al. 1999).\n\nManuring with FYM supplies soil with high inputs of organic matter and nutrients twice during\na rotation cycle (for sugar beet and silage maize).\nDespite the high K demand of these crops, K input by FYM and K muriate is usually higher than\nK uptake. Only exceptionally, in very favorable\nweather conditions, K output by a high yield of\nsugar beet may compensate for high K input. Thus,\nthe curve of K balance has two positive peaks in\nthe 4 [th] and 7 [th] year of the rotation (Figure 1) in\nfertilized treatments. On the contrary, the high\nK uptake of these crops in non-fertilized treatments causes a clear drop down of the balance\nin these years.\n\nThe growing of alfalfa (first two years of the\nrotation) causes high negative balances in all treatments regardless of the application rate. K fertilizer,\ntogether with N and P, is used only before sowing of alfalfa and oat to stimulate plant growth.\nAfterwards, alfalfa stand was not fertilized and a\nlarge biomass export associated with several cuttings was not compensated for by any input. The\n\n\n\nTable 4. Mean annual potassium balance at Hněvčeves. Different letters (first column) mark different combinations of farmyard manure (FYM) and mineral K fertilizer application rates. Calculated as averages for all 4\nexperimental fields\n\n\n\nReplicates within\nCombination FYM level K level\n\none field\n\n\n\nUptake from\nInput Output Balance\n\nfertilizer*\n\n\nkg/ha/year (standard deviation)\n\n\n\nA (control) no no 2 0 122 – 122 (19) –\n\n\nB medium no 1 76 135 – 59 (6) 13\n\n\nC no medium 1 77 156 – 79 (12) 34\n\n\nD low low 8 88 152 – 64 (12) 30\n\n\nE medium medium 10 153 166 – 13 (11) 44\n\n\nF high low 8 153 160 – 7 (15) 38\n\n\nG low high 8 154 162 – 8 (13) 40\n\n\nH high high 8 218 172 46 (15) 50\n\n\nI excess medium 1 229 179 50 (22) 57\n\n\nJ medium excess 1 230 172 58 (3) 50\n\n\n*by subtracting K uptake on non-fertilized plots (control)\n\n\nPlant Soil Environ., _55_, 2009 (8): 334–343 **337**\n\n\n450\n\n\n300\n\n\n150\n\n\n0\n\n\n-150\n\n\n-300\n\n\n\n\n\n\n\n1 2 3 4 5 6 7 8\n\n\nYear of crop rotation Year of crop rotation\n\n\n\nFigure 1. Average annual potassium balances within\na crop rotation cycle - non-fertilized (NF), medium\nK application rate (153 kg K/ha/year) and excess K\napplication rate (230 kg K/ha/year). Hněvčeves, based\n\non 1980–1992 data\n\n\nlowest balance was found in the treatments of the\nhighest application rate in the 2 [nd] year, suggesting\nthe lack of K limited the yields of alfalfa.\n\nFurther results and discussion on available K\n\nduring one crop rotation are related to data of\nmedium application rate (combination E), mainly\nfor two reasons: (1) 10 replications of this treatment within each field allow for sufficient statis\ntical evaluation, and (2) we can assume that no\nlong-term changes of soil K are due to a nearly\nzero balance.\n\n\nThe dynamics of the available K within crop rotation corresponds clearly to the dynamics of K balance\n(Figure 2); even the amplitude of changes is not as\nhigh. Despite quite high variability of the available K\ncontents, many of the between-year differences are\nstatistically significant. The mean for whole rotation cycle is 116 mg K/kg. The lowest contents of\navailable K are connected with the negative balance\nin the first two years of the rotation, with minimum\ncontent of 88 mg K/kg in the second year. Because\nforage crops take up a substantial amount of K from\nthe subsoil (41–67%, Witter and Johansson 2001),\nthe decrease of available K is not as steep as can\nbe expected from the K balance.\n\nAvailable K contents after winter wheat harvest\nin the 3 [rd] year (93 mg K/kg) are not significantly\ndifferent from that in the second year and that\nlogically corresponds to a nearly zero balance\n(–13 kg K/ha/year). The positive balance in the\n4 [th] year of crop rotation (silage maize) increased\n\n\n\nFigure 2. K balance and available K dynamics within a\ncrop rotation cycle. Hněvčeves, medium K application\nrate (153 kg K/ha/year), based on data from all 4 fields,\n1980–1992. Black points show means, boxes standard\ndeviations and segments max-min range. Different letters\nindicate significantly different averages ( _P_ < 0.05)\n\n\navailable K to 125 mg K/kg, and this increasing\ntrend lasted to the 5 [th] year (130 mg K/kg), despite\na slightly negative balance. The second important\nincrease of available K occurred after sugar beet\n(year 7), where the curve of available K in the\nrotation reached a maximum of 149 mg K/kg. In\nthe last year of the rotation, the available K contents dropped down to 116 mg/kg even though\nthe balance was not negative. This drop can only\nbe explained as K-loss to subsoil by leaching or\nK fixation into non-available forms.\n\n\nAnnual K balances influence available K to a large\nextent also at other sites. ‘Two-peak’ character of\nthe available K curve is a common feature of all the\n\nexperimental sites (Figure 3). Different positions\nof the curve (different mean level of available K)\nare connected with different nutrient status at\n\nthe beginning of experiments and probably also\nwith soil properties (e.g. clay content and quality,\ncation exchange capacity).\n\nPolyfactorial field experiments were designed\nfor analyses of the influence of defined factors and\nfor investigation of time trends caused by various\napplication rates of fertilizers. This experimental\ndesign has limited possibilities to evaluate other influences. Even though we realize some constraints,\nwe made attempts to provide an evaluation of the\nfactors affecting available K variability.\n\nWe can distinguish three known sources of\navailable K variability within the experiment: (1)\nvariability given by the growing of different crops\n\n\n\n**338** Plant Soil Environ., _55_, 2009 (8): 334–343\n\n\n1 2 3 4 5 6 7 8\n\n\n\n200\n\n\n100\n\n\n0\n\n\n\n1 2 3 4 5 6 7 8\n\n\n\n180\n\n\n160\n\n\n140\n\n\n120\n\n\n100\n\n\n80\n\n\n60\n\n\n\nYear of crop rotation Year of crop rotation\n\n\n\nFigure 3. Available K dynamics over a crop rotation\ncycle. Average values for medium FYM and K muriate\napplication rate (153 kg K/ha/year) based on 1980–1992\n\ndata\n\n\n(year of crop rotation), (2) variability given by interannual weather fluctuations and (3) variability\namong fields for a given year of the rotation (Figure\n4). The latter is supposed to be minimum; because\nan important assumption of the experiment is that\nthere are no inner (soil, site) differences among\nfields of a particular site.\n\nResults of the main factors ‘Crop’, ‘Weather’\nand ‘Field’ are shown in Table 5. All factors have\n\nstatistically significant influence on available K.\nBy comparing the sum of squares, it is clear that\nthe influence of crop factor (34% of total) on data\nvariability is much higher than the influence of\nweather and field factors (3%). Residual unexplained variability is high (42%), pointing to the\nexistence of other unknown factors affecting available K data (e.g. soil, sampling and analytical variability). All factors combined explain 58% of the\n\n\n\nFigure 4. Available K dynamics over a crop rotation.\nHněvčeves, medium FYM and K muriate application\nrate (153 kg K/ha/year), based on 1980–1992 data\n\n\ndata variability (including interactions of factors).\nBased on this evaluation, it can be concluded that\nwithin this trial, the growing of different crops\nhad a dominant influence on available K contents.\n\nDifferences among fields and interannual weather\nfluctuations (which influence soil K contents e.g.\nvia affecting crop yields or leaching) were of much\nless importance.\n\nAs for high residual variability found within this\ntrial, unexplained K variability seems to be common in long-term fertilization experiments. Jouany\net al. (1996) reported that for a given treatment,\ndifferences between two successive sampling dates\nare sometimes larger than differences between\ntreatments for a given date. Authors consider that\nthis variability is caused by water content at sampling and drying and subsequent release or fixation\nof K. Merbach and Deubel (2007) reported data of\n\n\n\nTable 5. Influence of planting different crops (factor Crop), interannual weather fluctuations (Weather) and\ndifferences among experimental fields (Field), on variability of available K contents. Results of Main effects\nANOVA. Based on data of Hněvčeves, K application rate 153 kg K/ha, average of years 1980–1992\n\n\nFactor SS SS/Total df _F_ _P_\n\n\nCrop 74 575 0.34 6 37.4 < 0.001\n\n\nWeather 7 257 0.03 10 2.2 0.019\n\n\nField 7 586 0.03 3 7.6 < 0.001\n\n\nResidual 92 432 0.42 278\n\n\nTotal 220 034\n\n\nSS – sum of squares; df – degrees of freedom; _F_ – F statistic; _P_ – probability level\n\n\nPlant Soil Environ., _55_, 2009 (8): 334–343 **339**\n\n\nthe Halle trials as 10-year means with the remark\nthat in addition to the given means, graduation\nof double-lactate K in individual years existed on\ndifferent levels (± 20 mg K/kg).\n\nAccidental incorporation of various ratios of the\nsubsoil into the plough layer during the ploughing may be one of the possible sources of the high\nresidual variability.\n\nInfluence of the interannual K dynamics within\nthree complete crop rotations in field 3 can be\nclearly identified (Figure 5). For medium and excess\napplication rates, the curves had typical two-peak\ncharacter within all rotation cycles and the lowest\navailable K contents were always present after the\nsecond year of alfalfa.\n\nA very interesting phenomenon is the periodic\nchange of available K content in the non-fertilized\ntreatment. Changes follow the crop rotation cycle\nbut the relation to K balance is not as clear as in the\n\ncase of fertilized treatments. Generally, the balance\nis more negative in the first half of the cycle than\nin the second half (Figure 1), when excluding the\nbalance of the 7 [th] year. This corresponds to lower\nK contents in the first half of the rotation cycle.\nHowever, the balance in the year of sugar beet\ncropping is even more negative than for alfalfa,\nbut soil K contents stay at a higher level.\n\nThis phenomenon might be connected with\nthe physiology of the sugar beet. It is known that\nsugar beet is more effective in uptake of fixed soil\nK then cereals (El Dessougi et al. 2002) and due\n\n\n\nto a deep root system it takes large portions of K\nfrom deeper horizons. Simultaneously, K balance\nincludes whole soil profile and only a portion of the\nK uptake originated in a plough layer. Decreases of\nthe soil K pool are often found to be smaller than\nthe calculated total deficit of K from the cropping\nsystems based on the accumulated field balances\n(Andrist-Rangel et al. 2007). Anyway, it is unlikely\nthat a crop with high K demands will not affect K\ncontents in plough layer. Another possible explanation may be that high contents are related to the\nmethod of sampling. After the harvest of sugar\nbeet, deeper soil horizons with a higher K content\nmay mix with the plough (sampling) layer, consequently increasing measured K contents. Some\nside transfer of more fertilized soil from adjacent\nfertilized plots is also possible, even though the\nagrotechnics is done carefully to minimize the\nsoil translocation. Thorough explanation deserves\nfurther attention and verification of data.\n\n\nIn papers evaluating soil properties in long-term\nexperiments, the most usual ways of presenting the\ntime series are calculating means for some period\nof years or showing values of regular sampling with\nconstant periodicity of several years. If sampling is\nonly occasional, data are collected non-regularly\nand then trends have to be evaluated by comparison\nof these isolated data. In the case of our data, some\nof the treatments were sampled almost regularly\nin periodicity of 1 or 2 years (combinations A, B,\nC, E, I and J). For these data, trend evaluation is\n\n\n\n200\n\n\n150\n\n\n100\n\n\n50\n\n\n0\n\n\nFigure 5. Available K contents during the experiment. Hněvčeves site, field 3\nNF – non-fertilized; medium – application rate 153 kg K/ha/year; excess – application rate of 230 kg\nK/ha/year\n\n\n**340** Plant Soil Environ., _55_, 2009 (8): 334–343\n\n\npossible by calculating a mean of average values\nfor whole crop rotation cycles.\n\nThe regular sampling of the other treatments was\ndisrupted after 1988; all plots were then sampled\nagain in 1995 and in 2007. This reveals evident\nproblems of how to compare these data and to\nconstruct time trends. 1988 is the 7 [th] year of the\ncrop rotation, year 1995 is the 6 [th] and year 2007\nis the 2 [nd] year of the crop rotation. The problem\nof comparing data is that means of the 2 [nd], the\n6 [th] and the 7 [th] year differ significantly from each\nother (see Figure 2).\n\nThe direct comparison of values and calculating\ntime trends are therefore not correct for treat\nments with combinations of application rates\nD, F, G and H, which were sampled only in the\nabove-mentioned years. In this case, data should\nbe adjusted to the same level. We decided to use\nyear 2007 (the 2 [nd] year of crop rotation) to recalculate values from years 1988 and 1995. We used\na ratio between average K content of the 2 [nd] and\nthe 6 [th] year of crop rotation (0.72) to adjust data\nfrom year 1995 and the ratio between the 2 [nd] and\nthe 7 [th] year of crop rotation (0.59) to adjust data\nfrom year 1988. For other combinations of application rates, contents in years 1983, 1991 and\n1999 were taken to calculate time trends (the 2 [nd]\nyear of crop rotation).\n\n\n\nData used for the construction of time trends\n\nand calculated slopes are shown in Table 6. For\na given combination of application rates, a slope\nof the regression line was calculated from 4 time\npoints. Between regression trends, calculated from\nadjusted and non-adjusted contents, are important\ndifferences. Calculated slopes of time trends can\nbe approximately the same (combination F), but\nmay differ in absolute values (combination H) or\ncan even indicate a different direction of time\n\nchanges (combination D).\n\nThe highest slopes correspond to annual increases more than 2 mg K/kg (ca 1.5% of available\nK content) and were detected for combinations H\nand J. At the same time, variations caused by growing of different crops were found in the range of\n88–149 mg K/kg, i.e. ± 26% of the mean. It implies\nthat interannual increases caused by long-term\ntrends are of much lower extent (order of magnitude\nlower) than K variability caused by crops.\n\nSlopes are highly correlated with K balance\n(Figure 6, correlation is statistically significant\nat _P_ < 0.05). From the regression equation it can\nbe calculated that a zero slope, i.e. a stabilized\navailable K level, corresponds to an average annual\nK balance of minus 78 kg K/ha. It means that, for\nexample, at an application rate of 77 kg K and a\nmedium application rate of nitrogen and phospho\n\n\nTable 6. Available K contents during the experiment (mg K/kg). Slopes of time trends calculated from 4 time\npoints, with and without adjustment to crop-induced interannual dynamic. Hněvčeves, field 3\n\n\n\nK input\n(kg K/ha/\nyear)\n\n\n\nCombination\n\nof K and FYM\n\napllication rates\n\n\n\nSlope\n1983 1988 1995 2007\n(adjusted)\n\n\n\nSlope\n(non-adjusted)\n\n\n\n88 D 76 67* 69* 81 0.32 –0.28\n\n\n153 F 70 82* 74* 89 0.63 0.77\n\n\n154 G 82 80* 81* 117 1.51 –0.10\n\n\n218 H 83 106* 100* 142 2.22 1.29\n\n\n1983 1991 1999 2007\n\n\n0 A 73 54 48 65 –0.39\n\n\n76 B 80 58 65 72 –0.21\n\n\n77 C 76 70 73 76 0.05\n\n\n153 E 87 72 80 101 0.64\n\n\n229 I 96 114 116 130 1.29\n\n\n230 J 90 88 116 137 2.10\n\n\n*content adjusted with regard to crop-induced interannual dynamic\n\n\nPlant Soil Environ., _55_, 2009 (8): 334–343 **341**\n\n\n2\n\n\n1\n\n\n0\n\n\n-1\n\n\n\n\n\n\n\n-150 -100 -50 0 50\n\nAnnual K balance (kg K/ha) Annual K balance (kg K/ha)\n\n\n\nFigure 6. Relationship between K balances and slopes\n\nof time trends of available K contents. Hněvčeves site\n\n\nrus (combination C), soil K will be continuously\nreplenished from soil sources at an annual rate\nof 79 kg K/ha to keep the same level of ca. 76 mg\nK/kg (in long-term view).\n\nWe would like to pinpoint one interesting consequence that arises from calculated long-term\ntrends. In soils of high starting available K, substantial changes in available K content at plough\nlayer may occur after two 8-year rotations (decrease\nfrom ca 250 mg K/kg by 121 mg K/kg; Lauringson\net al. 2004). In the soil of Hněvčeves, which had\nmuch lower starting available K (119 mg K/kg), the\ndecrease of available K in non-fertilized treatments\n\nwas not as steep (up to 65 mg K/kg in 2007) and\nthe available K contents stayed at approximately\nthe same level (48–65 mg K/kg) during the last\n20 years, at an annual balance minus 122 kg K per\nhectare. If we consider the average bulk density of\nplough layer to be 1.3 Mg/m [3] and the thickness of\nplough layer to be 25 cm, 1 mg/kg available K is then\nequal to 2.5 kg K/ha. Therefore, in non-fertilized\nplots, soil sources other than those extracted for\navailable K, release annually ca 50 mg K/kg.\n\nAs was previously mentioned, the balance covers\nthe whole soil profile and therefore this comparison\nis not fully correct, as we did not analyze subsoil\navailable K contents. However, it is obvious that\navailable K is continuously restored. The reason\nof this restoration is K mobilization from slow\n\nrelease forms. K is replenished by (1) the weathering of mineral soil particles (annually 3–82 kg\nK/ha depending on soil properties; Holmqvist et\nal. 2003), and (2) by the release of fixed (reserve)\n\n\n\nK pool, the content of which is in average 3-times\nlarger than that of available K (Fotyma 2007). Even\nthough we did not analyze the pool of fixed K in\nthe soils at Hněvčeves, we expect that the rate of\nK output was high enough to cause substantial\ndepletion of fixed K.\n\nNowadays, our crop production depends highly\non the mobilization of internal soil K sources.\n\nNegative K balance is a reality and probably also a\nfuture aspect of our agriculture; the change of this\ntrend cannot be expected in the near future. The\nannual K application rate should increase manifold\n(to level ca 170 kg K/ha) to reach stabilization of\navailable K. Moreover, prices of K fertilizers are\nincreasing, contrary to prices of agricultural products. Farmers will not be motivated to use K fer\ntilizers until soil sources are exhausted. Attention\n\nshould be therefore focused on the extent of these\n\nsources and the sustainability of their continuous\nexploitation. Understanding and quantifying K\nmobilization processes is one of the important\nchallenges for future research.\n\nObserved interannual dynamics of soil K are driven by agricultural management and of course are\nspecific for a particular type of that management,\ncrops in rotation, fertilization practices, and soil\nand site properties. The crop rotation used in our\ntrial is probably more K-demanding than the others.\nHowever, results have important consequences for\nevaluation of long-term data not only from these\nstatic fertilization experiments, but also for data taken\nwithin large (national) soil monitoring programs.\nIn occasionally sampled sites or when the period of\nsampling is several years, agricultural management\nhas to be inevitably known. Otherwise, construction\nof time trends will be strongly affected by short-term\ninfluences. The impact of the management could\ninadvertently cover up long term trends and finally,\nthe results would not reflect real time trends.\n\nWithin the long term polyfactorial fertilization\nexperiments, periodic interannual fluctuations\nof available K were observed, with statistically\nsignificant differences from 88 to 149 mg K/kg\nwithin one crop rotation cycle. These fluctuations\nwere driven by the dynamics of the K balance that\noriginated mainly in crop-specific K inputs. The\nvariability of soil-K contents was primarily influenced by crop plants and experimental unexplained\nfactors; interannual weather fluctuations and field\ndifferences were of low significance.\n\n\n\n**342** Plant Soil Environ., _55_, 2009 (8): 334–343\n\n\n**References**\n\n\nAndrist-Rangel Y., Edwards A.C., Hillier S., Oborn I.\n(2007): Long-term K dynamics in organic and conventional mixed cropping systems as related to management and soil properties. Agriculture, Ecosystems\nand Environment, _122_ : 413–426.\n\nAnonymous (2007): Agriculture 2007. Ministry of Agriculture of the Czech Republic, 127. (In Czech)\nBlake L., Mercik S., Koerschens M., Goulding K.W.T.,\nStempen S., Weigel A., Poulton P.R., Powlson D.S.\n(1999): Potassium content in soil, uptake in plants and\nthe potassium balance in three European long-term\nfield experiments. Plant and Soil, _216_ : 1–14.\nCochran W.G., Cox G.M. (1957): Experimental Designs.\nJohn Wiley and Sons, New York, 611.\nEl Dessougi H., Claassen N., Steingrobe B. (2002): Po\ntassium efficiency mechanisms of wheat, barley, and\nsugar beet grown on a K fixing soil under controlled\nconditions. Journal of Plant Nutrition and Soil Sci\nence, _165_ : 732–737.\n\nFotyma M. (2007): Content of potassium in different\n\nforms in the soils of southeast Poland. Polish Journal\n\nof Soil Science, _40_ : 19–32.\n\nHolmqvist J., Ogaard A.F., Oborn I., Edwards A.C.,\nMattsson L., Sverdrup H. (2003): Application of the\nPROFILE model to estimate potassium release from\nmineral weathering in Northern European agricultural\nsoils. European Journal of Agronomy, _20_ : 149–163.\nHraško J., Červenka L., Facek Z., Komár J., Němeček\nJ., Pospíšil F., Sirový V. (1962): Soil Analyses. SVPL,\nBratislava, 342. (In Slovak)\nJouany C., Colomb B., Bosc M. (1996): Long-term effects\n\nof potassium fertilization on yields and fertility status\nof calcareous soils of south-west France. European\nJournal of Agronomy, _5_ : 287–294.\nLauringson E., Talgre L., Roostalu H., Vipper H. (2004):\n\nThe effect of tillage and crop rotation on the content\nof available nitrogen, phosphorus and potassium.\nAgronomy Research, _2_ : 63–70.\n\n\n_Corresponding author:_\n\n\n\nLipavský J., Ludva L., Hromadová M., Kubát J. (2005):\n\nAn overview of the long-term static field experiments\nin the Czech Republic. In: Voříšek K. et al. (eds.): The\nrole of long-term field experiments in agricultural\nand ecological sciences and practical solutions for\nmanaging optimum C and N content in agricultural\nsoils III. Conference Proceedings. Czech University\nof Agriculture and Research Institute of Crop Production, Prague, 143–147.\nMacháček V., Čermák P., Klír J. (2001): Potassium Fer\ntilization in Czech Republic. Country Report 2. In\nternational Potash Institute and Research Institute of\n\nCrop Production and Central Institute for Supervising\nand Testing in Agriculture, Prague, 59. (In Czech)\nMerbach W., Deubel A. (2007): The Long-Term Fertilization Trials in Halle (Saale), Germany. GWV,\nFachverlage GmgH, Wiesbaden, 189.\nMerbach W., Deubel A. (2008): Long-term field experi\nments – museum relics of scientific challenge? Plant,\nSoil and Environment, _54_ : 219–266.\n\nOborn I., Andrist-Rangel Y., Askekaard M., Grant C.A.,\nWatson C.A., Edwards A.C. (2005): Critical aspects\nof potassium management in agricultural systems.\nSoil Use and Management, _21_ : 102–112.\nSimonsson M., Andersson S., Andrist-Rangel Y., Hillier\nS., Mattsson L., Oborn I. (2007): Potassium release\n\nand fixation as a function of fertilizer application rate\nand soil parent material. Geoderma, _140_ : 188–198.\nSouthwood T.R.E. (1994): The importance of long-term\nexperimentation. In: Leigh R.A., Johnston A.E. (eds.):\nLong-term Experiments in Agricultural and Ecological\nSciences. CAB International, Wallingford, Oxon.\nTrávník (2008): Monitoring influence of graduating fer\ntilization intensity on crop yields and on agrochemical\nsoil properties. Evaluation of analytical methods for\nsoil available nutrients (final report from long-term\nexperiments). CISTA, 26. (In Czech)\nWitter E., Johansson G. (2001): Potassium uptake from\nthe subsoil by green manure crops. Biology, Agriculture and Horticulture, _19_ : 127–141.\n\n\nReceived on February 26, 2009\n\n\n\nRNDr. Mikuláš Madaras, PhD., Crop Research Institute, Drnovská 507, 161 06 Praha 6- Ruzyně, Česká Republika\nphone: + 420 233 022 352, fax: + 420 233 310 636, email: madaras@vurv.cz\n\n\nPlant Soil Environ., _55_, 2009 (8): 334–343 **343**\n\n\n",
  "table_data": [
    {
      "table_id": "Interannual dynamics of available potassium in a long-term fertilization experiment_table_0",
      "page": 5,
      "accuracy": 0,
      "data": [
        {
          "0": "",
          "1": ""
        }
      ],
      "shape": [
        1,
        2
      ]
    }
  ]
}