{
  "filename": "principles-of-potash-use.pdf",
  "processing_timestamp": "2025-07-06T18:32:39.015920",
  "text_extraction": {
    "success": true,
    "character_count": 21790,
    "output_file": "2_processed_data/text_extracts/principles-of-potash-use.md"
  },
  "table_extraction": {
    "success": true,
    "table_count": 3,
    "output_file": "2_processed_data/table_data/principles-of-potash-use_tables.json",
    "tables_summary": [
      {
        "id": "principles-of-potash-use_table_0",
        "shape": [
          3,
          6
        ],
        "accuracy": 0
      },
      {
        "id": "principles-of-potash-use_table_1",
        "shape": [
          3,
          3
        ],
        "accuracy": 0
      },
      {
        "id": "principles-of-potash-use_table_2",
        "shape": [
          2,
          3
        ],
        "accuracy": 99.45404843990424
      }
    ]
  },
  "quality_metrics": {
    "text_success": true,
    "table_success": true,
    "character_count": 21790,
    "table_count": 3,
    "error_count": 0,
    "processing_completeness": 1.0
  },
  "errors": [],
  "full_text": "## leaflet 8 **The Potash Development Association**\n\n# **Principles of Potash use**\n\n\n## **Needs of the plant**\n\nNormal plant growth requires large quantities of potassium (K, often referred to as potash, K 2 O). In fact,\nthroughout growth most crops contain more potassium than any other nutrient including nitrogen (N).\nSmall quantities of potassium are needed to support many of the crucial enzyme processes within the\nplant but very much larger amounts are used to control the water relationships in the plant. Potassium\nalso plays a vital role in the transport of sugars and other products of photosynthesis from leaves to\nstorage organs. Adequate quantities of potassium are thus essential for a crop to achieve its full yield\npotential and also for many aspects of product quality such as grain size and appearance, tuber size,\noil content, dry matter and starch content, percentage sugar and fruit ripening and quality.\n\n\nMany of the functions of potash in the plant are related to physiological conditions and stress. These\nfunctions are diverse and include efficient nitrogen and water use, drought tolerance, frost resistance and\nresistance to pests and diseases. It is therefore not surprising that lack of plant-available potash in the\nsoil results in weaker, less vigorous crops that suffer major penalties in difficult growing seasons. In years\nwhen growing conditions and yields are good the response to potash may be modest, especially for crops\nlike cereals, but in adverse years its contribution to optimum yields will be substantial. Adequate\npotassium thus provides some 'insurance' against adverse conditions in difficult growing seasons.\n\n## **'Potash' and 'potassium'**\n\n\nFertilisers and organic manures release potassium into soil solution as the potassium ion, K [+ ] and plants\ntake up potassium in this same form. However the potassium content of fertilisers is usually referred to\nand measured as 'potash' or K 2 O. This is just a convention and 'potassium', 'potash', 'K' and 'K 2 O' are\noften used interchangeably when referring to fertilisers or application rates. Soil analysis results are given\nas mg/litre (or ppm) of K (potassium) which relates to an Index, not to an amount of fertiliser, and should\nnot be confused. If it is necessary to convert K 2 O to K (for example if converting the UK recommendations\nin this leaflet for use in the Irish Republic) the K 2 O value should be multiplied by 0.83. Similarly K\nvalues can be converted to K 2 O by dividing by 0.83.\n\n\n## **The N and K partnership**\n\nPotassium and nitrogen are strongly associated in\nplant processes and should be considered together.\n\n\n\nFig 1: **K effect on N response**\n\n\n\nFirstly in terms of uptake, both nutrients are needed\nin large amounts at the same time. N is mainly taken\nup as the negatively charged nitrate anion NO 3 [- ] and\npotassium as the positively charged cation K [+] . When\nequal amounts of both are taken up together, the\nneutrality of the system is maintained. Nitrogen\napplication and uptake stimulates the growth of\nplant cells which take in water. Potassium is required\nto maintain the turgor (rigidity) and regulate the\nwater content of the cell. Maintenance of cell turgor\nis essential to optimise the interception of solar\nradiation (sunlight) to provide energy for the conversion of carbon dioxide to sugars, the basic building\nblock for the production of harvestable yield.\n\n\n2\n\n\nWithin the plant the complex formation of protein from nitrate and its distribution around the plant are\nhighly dependent upon adequate K supply. If 'normal optimum' rates of N are applied in the absence of\nsufficient K, full response to nitrogen will not be obtained and residues of nitrogen may remain and be\nleached at the end of the season (see Figure 1).\n\n\nTypical patterns of K uptake for cereals and roots are shown in Figures 2 and 3. For combinable crops,\nuptake will peak at around flowering, whereas for root crops maximum uptake is shortly before harvest\nor at haulm destruction.\n\n\nIn most plant species the total content of potassium is larger than that of any other nutrient, even\nnitrogen. For optimum growth the plant-available supply of potassium in the soil must meet both the\nmaximum total demand and the required rate of daily uptake. This will vary from season to season\ndepending on soil conditions and weather. Whenever there is a rapid surge in growth the soil supply must\nbe able to meet the demand of the crop. Hence the need to maintain soil reserves is a sound insurance.\nTypical peak rates of uptake are 5-10 kg K 2 O/ha/day for root crops and oilseed rape.\n\n\nFig 2: **Nutrient uptake of a typical** Fig 3: **Nutrient uptake of a typical**\n**8 t/ha wheat crop** **55 t/ha potato crop**\n\n\nTable 1: **Typical total uptake of potassium by large yielding crops expressed in kg/ha K** **2** **O**\n\n\nCereals 300-350\n\nOilseed rape 350-400\n\nPotatoes 400-450\n\nSugar beet 400-450\n\nPulses 150-200\n\nForage crops 300-500\n\nGrass silage (single cut) 100-170\n\n\n3\n\n\n## **Sources of potash**\n\nFig 4: **The K cycle**\n\n\nPlant roots take-up potassium as the cation K [+] from the soil solution and it is this, plus the 'readily\navailable K', which is measured by soil analysis as being potentially available to the crop (Figure 4). Small\nquantities can be taken in from a foliar application but the amounts are usually insignificant in relation\nto overall potassium needs. (It is also a costly method.) Rainfall contributes very small amounts of\npotassium (less than 5 kg/ha/year). Fertilisers, manures and crop residues all add potassium to the soil as\nK [+] . Almost all potassium sources are soluble* and increase the concentration of K in the soil solution\n\nfor the K to be released, perhaps over 12 months.\n\n\n\nOnly small amounts of K are maintained in\nthe soil solution 5-20 kg/ha K (6-24 kg K 2 O).\nThe majority of potassium reserves in the soil\nare held by the negative charges on clay\nminerals and organic matter (Figure 5). The\npotassium may be held weakly or strongly\naccording to the position in the clay lattice.\nK [+] which is loosely held ('exchangeable K') is\nrapidly released for plant uptake, whilst\nthe more firmly bonded reserve ('nonexchangeable K') is released more slowly.\nIndividual soils have different capacities to\nhold potassium according to clay type and\ncontent and amount of soil organic matter.\nSand soils have very limited reserves of\nexchangeable K.\n\n\n\n\n\nThe clay minerals themselves contain potassium as an integral part of their structure (mineral K)\nand this is released only over very long time periods by the breakdown of the minerals (weathering).\nIn UK conditions the amount of K released by weathering of the clay minerals is too small to meet the\nneeds of even average crops. The different pools of soil K shown in Figure 4 are defined in relation\nto the plant availability of the K and are not distinct. The amount of K in each pool varies with\npotash additions, crop uptake, N use, soil wetting and drying, cultivations, etc.\n\n\n_except specific clay mineral fertilisers used in organic farming - see PDA Leaflet 23_ .\n\n\n4\n\n\n## **Potash leaching**\n\nPotassium does not leach anything like as readily from soils as does nitrate and sulphate. Potash\nadditions not taken up by the crop will be held in the soil by the clay minerals or organic matter as\ndescribed above. For the great majority of soils, which have a clay content of 5% or more, where\nnormal rates of potash are applied, potassium not used by the crop will remain in the cultivated layer of\nsoil and will not move further down the profile. However, significant losses of potassium can occur when\nany source of potash (fertiliser, slurry or manure) is applied under adverse conditions i.e. when soil is\nwater-logged, frozen or very dry and deeply cracked. Most of this loss is by surface run-off and can be\navoided by following codes of good agricultural practice. Soils with less than 5% clay (the sands and\nloamy sands) have a much lower retentive capacity for potassium. Such soils, especially if shallow and\nsubjected to rainfall producing large amounts of through-drainage, have a greater risk of potassium loss.\nOn these soils, potash should be applied 'little and often' and applications timed to suit crop uptake and\namounts carefully matched to crop offtake.\n\n## **Soil analysis**\n\n\nMany decades of detailed research work have resulted in the present soil analysis system as the best\npractical approach for assessing the adequacy or deficiency of soil potassium supply (see PDA Leaflet 24).\nSoil analysis measures the K in the soil solution and exchangeable K to give a guide to the amount of\npotassium that is available to the crop. All soils contain much larger total quantities of K as shown in\nFigure 4. Slowly available reserves (non-exchangeable K) may contribute to plant supply over the course\nof a season but this release is variable and impractical to measure. For many soils the slowly available\nreserve provides only a minor annual supply but it can be more important on some very clayey soils\n(see PDA Leaflet 19).\n\n## **Soil K and crop response**\n\n\nFig 6: **Response of winter wheat & spring barley to soil K** Fig 7: **Response of potatoes & field beans to soil K**\n\n\nThe yield response curve to soil potassium supply follows the same principles as for other inputs. At very\nlow levels of available soil K, the response to applied potash is large and the response decreases to nil as\nsoil supply increases. Target levels for soil K which represent the level at which K supply is adequate for\nfull yield but not excessive have been established from large numbers of response experiments for\ndifferent crops.\n\n\n5\n\n\nAs shown by the scatter of points in Figures 6 and 7 for a number of field experiments, the response to\nsoil K can vary. Often variation is due to factors other than the availability of soil K. For this reason the K\nIndex system, as in RB 209, gives a range of soil K values for each Index and is intended to provide a\ngeneral guide to interpretation.\n\n\n**soil K mg/l**\n\n\n**Index 0** 0-60 Large responses likely\n**Index 1** 61-120 Smaller responses probable\n**Index 2** 121 - 240 Responses unlikely\n**Index 3** 241 - 400 Nil response from grass & most arable crops\n**Index 4** 400 - 600 Unnecessarily high levels of reserve for arable crops & grass\n\n## **Principles of manuring**\n\n\n_It is the soil that feeds the crop, while fertilisers feed the soil._\n\n\n**Critical values of soil K for different crops have been established from numerous experiments**\n**as illustrated in Figures 6 and 7 at which full crop yield will be achieved. For all soils, except the**\n**lightest textured soils which cannot sustain these levels without risk of leaching, the aim is to**\n**maintain soil K above the critical level appropriate to the rotation, using fertiliser and manure**\n**to replace the potassium removed by cropping.**\n\n\nIt should be recognised, therefore, that potash is unlike most other farm inputs, which are justified on\nthe basis of direct yield response and financial return per £ spent. Correct use of potash to replace\ncrop offtake and maintain soil reserves may not result in an immediate yield response. Failure to replace\nthe potassium removed in the crop and maintain an adequate soil reserve prejudices future yields and\ncrop quality and unnecessarily jeopardises the response to all other inputs.\n\n\nPolicy for the lightest textured soils (sands and loamy sands) should be to ensure at least the replacement\nof removals but not to expect to be able to raise the inherently low levels of soil K to the same values as\nfor other soils.\n\n## **Benefits of maintaining soil fertility**\n\n\n- Fertile soils have a better distribution of nutrients throughout the soil profile, and this cannot be\nachieved immediately from fresh fertiliser applications. This results in more effective uptake,\nespecially for poorer rooting crops such as potatoes, and better yields than can be achieved from low\nsoil fertility and high fertiliser regimes.\n\n\n- Soils with adequate nutrient levels avoid the risk of damage to roots from local, high concentrations\nof salts from large fertiliser applications.\n\n\n- Satisfactory fertility removes the urgency of timeliness in application of fertilisers, which eases peak\nwork-loads, offers cash flow benefits and allows fertiliser application to be undertaken at the best\ntime without risk to soil structure or seedbeds from tractor wheelings. Crop response to nitrogen\nfertiliser depends on having appropriate amounts of other nutrients (e.g. P, K, S, and Mg) in the soil\nprofile explored by roots. Shortages of these nutrients will result in poorer responses to nitrogen and\nthe risk of leaving unused nitrogen residues in soil.\n\n\n6\n\n\n## **Target levels of soil fertility**\n\n\n\n\n\n\n\n - _Soil target concentrations are for Olsen P. Some laboratories use other extractants._\n\n\n** _These soils cannot be maintained at higher levels of K without risking unacceptable_\n\n\n_losses. Regular use of organic manure is of considerable benefit in these situations._\n\n\nSoil K levels cannot be rapidly changed up and down to suit individual crops and the appropriate target\nlevel must be set for the most demanding crop in the rotation.\n\n## **Low fertility soils**\n\n\n\nThe rate at which reserves in a low K soil should be\nbuilt up is largely an economic decision.\nConsideration should be given to the likely loss of\ncrop yield and quality of all the crops grown in the\nrotation on a low K soil, as well as the cost of\nfertiliser. Soils vary in their capacity to retain\npotassium (buffering capacity) and require different\nquantities of potash to increase plant-available K as\nmeasured by exchangeable K.\n\n\n\n\n\n**Approximate amounts of potash needed**\n**to increase exchangeable soil K by 60 mg/l**\n**(e.g., lower Index 1 to Index 2-)**\n\n\n\nThe quantities required may seem surprisingly large Clay 800\nbut are a consequence of the fact that some of the\nadded K goes into non-exchangeable reserves that\nare not measured by soil analysis. In practice, low soil K levels should be improved over a period of years\nusing annual remedial amounts (see for example RB 209). Heavier soils are less likely to be found with\nlow K levels but will take longer to restore to a satisfactory level than lighter soils.\n\n\n\n7\n\n\n## **Fertiliser policy**\n\nFollowing the principles of manuring stated earlier, fertiliser recommendations comprise two\ncomponents:\n\n**Replacement of nutrient removed = R**\n\nCalculated from standard offtake x yield/ha - see page 9.\n\n\n**Soil fertility adjustment**\n\n\nAdditions to improve low soil K, or reductions to allow unnecessarily high levels to decline.\nThese can be made annually to each crop or periodically in larger applications depending upon\nsoil type and rotation and financial considerations.\n\n\nThese two components vary with soil K Index as shown in the table below. Fine-tuning of the soil\nfertility adjustment could be done where soil is in the upper or lower parts of Indices 1 or 3.\nFor example, at low Index 1, the fertility adjustment could be +125 kg K 2 O/ha for vegetables or\n+35 kg K 2 O/ha for arable and grassland.\n\n### **Basis of fertiliser recommendations, kg K 2 O/ha:**\n\n\n**Vegetables:**\n\n\n\n\n\n\n\n\n\n\n\n8\n\n\n## **Removal of potash**\n\nUnder-estimation of K offtake is one of the commonest causes for soil K levels to fall below target and\nemphasises the need to undertake careful estimations of the amount removed. Standard figures to\ncalculate removal and therefore **replacement** needs are given below:\n\n\n\n\n\n_*_ _offtake value is per tonne of grain or seed but includes nutrients in grain and straw._\n\n\n9\n\n\n## **Fine tuning**\n\nWhere more site-specific information is available it may be possible to 'fine tune' the general offtake\nguidance in this leaflet. For example in the case of sugar beet, recent studies indicate that the tare-house\nanalysis of root K content (x 1.2 to convert to K 2 O), used in conjunction with yield provides an accurate\nindication of potash offtake, see PDA Leaflet 12.\n\n\n**A number of other specific aspects may be considered.**\n\n\n**Soil structure**\n\n\nCompaction, soil pans or other adverse structural problems can inhibit root growth and thus their ability\nto take up nutrients from a large volume of soil. 'Fertility' embraces other factors as well as nutrients,\nincluding soil aeration and water availability and organic matter content. Improvement of these factors\nleads to better biological activity in the soil and more readily available nutrients. These aspects should be\na starting point not an after-thought in fertility management.\n\n\n**Soil depth**\n\n\nSoil analysis measures the available nutrients to sampling depth - normally 15 cm for arable soils and\n7.5 cm for permanent grassland - and in soil particles less than 2 mm in diameter. The amount of soil\nin this size range that can be explored by roots is important. Thus soil depth and stoniness can affect\nnutrient availability, and should be taken into account when interpreting soil analysis results and\nassessing the amount of nutrient available. Whilst nutrients are generally most concentrated in the\nplough layer, it is clear that modern high-yielding, well-rooted crops derive considerable amounts of\npotash from greater depth. It may be valuable to estimate the likely supply of K by analysing samples\ntaken at depth for soil N. However, interpreting the results may not be easy because there is little\ninformation on the amount and distribution of roots at depth.\n\n\n**pH**\n\n\nA larger proportion of applied potash tends to become non-exchangeable on neutral and calcareous soils\nthan on soils with pH around 6. Additions of fertiliser to improve low K status will have less impact on\nsuch soils and this needs to be considered when calculating fertiliser requirements for these soils.\n\n\n**High magnesium soils**\n\n\nPotassium availability may be affected on soils with very high Mg levels. It has been suggested that where\nthe concentration (mg/l) of soil Mg is more than twice that of soil K, potash availability to the crop may\nbe less than implied by the actual potassium analysis value. In such circumstances no more magnesium\nin any form should be applied to the rotation and higher applications of K may be used to overcome the\nimbalance. The application of calcium to replace the magnesium is not recommended, principally\nbecause it will also displace K.\n\n\n**Non-exchangeable K**\n\n\nThere is still no practical method to estimate the supply of slowly released K, which will vary\ngreatly between soils and between seasons. For some heavy soils it may be sufficient to provide all\nthe needs of combinable crop rotations and permit applications for root rotations to be halved.\nHowever, this does not apply to all clay soils - see PDA Leaflet 19. On lighter soils, allowance for\nnon-exchangeable K should only be made where objective information or experience is available.\n\n\n10\n\n\n## **Organic manures**\n\nInadequate allowance is still frequently made for the nutrient contribution from manures. Use standard\nfigures unless specific analysis is available for consistent materials, and deduct the total amount of potash\nin manure applied if the soil Index is 2 or more. For soils at Index is 0 or 1, K added in manures can be\nthought of as helping to increase soil reserves and normal applications of fertiliser K should be given.\n\n\n\n\n\n\n\n\n\n\n\n**(1)** Nutrients that are available to the next crop\n\n\n**(2)** Potash values will be lower if FYM is stored in the open or for long periods\n\n\n**(3)** Adjust nutrient content if % DM is higher or lower\n\n\n**Imperial Conversions**\n\n\n**Multiply kg/m** **[3]** **by 9 to give units/1000 gals**\n**Multiply kg/t by 2 to give units/ton**\n\n\n11\n\n\nA difficult financial situation should not persuade farmers to reduce levels of potash below the guidelines in this leaflet. Whilst the soil K targets are not precise cut-off points, it must be recognised that the\nrisk of yield and quality penalties generally increases with lower soil K levels. In view of the fact that\npotash is not lost from most soils and that it is the least expensive of all major nutrients, such risks do\nnot seem worthwhile.\n\n\nThe estimation of potash offtake and the replacement of this quantity remains the most important\naspect of fertiliser policy for K.\n\n## **Timing**\n\n\nIndividual recommendations for specific crops are detailed in other PDA leaflets.\n\n\n\n\n\n**24** Soil Analysis\nKey to Nutrient Management Planning\n\n\n**25** What you should know about fertilisers\n\n\n**26** Nutrient Requirements of Forage Crops\n\n\n**27** Fodder Beet - P & K offtake\n\n\n**28** Why Maintain Soil Potash Reserves?\n\n\n**29** Potash and the Environment\n\n\nPhosphate and Potash removal by crops\n\n\nNutrient Content of Manures\n\n\n\n**4** Potash manuring for Arable Crops\n\n\n**5a** Results from Cereal Demonstration Plots\n\n\n**5b** Results from Grass Demonstration Plots\n\n\n**6** Potash, Magnesium & Sodium Fertilisers for Grass\n\n\n**7** P & K Balance for Cereals\n\n\n**9** Potash for Silage (experimental results)\n\n\n**11** Cereals and Potash\n\n\n**12** Potash for Sugar Beet\n\n\n**13** Oilseed Rape and Potash\n\n\n\n**14** Potash for Grassland for Silage and Grazing\n\n\n**15** Potash for Potatoes\n\n\n**16** Fodder Beet -Fertiliser Requirements\n\n\n**17** Forage Maize - Fertiliser Requirements\n\n\n**18** Grain Legumes need Potash\n\n\n**19** Potash for Heavy Soils\n\n\n**20** Potash & Biosolids\n\n\n**22** N & K top dressing for arable crops\n\n\n**23** Potash for Organic Growers\n\n\n\n**FOR MORE INFORMATION ON POTASH CONTACT:-**\n\n\nPotash Development Association,\nPO Box 697, York YO32 5WP.\n**Tel & fax 01904 492009**\n**email: info@pda.org.uk**\n**Website: www.pda.org.uk**\n\n\n**The Potash Development Association**\nis an independent technical organisation formed\nto support the efficient use of potash fertiliser in\nthe UK\n\nOct 2006\n\n\n",
  "table_data": [
    {
      "table_id": "principles-of-potash-use_table_0",
      "page": 5,
      "accuracy": 0,
      "data": [
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": ""
        }
      ],
      "shape": [
        3,
        6
      ]
    },
    {
      "table_id": "principles-of-potash-use_table_1",
      "page": 5,
      "accuracy": 0,
      "data": [
        {
          "0": "",
          "1": "",
          "2": ""
        },
        {
          "0": "",
          "1": "",
          "2": ""
        },
        {
          "0": "",
          "1": "",
          "2": ""
        }
      ],
      "shape": [
        3,
        3
      ]
    },
    {
      "table_id": "principles-of-potash-use_table_2",
      "page": 9,
      "accuracy": 99.45404843990424,
      "data": [
        {
          "0": "kg/t of fresh material \nP2O5\nK2O",
          "1": "",
          "2": ""
        },
        {
          "0": "- Grain only \nCereals\n- Grain & straw\nWinter wheat/barley \nSpring wheat/barley\nWinter/spring oats \nOilseed Rape - Seed only \n- Seed & straw \nPeas - dried \n- vining \nFields Beans\nPotatoes\nSugar Beet - Roots only \n- Roots & tops \nFodder Beet - Roots only \n- Roots & tops \n- fresh grass @ 15-20% DM\nGrass\n- silage @ 25% DM\n- silage @ 30% DM\n- hay @ 86% DM \nKale\nMaize - silage @ 30% DM \nSwedes - roots only\nBroad Beans\nFrench Beans\nBeetroot\nCabbage\nCauliflower\nOnions - bulb \nSprouts - buttons",
          "1": "7.8 \n8.6*\n8.8*\n8.8* \n14.0 \n15.1* \n8.8 \n1.7 \n11.0 \n1.0 \n0.8 \n1.9 \n0.6 \n1.7 \n1.4 \n1.7 \n2.1 \n5.9 \n1.2 \n1.4 \n0.7 \n1.6 \n1.0 \n1.0 \n0.9 \n1.4 \n0.7 \n2.6",
          "2": "5.6 \n11.3*\n13.7*\n17.3*\n11.0 \n17.5*\n10.0 \n3.2 \n12.0 \n5.8 \n1.7 \n7.9 \n4.0 \n7.5 \n4.8 \n6.0 \n7.2 \n18.0 \n5.0 \n4.4 \n2.4 \n3.6 \n2.4 \n4.5 \n3.6 \n4.8 \n1.8 \n6.3"
        }
      ],
      "shape": [
        2,
        3
      ]
    }
  ]
}