{
  "filename": "Soil K Balance in Sichuan.pdf",
  "processing_timestamp": "2025-07-06T18:33:16.088803",
  "text_extraction": {
    "success": true,
    "character_count": 59918,
    "output_file": "2_processed_data/text_extracts/Soil K Balance in Sichuan.md"
  },
  "table_extraction": {
    "success": true,
    "table_count": 2,
    "output_file": "2_processed_data/table_data/Soil K Balance in Sichuan_tables.json",
    "tables_summary": [
      {
        "id": "Soil K Balance in Sichuan_table_0",
        "shape": [
          3,
          3
        ],
        "accuracy": 0
      },
      {
        "id": "Soil K Balance in Sichuan_table_1",
        "shape": [
          2,
          6
        ],
        "accuracy": 0
      }
    ]
  },
  "quality_metrics": {
    "text_success": true,
    "table_success": true,
    "character_count": 59918,
    "table_count": 2,
    "error_count": 0,
    "processing_completeness": 1.0
  },
  "errors": [],
  "full_text": "## **_sustainability_**\n\n_Article_\n# **Soil Potassium Balance in the Hilly Region of Central Sichuan,** **China, Based on Crop Distribution**\n\n\n**Shan Wang** **[1]** **, Zhiping Li** **[2]** **, Lulu Li** **[2]** **, Yuelin Xu** **[2]** **, Guohui Wu** **[2]** **, Qin Liu** **[3]** **, Peihao Peng** **[1,]** *** and Ting Li** **[2,]** *****\n\n\n1 College of Earth Sciences, Chengdu University of Technology, Chengdu 610059, China;\n2019010042@stu.cdut.edu.cn\n2 College of Resources, Sichuan Agricultural University, Chengdu 611130, China; lzhiping2023@163.com (Z.L.)\n3 Institute of Mountain Hazards and Environment, Chinese Academy of Sciences, Chengdu 610041, China\n***** Correspondence: pengpeihao@cdut.edu.cn (P.P.); tingli121@sicau.edu.cn (T.L.)\n\n\n**Abstract:** The problem of soil fertility imbalance in hilly agriculture is prominent, and accurate\nestimation of soil potassium balance is key to achieving precision fertilization at the regional level.\nCrop distribution has a significant impact on potassium balance, but studies on potassium balance\nwith a focus on crop cultivation types are scarce, especially with regard to hilly areas. In this study,\nthe spatial distribution characteristics of soil potassium balance under different cropping conditions\nand its influencing factors were analyzed for a hilly region. The results showed that (1) the soil\nrapidly available potassium (RAK) and slowly available potassium (SAK) content in the 0–20 cm soil\nlayer ranged from 29.37 to 122.07 mg kg _[−]_ [1] and from 472.31 to 772.77 mg kg _[−]_ [1], respectively. (2) The\nsoil potassium equilibrium status varied considerably among different cropping systems and the\nsoil potassium deficit was greatest under the rapeseed–maize rotation, reaching _−_ 129.50 kg K ha _[−]_ [1]\n\n\n\n**Citation:** Wang, S.; Li, Z.; Li, L.; Xu,\n\n\nY.; Wu, G.; Liu, Q.; Peng, P.; Li, T. Soil\n\n\nPotassium Balance in the Hilly\n\n\nRegion of Central Sichuan, China,\n\n\nBased on Crop Distribution.\n\n\n_Sustainability_ **2023**, _15_, 15348.\n\n\n[https://doi.org/10.3390/](https://doi.org/10.3390/su152115348)\n\n\n[su152115348](https://doi.org/10.3390/su152115348)\n\n\nAcademic Editor: Teodor Rusu\n\n\nReceived: 18 August 2023\n\n\nRevised: 21 October 2023\n\n\nAccepted: 24 October 2023\n\n\nPublished: 27 October 2023\n\n\n**Copyright:** © 2023 by the authors.\n\n\nLicensee MDPI, Basel, Switzerland.\n\n\nThis article is an open access article\n\n\ndistributed under the terms and\n\n\nconditions of the Creative Commons\n\n\n[Attribution (CC BY) license (https://](https://creativecommons.org/licenses/by/4.0/)\n\n\n[creativecommons.org/licenses/by/](https://creativecommons.org/licenses/by/4.0/)\n\n\n4.0/).\n\n\n\nyr _[−]_ [1] . The difference in soil potassium deficits between the rice–rapeseed and wheat–maize rotations\nwas not significant, at _−_ 46.79 kg K ha _[−]_ [1] yr _[−]_ [1] and _−_ 44.07 kg K ha _[−]_ [1] yr _[−]_ [1], respectively, and only\nthe rice–wheat rotation showed a potassium surplus. Due to the low potassium absorption of crops,\nthe equilibrium value of soil potassium is higher than that of crop rotation, and rice and wheat can\nachieve different degrees of potassium surplus. Rapeseed planting was generally under-applied\nwith potassium, and the potassium deficit could reach _−_ 70 kg K ha _[−]_ [1] yr _[−]_ [1] . (3) Climate, topography,\nanthropogenic activity, and soil available potassium explained 20.8% of the variance in soil potassium\nbalance. Anthropogenic activity such as roads and population density had the greatest influence,\nwith 0.797. Topography and average annual precipitation had the weakest influences. These findings\nemphasize the importance of anthropogenic activity for soil potassium balance, and also provide\nregional evidence for formulating efficient measures for regional potassium resources management.\n\n\n**Keywords:** crop planting structure; soil available potassium; spatial distribution; potassium balance\n\n\n**1. Introduction**\n\n\nHilly landscapes, as one of the five major terrestrial geomorphological types globally,\nplay a critical role in agricultural production. Soil nutrient management in hilly areas\nbecomes particularly crucial because hilly agriculture is susceptible to soil fertility imbalances. Exploring the characteristics of fertility balance and its influencing mechanisms is\nimportant for scientific management of hilly agriculture. Potassium (K) plays an important\nrole in plant growth, and its deficiency or absence has a significant impact on normal\nplant growth and development, cellular metabolism, and resistance to insect pests [ 1, 2 ].\nAlthough potassium is one of the most abundant nutrients in soil, soil potassium distribution shows strong spatial heterogeneity due to the high spatial and temporal variability\nin soil resources [ 3 – 5 ]. Fertilization is the most direct and effective way to augment and\nregulate soil potassium content [ 6 – 8 ]. However, differences in nutrient inputs, climatic\nand soil conditions, different crop assortment, and yield level all affect crop demand for\n\n\n\n_Sustainability_ **2023**, _15_ [, 15348. https://doi.org/10.3390/su152115348](https://doi.org/10.3390/su152115348) [https://www.mdpi.com/journal/sustainability](https://www.mdpi.com/journal/sustainability)\n\n\n_Sustainability_ **2023**, _15_, 15348 2 of 16\n\n\npotassium and its soil outflow, both of which ultimately affect the potassium balance [ 9 ].\nTherefore, understanding the soil potassium balance in a soil–crop system is a priority when\nattempting to ensure a stable and high yield of crops and achieve efficient management of\npotassium resources.\nSoil potassium balance is a measure of the sum of potassium inflows and outflows\nwithin a particular framework [ 10, 11 ]. Currently, there are two main types of research\non potassium balance in farmland soil both domestically and internationally: soil potassium balance based on crop soil fertilization experiments, and soil potassium balance\nestimation based on statistical or survey data. For instance, based on a field study,\nLi et al. [ 12 ] demonstrated that zeolite amendments alleviated negative potassium balances, and Zhang et al. [ 13 ] found that high straw return with fertilization improved soil\npotassium supply and potassium balance, compared to no fertilization or low straw return\nconditions. These studies provide practical ways to improve potassium balance, but do not\nreveal the statuses of regional potassium balances. In contrast, Linquist et al. [ 14 ] assessed\nsoil potassium balance (average value was _−_ 15 kg K ha _[−]_ [1] yr _[−]_ [1] ) in commercial rice fields\nacross California based on historical information provided by growers, and Liu et al. [ 15 ]\nanalyzed temporal and spatial changes in the potassium balance of farmland in China\nfrom 1980 to 2015 using statistical data and related parameters. Although previous studies\nhave obtained the total provincial soil potassium balance, which is of some significance\nin guiding regional fertilization, they did not take into account the spatial variation in\nsoil potassium balance within a region due to crop distribution. Previous research on soil\npotassium spatial characteristics has mainly focused on spatial variation in soil potassium\nfertility and analysis of influencing factors [ 3, 4, 12 ], but has paid less attention to the spatial mapping of soil potassium balance in terms of regional crop distribution. However,\nwhen assessing the nutrient balance of the farmland in a region, the spatial distribution\nof regional crops can often better represent the regional farmland’s nutrient balance and\nshows the regional farmland’s nutrient surplus and deficit situation in a more realistic way.\nTherefore, considering the fact that planting structure has an important effect on potassium distribution but few studies have quantified it, especially in hilly areas where soil\nfertility exchanges are more frequent, this study attempted to explore the spatial distribution characteristics of soil potassium balance under different cropping conditions in a hilly\nregion. Shehong County, Suining City, located in the core hilly area of Sichuan Province,\npossessing typical hilly agriculture, was selected as the study area. Multi-temporal Sentinel2 satellite images and the decision-tree classification method were used to extract the spatial\ndistribution of major crops in the study area. The spatial distribution pattern for soil potassium content was also assessed using soil sampling data. The spatial distribution pattern\nof soil potassium content was evaluated through soil sampling data, and further combined\nwith the spatial distribution of regional crops. Based on a consideration of different forms\nof soil potassium input and soil potassium output, the potassium balance characteristics of\nfarmland soil in the study area were calculated, and their spatial distribution differences\nand influencing factors were analyzed, in order to provide references for rational potassium\nfertilizer application and improving soil potassium utilization efficiency in the region.\n\n\n**2. Materials and Methods**\n\n_2.1. Study Area_\n\n\nDue to the diverse planting structure and complex terrain conditions in hilly areas,\nthe management of soil potassium in these areas is often difficult. Therefore, the study\nof potassium balance in hilly areas is particularly important. This study was conducted\nin Shehong County, Sichuan Province, China, which is dominated by hilly terrain and\nlies between 105 _[◦]_ 10 _[′]_ E–105 _[◦]_ 40 _[′]_ E and 30 _[◦]_ 37 _[′]_ N–31 _[◦]_ 12 _[′]_ N (Figure 1). The altitude within\nthe territory ranges from 280 m to 664 m, and is high in the northwest and low in the\nsoutheast. This area belongs to the subtropical humid climate zone and has a mild climate.\nThe county covers 1496 km [2] and is a rich agricultural resource. Its total arable land area is\n70,060.87 hm [2] . According to China Soil System Classification (1995), the main soil-forming\n\n\n_Sustainability_ **2023**, _15_, 15348 3 of 16\n\n\nparent materials in this region are the Penglai Group soils and three gray-brown alluviumcovered soil types (purplish soils, paddy soils, and alluvial soils), and the main crop types\nare rice, corn, wheat, and rape.\n\n\n**Figure 1.** The location of the study area in Sichuan Province.\n\n\n_2.2. Soil Sample Collection and Laboratory Analysis_\n\n\nPotential sampling points were first identified indoors based on soil type, soil-forming\nparent material, and topographic factors. Then, based on reachability and the actual state\nof the sampling sites, 56 sampling points were identified (Figure 2). A global positioning\nsystem device was used to measure geographic coordinates and elevation at each location. Crop cultivation and other information for each site was also collected during field\ninvestigation. Three soil cores were randomly collected from each site using a standard\nEdelman auger with a diameter of 7 cm, and each soil sample weighed approximately\n1 kg. The samples were air-dried, after thorough homogenization and removal of roots and\nstone, and finely ground to pass through a sieve with openings smaller than 2 mm. Soil\nrapidly available potassium (RAK) was leached with 1.0 mol L _[−]_ [1] neutral NH 4 OAC at a 10:1\nwater–soil ratio and slowly available potassium (SAK) was leached with 1 mol L _[−]_ [1] boiling\nHNO 3 at a 10:1 water–soil ratio. The filtrate of soil sample solution was measured using\n\n\n_Sustainability_ **2023**, _15_, 15348 4 of 16\n\n\nthe flame photometric method [ 16 ]. Soil available potassium (AK) was the summation of\nRAK and SAK.\n\ni\n\n\n\n**Figure 2.** Study area: basic geographic information, and location of the soil sampling sites.\n\n\n_2.3. Cropping Pattern Extraction_\n\n\nMany sophisticated supervised classification algorithms have been developed to identify crop types with multiple vegetation indices [ 17 ]. Among them, the decision tree method\nis widely used to identify crop planting structure due to its high computational efficiency\nand strong regional applicability. Therefore, a decision tree classification process was\ndesigned to achieve a simple, fast, and accurate extraction of crop patterns (Figure 3). First,\nthe cloud-free Sentinel-2 L1C images from May 2018 to April 2019 were reprocessed using\nradiometric calibration, atmospheric correction, and resampling. The normalized difference\nvegetation index (NDVI) and modified chlorophyll absorption ratio index (MCARI), which\nare based on the phonological differences among rice, maize, wheat, and oilseed rape, were\nused to classify the croplands. The crop samples were constructed by combining visual\ninterpretations of the images with field investigation. Finally, the decision tree was trained\nusing the selected samples and classification features.\n\n\n\ni\n\n\n_Sustainability_ **2023**, _15_, 15348 5 of 16\n\n\n_2.4. Calculation of On-Farm Potassium Balance_\n\n\nThe input of farmland potassium includes: (1) Chemical fertilizer application: the\nsurvey data, provided by the County Agricultural Bureau, the Statistics Bureau, visiting\nfarmers, etc. The amount of field fertilizer application collected in this study is the compound fertilizer application amount, which does not include nitrogen fertilizer, phosphorus\nfertilizer, etc., and has been converted into the input amount of potassium fertilizer (K 2 O).\nDue to the organic fertilizer input from livestock and poultry manure and the fertilizer\nrange of the main grain crops in the study area being small, in this study, the input of\norganic manure from livestock and poultry manure for main grain crops was measured\nas 0; (2) Potassium amount brought into farmland by rainfall: the average value was\nobtained via reference literature. The annual averages for potassium in rice–rape, rice–\nwheat, single-season rice, and the other planting systems were 15.1 kg K ha _[−]_ [1] yr _[−]_ [1] [ 18 ],\n13.3 kg K ha _[−]_ [1] yr _[−]_ [1] [ 18 ], 6.5 kg K ha _[−]_ [1] yr _[−]_ [1] [ 18 ], and 8.3 kg K ha _[−]_ [1] yr _[−]_ [1] [ 19 ], respectively.\n(3) The amount of potassium deriving from irrigation water. The total potassium input was\ndetermined according to the total amount of irrigation water and the potassium content\nof the irrigation water. The potassium amount in rice–rape, rice–wheat and single-season\nrice through irrigation water was calculated as 23.25 kg K ha _[−]_ [1] yr _[−]_ [1] [ 18 ], 17.6 kg K ha _[−]_ [1]\n\nyr _[−]_ [1] [ 18 ], 17.8 kg K ha _[−]_ [1] yr _[−]_ [1] [ 18 ], respectively, and 14.8 kg K ha _[−]_ [1] yr _[−]_ [1] [ 19 ] under other\nplanting systems; (4) Soil potassium deriving from returning crop straw to the field: the\nrate of returning crop straw to the field in the study area was 48.8% [ 20 ] and the potassium\nnutrient content of the straw was 1.9%, 0.99%, 1.16%, and 2.01% [ 21 ] for rice, maize, wheat,\nand oilseed rape, respectively.\nWithout considering the loss of fertilizer, the potassium outputs from a farm consist\nof the amount of leaching and the amount of potassium uptake required for the desired\neconomic yield of the crop. In this study, the loss of soil potassium was mainly caused in\npaddy fields, so the amount of leaching was considered to be 10 kg ha _[−]_ [1] yr _[−]_ [1] [ 19 ] and\npotassium uptake by a crop was calculated using Equation (1):\n\n\n_n_\n### K = ∑ Y ∗ AKi / Si (1)\n\n_i_ = 1\n\n\nwhere _K_ is the potassium nutrient content (K 2 O) per unit area of crop uptake, kg hm _[−]_ [2] ; _i_ is\nthe value when the crop is present; _Y_ is the economic yield for a crop, and _AK_ is the amount\nof potassium nutrients required per unit economic yield of various crops. In this study, the\namount of potassium nutrients required per unit economic yield of rice, wheat, maize, and\nrape production were 26.3 kg t _[−]_ [1], 24.7 kg t _[−]_ [1], 21.6 kg t _[−]_ [1], and 58.1 kg t _[−]_ [1], respectively. _Si_\nis the sown area of each crop, which was obtained from the statistical yearbook.\nSoil potassium balance is the difference between soil potassium input and soil potassium output, i.e., soil potassium balance = potassium input—potassium output.\n\n\n_2.5. Spatial Analysis of Potassium Balance Based on Ordinary Kriging_\n\n\nOrdinary kriging is a linear geostationary method that produces a good interpolation when the soil dataset is normally distributed and meets the second-order smooth\nassumption or quasi-second-order smooth assumption. In this study, a normality test, a\nglobal trend test, and a spatial autocorrelation test were performed using ArcGIS10.6 (Esri,\nRedlands, CA, USA) to remove outliers and trend effects. Ordinary kriging interpolation\nwas then performed for RAK and SAK based on the parameters from the best fitted semivariance model. The interpolation performance was evaluated using the cross-validation\nmethod with normalized root mean square error (NRMSE).\n\n\n_Sustainability_ **2023**, _15_, 15348 6 of 16\n\n\n_2.6. The Relationships between Environmental Factors and Potassium Balance_\n2.6.1. Environmental Factors Acquisition\n\n\nThe climatic data, which consisted of mean annual temperature (MAT) and mean\nannual precipitation (MAP), were obtained from the National Meteorological Information\n[Center (http://data.cma.cn/site/index.html, accessed on 10 June 2020).](http://data.cma.cn/site/index.html)\nThe DEM data were derived from ASTER GDEM V2 global digital elevation data\n[downloaded from the Geospatial Data Cloud (http://www.gscloud.cn/, accessed on](http://www.gscloud.cn/)\n10 June 2020) with a spatial resolution of 30 m. Two topographic factors, regional slope and\nterrain relief, were extracted using the ArcGIS spatial analysis module.\nThe vector data for county-level administrative divisions, roads, and rivers were\nobtained from the National Geographic Information Resources Catalog Service System\n[(http://www.webmap.cn/, accessed on 10 June 2020) and the population density grid data](http://www.webmap.cn/)\nwere obtained from the shared service platform of the National Earth System Science Data\n[Center (http://www.geodata.cn/, accessed on 10 June 2020).](http://www.geodata.cn/)\n\n\n2.6.2. Effects of Environmental Factors on Potassium Balance\n\n\nFirstly, the area was graded to generate a 500 m _×_ 500 m grid pattern and soil potassium input, potassium output, potassium balance, and crop areas of different crop fields\nwithin the grid were determined. The environmental factors, such as MAT, MAP, elevation,\nslope, topographic relief, average road density, and average population density, were then\nextracted within the grid. Correlations between the environmental factors and potassium\nbalance were analyzed using SPSS data analysis software (IBM SPSS Statistics19, IBM,\nSomers, NY, USA). MAT and MAP were categorized as climatic factors. Elevation, slope,\nand topographic relief were categorized as topographic factors, whereas average road\ndensity and average population density were categorized as anthropogenic activity factors.\nThe structural equation model (SEM) was constructed from these potassium balance indicators using AMOS software (IBM PSAS AMOS 21, IBM, Chicago, IL, USA) to predict\nthe interactions between soil potassium balance and environmental factors such as climate,\ntopography, anthropogenic activity, and AK content of the soil.\nThe SEM used several model fitness parameters to judge the reasonableness of the\nmodel. These were chi-square ( χ [2] ), degrees of freedom (df), gradient, root mean square error\nof approximation (RMSEA), and the goodness-of-fit index (GFI). The chi-square ( χ [2] ) test,\ndegrees of freedom (df), gradient index, root mean square error of approximation (RMSEA),\nand goodness-of-fit index (GFI) are critical metrics in evaluating a model. Specifically,\nthe chi-square ( χ [2] ) test gauges the divergence between observed and model-predicted\ndata. A significant χ [2] value indicates that the model does not adequately represent the\nobserved data, necessitating adjustments in model structure or parameters. Degrees of\nfreedom (df) measure the model _[′]_ s complexity by indicating how many parameters can\nbe freely modified. A lower df value relative to sample size suggests a simpler model,\nthereby reducing the risk of overfitting. Meanwhile, the gradient index helps assess the\ndegree of maximum likelihood optimization in the model; a smaller gradient signifies\nbetter optimization, while a larger one suggests the need for further refinement. RMSEA\nevaluates the model _[′]_ s fit quality, accounting for its complexity, and assesses the closeness\nbetween the model-predicted and actual observed covariance matrices. Lower RMSEA\nvalues imply a better fit, while higher values suggest the contrary. Lastly, the GFI offers a\ncomprehensive assessment, reflecting how closely the model _[′]_ s predicted covariance matrix\naligns with the observed one. A higher GFI score indicates a better model fit. Collectively,\nthese metrics serve as a multi-faceted framework for evaluating structural equation models\n(SEM), aiding in determining model plausibility, identifying areas for improvement, and\nverifying the model _[′]_ s accuracy for interactions between environmental factors and soil\npotassium balance. The formulae of χ [2], RMSEA, GFI are as follows [22]:\n\n\n_χ_ [2] = ( _N_ _−_ 1 ) / _f_ (2)\n\n\n_Sustainability_ **2023**, _15_, 15348 7 of 16\n\n\n\n_RMSEA_ =\n\n\n\n�\n\n\n\n_max_ ( _χ_ [2] _−_ _d f_, 0 )\n\n(3)\n_d f_ ( _N_ _−_ 1 )\n\n\n\n_ρ_\n_GFI_ =\n\n\n\n2 _−_ _d f_ (4)\n\n_N_ _−_ 1 ~~�~~\n\n\n\n_χ_ 2 _−_ _d f_\n_ρ_ + 2 ~~�~~ _N_ _−_ 1\n\n\n\nIn the formulae: _N_, sample size; _f_, minimized discrepancy function; _df_, degrees of\nfreedom; _ρ_, number of observed variables. When these parameters satisfied χ [2] /df < 3,\nRMSEA < 0.08, and GFI > 0.9, then the model was considered to be reasonably fit.\n\n\n**3. Results**\n\n_3.1. Spatial Distribution Characteristics of Cropping Patterns_\n\n\nThe spatial distributions of the main four crop types were extracted from the decision\ntree. The extraction accuracy for rice, maize, rape, and wheat were 89.36%, 87.16%, 87.85%,\nand 84.65%, respectively, when compared to the Statistical Yearbook. The extraction areas\nwere 9705.22 ha, 16,147.55 ha, 5443.56 ha, and 17,414.04 ha for rice, maize, rape, and\nwheat, respectively, and the maize and wheat cultivation areas were much greater than\nthose of rice and rape (Figure 4). The distributions of the rice–rape rotation, rice–wheat\nrotation, rape–maize rotation, and wheat–maize rotation areas were obtained using the\nspatially overlaid method. The rice–rape rotation, rice–wheat rotation, rape–maize rotation,\nand wheat–maize rotation areas were 896.76 ha, 1868.92 ha, 833.48 ha, and 2106.52 ha,\n~~respectively. Maize and wheat were the main cultivated crops in the study area and the~~ y\naccounted for the largest crop areas in every township.\n\n\n**Figure 4.** Distributions of the different cropping patterns. ( **a** ) The cropping patterns map, ( **b** ) the\nproportions of different crop systems in different districts and counties.\n\n\n_3.2. Spatial Distribution of Soil Available Potassium_\n\n\nThe spatial distributions of soil RAK and SAK in the study area were determined by\nkriging interpolation (Figure 5). Kriging performed well in providing reliable estimates of\nspatial distributions of RAK and SAK, with MSE lower than 0.04 and RMMSE closer to 1.\nThe value of RAK content ranged from 29.37 to 122.07 mg kg _[−]_ [1], with an average value of\n63.63 mg kg _[−]_ [1], and the soil SAK content ranged from 472.31 to 772.77 mg kg _[−]_ [1], with an\naverage value of 649.77 mg kg _[−]_ [1] (Table 1). According to the fertility grading standard of\nthe second national soil census, the soil RAK content in the study area was classified as low\nlevel, and the soil SAK was generally at a low or moderate level. The spatial distribution of\nsoil RAK was generally characterized as high in the central townships and low in the north\nand south townships, similarly to the spatial distribution of soil SAK.\n\n\n_Sustainability_ **2023**, _15_, 15348 8 of 16\n\n\n**Figure 5.** Spatial distribution of soil available potassium.\n\n\n**Table 1.** Geostatistical analysis of RAK and SAK.\n\n\n\n**Soil** **Min.** **Max.** **Mean**\n**Potassium** **(mg/kg)** **(mg/kg)** **(mg/kg)**\n\n\n\n**Standard**\n\n**Deviation**\n**(mg/kg)**\n\n\n\n**Nugget**\n**Effect**\n\n**(%)**\n\n\n\n**Range**\n**RMMSE** **MSE**\n**(km)**\n\n\n\nRAK 29.37 122.07 63.63 11.90 78.18 7.28 1.04 0.04\n\nSAK 472.31 772.77 649.77 46.43 53.72 19.31 0.99 0.01\n\n\nNote: RAK means rapid available potassium; SAK means slowly available potassium; AVG means average value;\nMSE means mean standardized error; RMSSE means root mean square standardized error.\n\n\nThe nugget effects of RAK and SAK were greater than 50%, revealing strong spatial\nvariability of soil available potassium, which indicated that anthropogenic activity, such as\ncropping pattern and field fertilization, had a greater influence than natural environmental\nfactors. The nugget effect of SAK was 53.72%, which was lower than that of RAK, suggesting that SAK was less influenced by anthropogenic activity because its morphology is more\n~~stable and it includes the part that could not be directly absorbed and utilized by crops.~~\n\n\n_3.3. Spatial Distribution of Soil Potassium Balance_\n\n\nThe results for the different sources of soil potassium showed that they were significantly different under the various cropping patterns (Table 2). Specifically, under the same\ncropping pattern, the overall order for potassium input from the different sources was\nstraw return > irrigation water > rainfall input. All three sources of potassium input, i.e.,\nrainfall input, irrigation water, and straw, were highest in the rice–rapeseed rotation, at\n15.10, 23.30, and 57.91 kg K ha _[−]_ [1] yr _[−]_ [1], respectively. However, rainfall input was lowest\nfor the rice monoculture (6.50 kg K ha _[−]_ [1] yr _[−]_ [1] ) and irrigation water was lowest under the\nmaize monoculture, wheat monoculture, rapeseed monoculture, rapeseed–maize rotation,\nand wheat–maize rotation (14.80 kg K ha ~~_[−]_~~ ~~[1]~~ yr ~~_[−]_~~ ~~[1]~~ ). The potassium input from straw was\nlowest under the wheat monoculture (13.73 kg K ha _[−]_ [1] yr _[−]_ [1] ).\n\n\n_Sustainability_ **2023**, _15_, 15348 9 of 16\n\n\n**Table 2.** Soil potassium inputs under different cropping patterns (kg K ha _[−]_ [1] yr _[−]_ [1] ).\n\n\n**Cropping Pattern** **Rainfall** **Irrigation Water** **Straw**\n\n\nRice monocrop 6.5 17.8 38.88\nMaize monocrop 8.3 14.8 15.55\nWheat monocrop 8.3 14.8 13.73\nRape monocrop 8.3 14.8 19.03\nRice–rape rotation 15.1 23.3 57.91\nRice–wheat rotation 13.3 17.6 52.61\n\nRape–maize rotation 8.3 14.8 34.58\nWheat–maize rotation 8.3 14.8 29.28\n\n\nThe total soil potassium input and the potassium inputs from each township were\n~~counted. The results showed that the annual potassium input mostly ranged from 63.83 to~~\n100 kg K ha _[−]_ [1] yr _[−]_ [1] in the study area. There were a few areas where the annual potassium\ninput was greater than 220 kg K ha _[−]_ [1] yr _[−]_ [1] (Figure 6a). The areas with an annual potassium\ninput of less than 100 kg K ha _[−]_ [1] yr _[−]_ [1] were mainly located in the hilly townships at the\nedge of the study area and the areas > kg K ha _[−]_ [1] yr _[−]_ [1] were mainly in the central part of\nthe study area.\n\n\n**Figure 6.** Spatial distribution maps of potassium input ( **a** ), potassium output ( **b** ), and potassium\nbalance ( **c** ).\n\n\nThe data on potassium uptake by crops were obtained from the literature rather than\nfield measurements and differences between crop varieties were not considered. This\nmeant that cropping pattern was the main reason for the spatial distribution differences\nin potassium output (Figure 6b). Annual soil potassium output in the study area mostly\nranged from 100–204 kg K ha _[−]_ [1] yr _[−]_ [1] and the potassium output of each township ranged\nfrom 129.27–144.33 kg K ha _[−]_ [1] yr _[−]_ [1] .\nThe soil potassium balance for farmland ranged from _−_ 187.22 to 101.81 kg K ha _[−]_ [1]\n\nyr _[−]_ [1] and the largest soil potassium deficit was in the southwest of the study area. Soil\npotassium achieved balance in the northeast and was in surplus in the central part of the\nstudy area, with a maximum of 101.81 kg K ha _[−]_ [1] yr _[−]_ [1] (Figure 6). The soil potassium\nbalance results for the different cropping patterns showed that the rapeseed–maize rotation\nhad the most severe deficit at 129.50 kg K ha _[−]_ [1] yr _[−]_ [1] (Table 3). The difference in soil\npotassium deficit between the rice–rapeseed and wheat–maize rotations was not significant,\nat 46.79 kg K ha _[−]_ [1] yr _[−]_ [1] and 44.07 kg K ha _[−]_ [1] yr _[−]_ [1], respectively. Only the rice–wheat rotation\nshowed a potassium surplus. Low potassium uptake by crops in the monoculture systems\n~~meant that the soil potassium balance was higher for the monoculture systems than for the~~\n\n\n_Sustainability_ **2023**, _15_, 15348 10 of 16\n\n\nrotation systems. The oilseed rape areas were generally deficient in potassium by around\n–70.12 kg K ha _[−]_ [1] yr _[−]_ [1], which was a higher deficit than those of the rice–rapeseed and\nwheat–maize rotations.\n\n\n**Table 3.** Soil potassium balances for each cropping pattern.\n\n\n**K Input** **K Output** **K Balance**\n\n**Cropping Pattern** **Per Hectare** **Per Hectare** **Per Hectare**\n\n**Total (t)** **Total (t)** **Total (t)**\n**(kg K yr** _[−]_ **[1]** **)** **(kg K yr** _[−]_ **[1]** **)** **(kg K yr** _[−]_ **[1]** **)**\n\n\nRice monocrop 890.30 137.92 752.66 116.60 137.65 21.32\nMaize monocrop 1163.48 88.69 1624.03 123.80 _−_ 460.554 _−_ 35.11\nWheat monocrop 1580.23 115.74 1366.72 100.10 213.51 15.64\nRapeseed monocrop 306.37 86.98 553.39 157.10 _−_ 247.01 _−_ 70.12\nRice–rapeseed rotation 255.09 216.90 310.12 263.70 _−_ 55.03 _−_ 46.79\nRice–wheat rotation 572.05 238.28 496.23 206.70 75.818 31.58\nRapeseed–maize rotation 133.92 151.40 248.46 280.90 _−_ 114.543 _−_ 129.50\nWheat–maize rotation 378.89 179.82 471.749 223.90 _−_ 92.859 _−_ 44.07\n\n\n_3.4. Analysis of Factors Influencing Potassium Balance in Farmland Soils_\n\n\nTable 4 presents the average balance values of soil potassium within a 500-m grid,\nas well as its relationships with the average values of associated influencing factors. The\nresearch area is divided grid-by-grid, with each grid serving as a sample point. Through\ncorrelation analysis of these sample points, we identified the correlation between soil\npotassium balance and various influencing factors, as shown in Table 4. Pearson’s correlation analysis showed that all environmental factors except MAT showed significant\nor highly significant correlations with soil potassium balance (Table 4). Therefore, MAP,\nelevation, slope, population density, road density, and AK content were incorporated into\nthe subsequent analysis.\n\n\n**Table 4.** Pearson’s correlation analyses among soil potassium balance and the various environmen\ntal factors.\n\n\n**K Balance** **MAT** **MAP** **Elevation** **Slope** **Aspect** **Population** **Road** **AK**\n**Density** **Density**\n\n\nK balance 1 _−_ 0.002 _−_ 0.085 ** _−_ 0.062 ** _−_ 0.034 * 0.067 ** 0.131 ** 0.054 * 0.0144 **\n\nMAT _−_ 0.002 1 0.881** _−_ 0.853 ** _−_ 0.435 ** _−_ 0.017 0.162 ** _−_ 0.019 0.076 **\n\nMAP 0.085 ** 0.881 ** 1 _−_ 0.734 ** _−_ 0.344 ** _−_ 0.023 * 0.107 ** _−_ 0.036 0.177 **\n\nElevation _−_ 0.062 ** _−_ 0.853 ** _−_ 0.734 ** 1 0.604 ** 0.037 ** _−_ 0.189 ** _−_ 0.010 _−_ 0.030 **\nSlope _−_ 0.034 * _−_ 0.435 ** _−_ 0.34 4** 0.604 ** 1 0.017 _−_ 0.123 ** _−_ 0.003 0.035 **\nAspect 0.067 ** _−_ 0.017 _−_ 0.023 * 0.037 ** 0.017 1 _−_ 0.046 ** 0.024 _−_ 0.017\nPopulation density 0.131 ** 0.162 ** 0.107 ** _−_ 0.189 ** _−_ 0.123 ** _−_ 0.046 ** 1 0.056 ** 0.161 **\nRoad density 0.054 * _−_ 0.019 _−_ 0.036 _−_ 0.010 _−_ 0.003 0.024 0.056 ** 1 0.033\nAK _−_ 0.144 ** 0.076 ** _−_ 0.177 ** _−_ 0.030 ** 0.035 ** _−_ 0.017 0.161 ** 0.033 1\n\n\nNote: MAT means mean annual temperature; MAP means mean annual precipitation; AK means soil available\npotassium; * and ** indicate t-test significant correlations at the 0.05 and 0.01 levels, respectively.\n\n\nThe slope direction and topographic factor variables were not significant, so they\nwere excluded from the SEM model. The overall fit index of the final SEM model was\nχ [2] /df = 1.392, RMSEA = 0.009, and GFI = 1.000 (Figure 7), which satisfied the requirements\nfor goodness of fit between the theoretical model and the data ( χ [2] /df < 2, RMSEA < 0.1,\nGFI > 0.9), indicating that the constructed model was reliable. The contribution made by\nthe environmental factors to the soil potassium balance was 20.8% (Figure 7). Specifically,\nthe topographic factor had a direct positive effect of 0.243 on the potassium balance and\nindirect effects of _−_ 0.263, 0.063, and 0.011 for the anthropogenic activity factor, average\nannual precipitation, and soil AK content, respectively. Therefore, the total effect of the\ntopographic factor on the potassium balance was 0.053. The anthropogenic activity factor\nhad a direct positive effect of 0.559 on the potassium balance. Its indirect positive effect on\n\n\n_Sustainability_ **2023**, _15_, 15348 11 of 16\n\n\nthe potassium balance through its effects on soil AK was 0.238, leading to a total effect on\nthe potassium balance of 0.797. However, MAP had a direct negative effect of _−_ 0.100 on\nthe potassium balance and an indirect negative effect of _−_ 0.029 through its effect on soil\nAK content, resulting in a total effect of _−_ 0.129 on the potassium balance. The soil AK had\na direct positive effect of 0.408 on the potassium balance.\n\n\n**Figure 7.** Structural equation model for K balance and the environmental factors. ( **a** ) Structural\nequation model for K balance and the environmental factors, ( **b** ) the standard effects of topography,\nanthropogenic factors, MAP and AK. Note: MAP means mean annual precipitation; AK means soil\navailable potassium; *** indicates extremely significant effects ( _p_ < 0.001).\n\n\n**4. Discussion**\n\n\nIn this study, both the NDVI and the MCARI were used to construct the decisiontree-based crop distribution extraction model. Rice and maize have different climatic\ncharacteristics, which means that they are well distinguished by the NDVI during their\ndifferent growth periods [ 23 ]. Wheat and oilseed rape are similar to each other due to\ntheir growth cycles, which means that it is not appropriate to use the NDVI to distinguish\nbetween them. However, wheat and rape were separated by applying MCARI thresholds,\nwhich can discern significant differences between wheat and rape during their growth\ncycles [ 24 ]. The final extraction accuracies of the four crops, i.e., rice, maize, oilseed rape,\nand wheat, were more than 85%, indicating that the decision tree constructed in this study\nperformed well [ 25 ]. The maize and wheat areas in the study area were much larger than\nthe rice and oilseed rape areas, while the extracted crop rotation area was lower, which is\nprobably due to local planting history, soil properties, and other factors [26].\nThe mean value for soil RAK in the study area was 63.63 mg kg _[−]_ [1] (Table 1), the mean\nsoil RAK in the Yujiang hilly area of Jiangxi is 74.00 mg kg _[−]_ [1] [ 27 ], and the Pearl River\nDelta hilly area value is 77.80 mg kg _[−]_ [1] [ 28 ], which are all below the potassium deprivation\nthreshold of 80 mg kg _[−]_ [1] [ 4 ]. This is mainly due to the long history of intensive cropping\nactivity in the hilly areas of China. Crops such as maize, rape, and rice have high potassium\ndemands for growth. However, potassium fertilizer inputs have been neglected for a\nlong time in the areas in which these crops are grown, and this has led to the depletion\nof potassium reserves in the soil [ 9, 29, 30 ]. SAK, an important component of the soil AK\nreserve, is dynamically converted from partially slowly available to RAK when the soil\nis deficient in RAK [ 31 ]. However, soil SAK content in the study area was generally low\nor moderate, indicating the need for exogenous supplemental potassium inputs to meet\ncrop-growth requirements. The spatial distribution of soil RAK in the study area showed\nthat it was generally at a high level in the central townships and low in the northern and\nsouthern townships, suggesting that factors such as crop cultivation, field fertilization,\nand topography may have caused intra-regional differences in potassium content. SAK\ncontent was significantly high in central and east townships and low in the north and\n\n\n_Sustainability_ **2023**, _15_, 15348 12 of 16\n\n\nsouth townships, mainly because its more stable nature is significantly influenced by\nnatural factors.\n\nIn various crop rotation systems, significant differences exist in the sources of soil\npotassium, such as straw recycling, irrigation water, and rainfall input. Taking the rice–\nrapeseed rotation model as an example, all sources of potassium input are highest in this\nsystem, particularly straw recycling, which contributes up to 57.91 kg K ha _[−]_ [1] yr _[−]_ [1] . This\nhigh input is likely attributable to the abundant organic matter provided by straw recycling,\nthereby elevating the potassium content in the soil [ 32 ]. Specific fertilizer management\npractices may have been adopted in the rice–rapeseed rotation model, as existing research\ndemonstrates that appropriate use of potassium fertilizers can increase soil potassium\nlevels [ 33 ]. Concurrently, soil types also influence potassium content and availability. For\ninstance, clay soils usually retain potassium more effectively than sandy soils, which might\nlead to potassium leaching [ 34 ]. This study found that the most severe potassium deficiency\noccurred in the rapeseed–maize rotation model, while the deficiency was comparably mild\nin the rice–rapeseed and wheat–maize rotation models; only the rice–wheat rotation model\nshowed a surplus of potassium. These variations are likely due to the differential demand\nand utilization efficiency of potassium among various crops and also depend on the stage\nof crop growth [ 35 ]. Lastly, compared to monoculture systems, crops in rotation systems\ngenerally exhibit higher demand for and utilization of potassium. In monoculture systems,\ncrops usually have lower potassium uptake, resulting in a higher soil potassium balance.\nThis, in turn, affects the overall soil potassium balance in the system [9,36].\nIn general, the higher the altitude, the lower the temperature, which is not conducive\nto the normal growth of crops such as maize, rape, and rice [ 37 ], and the greater the slope,\nthe more severe the soil erosion and the greater the labor input required [ 38, 39 ]. Thus,\nthe high altitude and slope topographic factors lead to reduced cropping activity and\ndecreased potassium export, whereas topography is significantly and positively correlated\nwith potassium balance (Figure 7). In addition, topography is one of the determinants of soil\nwater, nutrients, and temperature redistribution in certain regions [ 40, 41 ]; therefore, it also\nhas an indirect effect on potassium balance by affecting natural factors, such as MAP and\nsoil AK content. For example, Liu et al. [ 42 ] showed that precipitation on the northeastern\nslope of the Tibetan Plateau was negatively related to altitude. Furthermore, sufficient\nprecipitation can enhance crop productivity and thus potassium uptake [ 43 ], but it can\nalso increase AK leaching loss from soil [ 3, 44 ]; therefore, precipitation has a negative effect\non soil AK content and potassium balance. Anthropogenic factors influence soil AK and\npotassium balance mainly through planting intensity and fertilizer management. On the\none hand, the greater the road density, the more convenient the agricultural mechanization\noperation [ 45 ], while higher population density leads to greater food demand. Thus, high\nroad and population densities increase crop planting intensity and aggravate potassium\noutput. But, on the other hand, increased road density also promotes fertilizer management\nactivity, and potassium fertilizer applications directly increase potassium inputs and the\neffective soil potassium content. Ultimately, the results from this study show that the\ncombined effects of topography, precipitation, and anthropogenic factors led to soil AK\ncontent having a highly significant positive effect on potassium balance.\nIn the present study, topography, anthropogenic activities, precipitation, and soil\neffective potassium content explained 20.8% of the variation in potassium balance, but\n79.2% remained unexplained. This unexplained portion may be related to differences\nin soil particle composition, basic chemical properties, and mineralogical characteristics.\nSoil particles are the basic structure of the soil porous medium and their composition is\nclosely linked to the physical, chemical, and biological properties of soil. Previous studies\nhave reported that fine particles (clay and powder) are the physical conservators of soil\npotassium and that the proportion of fine particles is an important factor controlling the\nvariation of soil potassium content [ 46, 47 ]. Zhuang et al. [ 48 ] pointed out that during\nseepage, fine particles migrate between large voids, leading to soil physical erosion, and the\nloss of potassium ions leads to chemical dissolution. Furthermore, soil particle composition\n\n\n_Sustainability_ **2023**, _15_, 15348 13 of 16\n\n\ncan also have an impact on crop growth [ 49 ]. For example, Huang et al. [ 50 ] showed that\nplant numbers and biomass were significantly greater in finer-grained soils. In addition, as\nimportant indicators of basic soil properties, adequate soil cation exchange, soil organic\nmatter levels, and an appropriate pH not only ensure normal plant growth, but also\ninfluence soil potassium fixation and uptake capacity through ion exchange with Al [3+], Ca [2+],\nand Mg [2+] [ 51 ]. Similarly, clay minerals can be involved in potassium balance processes\nthrough ion exchange, dissolution release, and colloidal sorption [ 9, 52, 53 ], and the effects\nof different types of minerals on soil potassium are not uniform. For instance, 2:1 clay\nminerals are generally a reservoir of potassium in the soil, but are converted to vermiculite,\nchlorite, etc., when potassium becomes depleted [ 54 ]. Therefore, the above unexplained\nfactors may have contributed to the fact that only 20.8% of variation in potassium balance\nwas fully explained in the structural equation model, and should be explored in depth in\nfuture studies.\n\n\n**5. Conclusions**\n\n\nIn this study, the spatial structure of the main crops within the study area was extracted using a decision tree algorithm based on multi-temporal Sentinel-2A imagery. The\naccuracy for crop extraction ranged from 84.65% to 89.36%, as compared to data from the\nStatistical Yearbook. The average amount of readily available potassium (RAK) in the soil\nwas 63.63 mg kg _[−]_ [1], while that of slowly available potassium (SAK) stood at 649.77 mg kg _[−]_ [1] .\nThe spatial distribution patterns of both RAK and SAK in the soil predominantly exhibited\nhigh levels in the central townships and lower concentrations in the northern and southern\ntownships. The soil potassium balance outcomes for various cropping patterns varied\nfrom _−_ 187.22 to 101.81 kg K ha _[−]_ [1] yr _[−]_ [1], with the rape–maize rotation showing the most\nsignificant potassium deficit. Climate, topography, human activity, and soil AK together\nexplained about 20% of the variation in soil potassium balance. Unexplained variations in\nthe results are likely attributable to the omission of additional crops, such as vegetables\nand sweet potatoes. The differences in potassium input and output patterns for these\nunaccounted crops, as compared to the crops identified through remote sensing images,\nmay have had some impact on the study results. Furthermore, the unexplained variation\nmay also be attributed to the fact that the calculated potassium inputs and outputs were\nprimarily derived from pertinent literature and field surveys, without taking into account\nthe contribution of soil potassium supplementation through organic fertilizers, such as\nlivestock and poultry manure. Hence, future studies should aim to acquire more precise\ndata regarding regional cropping patterns and the specific parameters employed in potassium balance calculations. This would help to better elucidate the factors affecting soil\npotassium balance and establish a solid theoretical foundation for the precise management\nof soil potassium fertility.\n\n\n**Author Contributions:** Conceptualization, S.W. and T.L.; Methodology, S.W. and P.P.; Data Collection,\nZ.L.; Analysis and Interpretation of Results, L.L. and G.W.; Visualization, Y.X.; Draft Manuscript\nPreparation, S.W.; Funding Acquisition, Q.L.; S.W. and Z.L. contributed equally to this work and\nshould be considered co-first authors. All authors have read and agreed to the published version of\nthe manuscript.\n\n\n**Funding:** This research was funded by the strategic priority research program of the Chinese\nAcademy of Sciences (grant number: XDA23090501).\n\n\n**Institutional Review Board Statement:** Not applicable.\n\n\n**Informed Consent Statement:** Not applicable.\n\n\n**Data Availability Statement:** No new data has been created.\n\n\n**Conflicts of Interest:** The authors declare no conflict of interest.\n\n\n_Sustainability_ **2023**, _15_, 15348 14 of 16\n\n\n**References**\n\n\n1. Soumare, A.; Sarr, D.; Diedhiou, A.G. Potassium sources, microorganisms and plant nutrition: Challenges and future research\ndirections. _Pedosphere_ **2023**, _33_ [, 105–115. [CrossRef]](https://doi.org/10.1016/j.pedsph.2022.06.025)\n2. Zörb, C.; Senbayram, M.; Peiter, E. Potassium in agriculture—Status and perspectives. _J. Plant Physiol._ **2014**, _171_, 656–669.\n\n[[CrossRef] [PubMed]](https://doi.org/10.1016/j.jplph.2013.08.008)\n3. Li, T.; Liang, J.; Chen, X.; Wang, H.; Zhang, S.; Pu, Y.; Xu, X.; Li, H.; Xu, J.; Wu, X.; et al. The interacting roles and rel-ative\nimportance of climate, topography, soil properties and mineralogical composition on soil potassium variations at a national scale\nin China. _Catena_ **2021**, _196_ [, 104875. [CrossRef]](https://doi.org/10.1016/j.catena.2020.104875)\n4. He, P.; Yang, L.; Xu, X.; Zhao, S.; Chen, F.; Li, S.; Tu, S.; Jin, J.; Johnston, A.M. Temporal and spatial variation of soil available\npotassium in China (1990–2012). _Field Crop. Res._ **2015**, _173_ [, 49–56. [CrossRef]](https://doi.org/10.1016/j.fcr.2015.01.003)\n5. Liu, F.; Wu, H.; Zhao, Y.; Li, D.; Yang, J.; Song, X.; Shi, Z.; Zhu, A.; Zhang, G. Mapping high resolution National Soil Information\nGrids of China. _Sci. Bull._ **2022**, _67_ [, 328–340. [CrossRef] [PubMed]](https://doi.org/10.1016/j.scib.2021.10.013)\n6. Li, T.; Wang, H.; Wang, J.; Zhou, Z.; Zhou, J. Exploring the potential of phyllosilicate minerals as potassium fertilizers using\nsodium tetraphenylboron and intensive cropping with perennial ryegrass. _Sci. Rep._ **2015**, _5_ [, 9249. [CrossRef] [PubMed]](https://doi.org/10.1038/srep09249)\n7. Xi, S.; Chu, H.; Zhou, Z.; Li, T.; Zhang, S.; Xu, X.; Pu, Y.; Wang, G.; Jia, Y.; Liu, X. Effect of potassium fertilizer on tea yield and\nquality: A meta-analysis. _Eur. J. Agron._ **2023**, _144_ [, 126767. [CrossRef]](https://doi.org/10.1016/j.eja.2023.126767)\n8. Yadav, S.K.; Benbi, D.K.; Toor, A.S. Effect of long-term application of rice straw, farmyard manure and inorganic ferti-lizer on\npotassium dynamics in soil. _Arch. Agron. Soil Sci._ **2019**, _65_ [, 374–384. [CrossRef]](https://doi.org/10.1080/03650340.2018.1505040)\n9. Das, D.; Sahoo, J.; Raza, M.B.; Barman, M.; Das, R. Ongoing soil potassium depletion under intensive cropping in India and\nprobable mitigation strategies. A review. _Agron. Sustain. Dev._ **2022**, _42_ [, 4. [CrossRef]](https://doi.org/10.1007/s13593-021-00728-6)\n10. Nguyen, T.T.; Sasaki, Y.; Aizawa, M.; Kakuda, K.; Fujii, H. Potassium balance in paddy fields under conventional rice straw\nrecycling versus cow dung compost application in mixed crop–livestock systems in Japan. _Soil Sci. Plant Nutr._ **2023**, _69_, 36–44.\n\n[[CrossRef]](https://doi.org/10.1080/00380768.2022.2141052)\n11. Oenema, O.; Kros, H.; de Vries, W. Approaches and uncertainties in nutrient budgets: Implications for nutrient manage-ment and\nenvironmental policies. _Eur. J. Agron._ **2003**, _20_ [, 3–16. [CrossRef]](https://doi.org/10.1016/S1161-0301(03)00067-4)\n12. Li, Y.; Xia, G.; Wu, Q.; Chen, W.; Lin, W.; Zhang, Z.; Chen, Y.; Chen, T.; Siddique, K.H.M.; Chi, D. Zeolite increases grain yield and\npotassium balance in paddy fields. _Geoderma_ **2022**, _405_ [, 115397. [CrossRef]](https://doi.org/10.1016/j.geoderma.2021.115397)\n13. Zhang, Z.; Liu, D.; Wu, M.; Xia, Y.; Zhang, F.; Fan, X. Long-term straw returning improve soil K balance and potassium supplying\nability under rice and wheat cultivation. _Sci. Rep._ **2021**, _11_ [, 22260. [CrossRef] [PubMed]](https://doi.org/10.1038/s41598-021-01594-8)\n14. Linquist, B.A.; Campbell, J.C.; Southard, R.J. Assessment of potassium soil balances and availability in high yielding rice systems.\n_Nutr. Cycl. Agroeco._ **2022**, _122_ [, 255–271. [CrossRef]](https://doi.org/10.1007/s10705-022-10200-w)\n15. Liu, Y.; Ma, J.; Ding, W.; He, W.; Lei, Q.; Gao, Q.; He, P. Temporal and spatial variation of potassium balance in agri-cultural land\nat national and regional levels in China. _PLoS ONE_ **2017**, _12_, e184156.\n16. Lu, R. _Methods of Soil and Geochemistry Analysis_ ; China Agricultural Science and Technology Press: Beijing, China, 2000;\npp. 62–141.\n17. Gao, Z.; Guo, D.; Ryu, D.; Western, A.W. Training sample selection for robust multi-year within-season crop classifica-tion using\nmachine learning. _Comput. Electron. Agric._ **2023**, _210_ [, 107927. [CrossRef]](https://doi.org/10.1016/j.compag.2023.107927)\n18. Xia, Y.; Liu, D.; Zhang, F.; Xiong, G.; Duan, X.; Wu, M.; Fan, X. Potassium balance in the agroecosystem of the main cropping\nsystems in Hubei Province. _Chin. J. Ecol._ **2014**, _33_ [, 2395–2401. [CrossRef]](https://doi.org/10.13292/j.1000-4890.2014.0153)\n19. Li, S.; Jin, J. Characteristics of Nutrient Input/Output and Nutrient Balance in Different Regions of China. _Sci. Agric. Sin._ **2011**, _44_,\n4207–4229.\n\n20. He, X. Current Situation and Countermeasures of Comprehensive Utilization of Crop Straw in Suining City. _Mod. Agric. Sci._\n_Technol._ **2018**, 179–180.\n21. Liu, X. Study on Nutrients Balance and Requirement in Agriculture Production in China. Ph.D. Thesis, Chinese Academy of\nAgricultural Sciences, Beijing, China, 2018.\n22. West, S.G.; Taylor, A.B.; Wu, W. Model Fit and Model Selection in Structural Equation Modeling. In _Handbook of Structural Equation_\n_Modeling_ ; The Guilford Press: New York, NY, USA, 2012; pp. 209–231.\n23. Li, X.; Jiang, Q. Extraction of farmland classification based on multi-temporal remote sensing data. _Nongye Gongcheng Xuebao/Trans._\n_Chin. Soc. Agric. Eng._ **2015**, _31_, 145–150.\n24. Mercier, A.; Betbeder, J.; Baudry, J.; Le Roux, V.; Spicher, F.; Lacoux, J.; Roger, D.; Hubert-Moy, L. Evaluation of Sen-tinel-1 & 2\ntime series for predicting wheat and rapeseed phenological stages. _ISPRS J. Photogramm._ **2020**, _163_ [, 231–256. [CrossRef]](https://doi.org/10.1016/j.isprsjprs.2020.03.009)\n25. Hafeez, M.A.; Rashid, M.; Tariq, H.; Abideen, Z.U.; Alotaibi, S.S.; Sinky, M.H. Performance Improvement of Decision Tree: A\nRobust Classifier Using Tabu Search Algorithm. _Appl. Sci._ **2021**, _11_ [, 6728. [CrossRef]](https://doi.org/10.3390/app11156728)\n26. Liu, J.; Yang, K.; Tariq, A.; Lu, L.; Soufan, W.; El Sabagh, A. Interaction of climate, topography and soil properties with cropland\nand cropping pattern using remote sensing data and machine learning methods. _Egypt. J. Remote Sens. Space Sci._ **2023**, _26_, 415–426.\n\n[[CrossRef]](https://doi.org/10.1016/j.ejrs.2023.05.005)\n\n\n_Sustainability_ **2023**, _15_, 15348 15 of 16\n\n\n27. Li, P.; Zhang, T.; Wang, X.; Yu, D. Development of biological soil quality indicator system for subtropical China. _Soil Tillage Res._\n**2013**, _126_ [, 112–118. [CrossRef]](https://doi.org/10.1016/j.still.2012.07.011)\n28. Wang, R.; Zou, R.; Liu, J.; Liu, L.; Hu, Y. Spatial Distribution of Soil Nutrients in Farmland in a Hilly Region of the Pearl River\nDelta in China Based on Geostatistics and the Inverse Distance Weighting Method. _Agriculture_ **2021**, _11_ [, 50. [CrossRef]](https://doi.org/10.3390/agriculture11010050)\n29. Ren, T.; Lu, J.; Li, H.; Zou, J.; Xu, H.; Liu, X.; Li, X. Potassium-fertilizer management in winter oilseed-rape production in China. _J._\n_Plant Nutr. Soil Sc._ **2013**, _176_ [, 429–440. [CrossRef]](https://doi.org/10.1002/jpln.201200257)\n30. Zhao, X.; Gao, S.; Lu, D.; Wang, H.; Chen, X.; Zhou, J.; Zhang, L. Can Potassium Silicate Mineral Products Replace Conventional\nPotassium Fertilizers in Rice–Wheat Rotation? _Agron. J._ **2019**, _111_ [, 2075–2083. [CrossRef]](https://doi.org/10.2134/agronj2019.01.0020)\n31. WANG, H.; CHENG, W.; LI, T.; ZHOU, J.; CHEN, X. Can Nonexchangeable Potassium be Differentiated from Structural Potassium\nin Soils? _Pedosphere_ **2016**, _26_ [, 206–215. [CrossRef]](https://doi.org/10.1016/S1002-0160(15)60035-2)\n32. Han, Y.; Ma, W.; Zhou, B.; Salah, A.; Geng, M.; Cao, C.; Zhan, M.; Zhao, M. Straw Return Increases Crop Grain Yields and K-Use\nEfficiency under a Maize-Rice Cropping System. _Crop J._ **2021**, _9_ [, 168–180. [CrossRef]](https://doi.org/10.1016/j.cj.2020.04.003)\n33. Li, J.; Gan, G.; Chen, X.; Zou, J. Effects of Long-Term Straw Management and Potassium Fertilization on Crop Yield, Soil Properties,\nand Microbial Community in a Rice–Oilseed Rape Rotation. _Agriculture_ **2021**, _11_ [, 1233. [CrossRef]](https://doi.org/10.3390/agriculture11121233)\n34. Hamoud, Y.A.; Wang, Z.; Guo, X.; Shaghaleh, H.; Sheteiwy, M.; Chen, S.; Qiu, R.; Elbashier, M.M.A. Effect of Irrigation Regimes\nand Soil Texture on the Potassium Utilization Efficiency of Rice. _Agronomy_ **2019**, _9_ [, 100. [CrossRef]](https://doi.org/10.3390/agronomy9020100)\n35. Singh, V.K.; Dwivedi, B.S.; Rathore, S.S.; Mishra, R.P.; Satyanarayana, T.; Majumdar, K. Timing Potassium Applications to\nSynchronize with Plant Demand. In _Improving Potassium Recommendations for Agricultural Crops_ ; Murrell, T.S., Mikkelsen, R.L.,\nSulewski, G., Norton, R., Thompson, M.L., Eds.; Springer International Publishing: Cham, Switzerland, 2021; pp. 363–384.\n\n[[CrossRef]](https://doi.org/10.1007/978-3-030-59197-7_13)\n36. Steiner, F.; Pivetta, L.A.; Castoldi, G.; Costa, M.S.S.d.M.; Costa, L.A.d.M. Phosphorus and Potassium Balance in Soil under Crop\nRotation and Fertilization. _Semin. Ciênc. Agrár._ **2012**, _33_ [, 2173–2186. [CrossRef]](https://doi.org/10.5433/1679-0359.2012v33n6p2173)\n37. Oteros, J.; García-Mozo, H.; Vázquez, L.; Mestre, A.; Domínguez-Vilches, E.; Galán, C. Modelling olive phenological response to\nweather and topography. _Agric. Ecosyst. Environ._ **2013**, _179_ [, 62–68. [CrossRef]](https://doi.org/10.1016/j.agee.2013.07.008)\n38. Wei, W.; Chen, L.; Zhang, H.; Yang, L.; Yu, Y.; Chen, J. Effects of crop rotation and rainfall on water erosion on a gentle slope in\nthe hilly loess area, China. _Catena_ **2014**, _123_ [, 205–214. [CrossRef]](https://doi.org/10.1016/j.catena.2014.08.002)\n39. Tang, Y.; Lu, X.; Yi, J.; Wang, H.; Zhang, X.; Zheng, W. Evaluating the spatial spillover effect of farmland use transition on grain\nproduction—An empirical study in Hubei Province, China. _Ecol. Indic._ **2021**, _125_ [, 107478. [CrossRef]](https://doi.org/10.1016/j.ecolind.2021.107478)\n40. Lin, Y.; Prentice, S.E.; Tran, T.; Bingham, N.L.; King, J.Y.; Chadwick, O.A. Modeling deep soil properties on California grassland\nhillslopes using LiDAR digital elevation models. _Geoderma Reg._ **2016**, _7_ [, 67–75. [CrossRef]](https://doi.org/10.1016/j.geodrs.2016.01.005)\n41. Dalzell, B.J.; Fissore, C.; Nater, E.A. Topography and land use impact erosion and soil organic carbon burial over decadal\ntimescales. _Catena_ **2022**, _218_ [, 106578. [CrossRef]](https://doi.org/10.1016/j.catena.2022.106578)\n42. Liu, W.; Zhang, Q.; Fu, Z.; Chen, X.; Li, H. Analysis and Estimation of Geographical and Topographic Influencing Fac-tors for\nPrecipitation Distribution over Complex Terrains: A Case of the Northeast Slope of the Qinghai–Tibet Plateau. _Atmosphere_ **2018**,\n_9_ [, 349. [CrossRef]](https://doi.org/10.3390/atmos9090349)\n43. Wang, Y.; Shen, Y.; Xie, Y.; Ma, H.; Li, W.; Luo, X.; Zhang, H.; Zhang, Y.; Li, J. Changes in precipitation have both di-rect and\nindirect effects on typical steppe aboveground net primary productivity in Loess Plateau, China. _Plant Soil_ **2023**, _484_, 503–515.\n\n[[CrossRef]](https://doi.org/10.1007/s11104-022-05812-8)\n44. Cappuccio, F.P.; Buchanan, L.A.; Ji, C.; Siani, A.; Miller, M.A. Systematic review and meta-analysis of randomised con-trolled\ntrials on the effects of potassium supplements on serum potassium and creatinine. _BMJ Open_ **2016**, _6_ [, e11716. [CrossRef]](https://doi.org/10.1136/bmjopen-2016-011716)\n45. Mottaleb, K.A.; Krupnik, T.J.; Erenstein, O. Factors associated with small-scale agricultural machinery adoption in Bangladesh:\nCensus findings. _J. Rural Stud._ **2016**, _46_ [, 155–168. [CrossRef] [PubMed]](https://doi.org/10.1016/j.jrurstud.2016.06.012)\n46. Ajiboye, A.G.; Ogunwale, A.J. Forms and distribution of potassium in particle size fractions on talc overburden soils in Nigeria.\n_Arch. Agron. Soil Sci._ **2013**, _59_ [, 247–258. [CrossRef]](https://doi.org/10.1080/03650340.2011.610031)\n47. Chen, Y.; Huang, L.; Cheng, L.; Liu, Z.; Bin, X. Straw returning and potassium fertilization affect clay mineralogy and available\npotassium. _Nutr. Cycl. Agroecosy._ **2023**, _126_ [, 195–211. [CrossRef]](https://doi.org/10.1007/s10705-023-10284-y)\n48. Zhuang, J.; Peng, J.; Zhu, Y.; Leng, Y.; Zhu, X.; Huang, W. The internal erosion process and effects of undisturbed loess due to\nwater infiltration. _Landslides_ **2021**, _18_ [, 629–638. [CrossRef]](https://doi.org/10.1007/s10346-020-01518-z)\n49. Zygalakis, K.C.; Kirk, G.J.D.; Jones, D.L.; Wissuwa, M.; Roose, T. A dual porosity model of nutrient uptake by root hairs. _N. Phytol._\n**2011**, _192_ [, 676–688. [CrossRef]](https://doi.org/10.1111/j.1469-8137.2011.03840.x)\n50. Huang, L.; Dong, B.; Xue, W.; Peng, Y.; Zhang, M.; Yu, F. Soil Particle Heterogeneity Affects the Growth of a Rhizoma-tous\nWetland Plant. _PLoS ONE_ **2013**, _8_, e69836.\n51. Golestanifard, A.; Santner, J.; Aryan, A.; Kaul, H.; Wenzel, W.W. Potassium fixation in northern Iranian paddy soils. _Geoderma_\n**2020**, _375_ [, 114475. [CrossRef]](https://doi.org/10.1016/j.geoderma.2020.114475)\n52. Portela, E.; Monteiro, F.; Fonseca, M.; Abreu, M.M. Effect of soil mineralogy on potassium fixation in soils developed on different\nparent material. _Geoderma_ **2019**, _343_ [, 226–234. [CrossRef]](https://doi.org/10.1016/j.geoderma.2019.02.040)\n\n\n_Sustainability_ **2023**, _15_, 15348 16 of 16\n\n\n53. Simonsson, M.; Hillier, S.; Öborn, I. Changes in clay minerals and potassium fixation capacity as a result of release and fixation of\npotassium in long-term field experiments. _Geoderma_ **2009**, _151_ [, 109–120. [CrossRef]](https://doi.org/10.1016/j.geoderma.2009.03.018)\n54. Barré, P.; Velde, B.; Fontaine, C.; Catel, N.; Abbadie, L. Which 2:1 clay minerals are involved in the soil potassium reservoir?\nInsights from potassium addition or removal experiments on three temperate grassland soil clay assemblages. _Geoderma_ **2008**,\n_146_ [, 216–223. [CrossRef]](https://doi.org/10.1016/j.geoderma.2008.05.022)\n\n\n**Disclaimer/Publisher’s Note:** The statements, opinions and data contained in all publications are solely those of the individual\nauthor(s) and contributor(s) and not of MDPI and/or the editor(s). MDPI and/or the editor(s) disclaim responsibility for any injury to\npeople or property resulting from any ideas, methods, instructions or products referred to in the content.\n\n\n",
  "table_data": [
    {
      "table_id": "Soil K Balance in Sichuan_table_0",
      "page": 3,
      "accuracy": 0,
      "data": [
        {
          "0": "",
          "1": "",
          "2": ""
        },
        {
          "0": "",
          "1": "",
          "2": ""
        },
        {
          "0": "",
          "1": "",
          "2": ""
        }
      ],
      "shape": [
        3,
        3
      ]
    },
    {
      "table_id": "Soil K Balance in Sichuan_table_1",
      "page": 11,
      "accuracy": 0,
      "data": [
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": ""
        },
        {
          "0": "",
          "1": "",
          "2": "",
          "3": "",
          "4": "",
          "5": ""
        }
      ],
      "shape": [
        2,
        6
      ]
    }
  ]
}